TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 23 15:51:01 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("Gui.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

   30740                      .dwendtag DW$T$434
   30741              
   30742              DW$T$436        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$435)
   30743                      .dwattr DW$T$436, DW_AT_address_class(0x16)
   30744              
   30745              DW$T$437        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$436)
   30746                      .dwattr DW$T$437, DW_AT_language(DW_LANG_C)
   30747              DW$2241 .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$44)
   30748                      .dwendtag DW$T$437
   30749              
   30750              DW$T$424        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$423)
   30751                      .dwattr DW$T$424, DW_AT_address_class(0x16)
   30752              DW$T$439        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$422)
   30753                      .dwattr DW$T$439, DW_AT_address_class(0x16)
   30754              DW$T$237        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$236)
   30755                      .dwattr DW$T$237, DW_AT_address_class(0x16)
   30756              
   30757              DW$T$440        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$237)
   30758                      .dwattr DW$T$440, DW_AT_language(DW_LANG_C)
   30759              
   30760              DW$T$442        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$237)
   30761                      .dwattr DW$T$442, DW_AT_language(DW_LANG_C)
   30762              DW$2242 .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
   30763              DW$2243 .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
   30764              DW$2244 .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
   30765              DW$2245 .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
   30766                      .dwendtag DW$T$442
   30767              
   30768              
   30769              DW$T$444        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$236)
   30770                      .dwattr DW$T$444, DW_AT_language(DW_LANG_C)
   30771                      .dwattr DW$T$444, DW_AT_byte_size(0x32)
   30772              DW$2246 .dwtag  DW_TAG_subrange_type
   30773                      .dwattr DW$2246, DW_AT_upper_bound(0x04)
   30774                      .dwendtag DW$T$444
   30775              
   30776              DW$T$243        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$242)
   30777                      .dwattr DW$T$243, DW_AT_address_class(0x16)
   30778              DW$2247 .dwtag  DW_TAG_far_type
   30779                      .dwattr DW$2247, DW_AT_type(*DW$T$91)
   30780              DW$T$447        .dwtag  DW_TAG_volatile_type
   30781                      .dwattr DW$T$447, DW_AT_type(*DW$2247)
   30782              DW$2248 .dwtag  DW_TAG_far_type
   30783                      .dwattr DW$2248, DW_AT_type(*DW$T$123)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  593

   30784              DW$T$458        .dwtag  DW_TAG_volatile_type
   30785                      .dwattr DW$T$458, DW_AT_type(*DW$2248)
   30786              
   30787              DW$T$460        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$459)
   30788                      .dwattr DW$T$460, DW_AT_language(DW_LANG_C)
   30789                      .dwattr DW$T$460, DW_AT_byte_size(0x78)
   30790              DW$2249 .dwtag  DW_TAG_subrange_type
   30791                      .dwattr DW$2249, DW_AT_upper_bound(0x1d)
   30792                      .dwendtag DW$T$460
   30793              
   30794              DW$T$463        .dwtag  DW_TAG_typedef, DW_AT_name("touch_scale_t"), DW_AT_type(*DW$T$125)
   30795                      .dwattr DW$T$463, DW_AT_language(DW_LANG_C)
   30796              DW$T$464        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$463)
   30797                      .dwattr DW$T$464, DW_AT_address_class(0x16)
   30798              DW$T$466        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$465)
   30799                      .dwattr DW$T$466, DW_AT_address_class(0x16)
   30800              DW$T$467        .dwtag  DW_TAG_typedef, DW_AT_name("HZlib_info_t"), DW_AT_type(*DW$T$127)
   30801                      .dwattr DW$T$467, DW_AT_language(DW_LANG_C)
   30802              
   30803              DW$T$323        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
   30804                      .dwattr DW$T$323, DW_AT_language(DW_LANG_C)
   30805              DW$2250 .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$44)
   30806                      .dwendtag DW$T$323
   30807              
   30808              DW$2251 .dwtag  DW_TAG_far_type
   30809                      .dwattr DW$2251, DW_AT_type(*DW$T$6)
   30810              DW$T$333        .dwtag  DW_TAG_const_type
   30811                      .dwattr DW$T$333, DW_AT_type(*DW$2251)
   30812              DW$T$134        .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
   30813                      .dwattr DW$T$134, DW_AT_language(DW_LANG_C)
   30814              DW$T$135        .dwtag  DW_TAG_typedef, DW_AT_name("a_lock_t"), DW_AT_type(*DW$T$134)
   30815                      .dwattr DW$T$135, DW_AT_language(DW_LANG_C)
   30816              DW$T$279        .dwtag  DW_TAG_typedef, DW_AT_name("a_sem_t"), DW_AT_type(*DW$T$134)
   30817                      .dwattr DW$T$279, DW_AT_language(DW_LANG_C)
   30818              DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("tmr_member_t"), DW_AT_type(*DW$T$27)
   30819                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
   30820              
   30821              DW$T$28 .dwtag  DW_TAG_structure_type
   30822                      .dwattr DW$T$28, DW_AT_byte_size(0x03)
   30823              DW$2252 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   30824                      .dwattr DW$2252, DW_AT_name("x"), DW_AT_symbol_name("_x")
   30825                      .dwattr DW$2252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   30826                      .dwattr DW$2252, DW_AT_accessibility(DW_ACCESS_public)
   30827              DW$2253 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   30828                      .dwattr DW$2253, DW_AT_name("y"), DW_AT_symbol_name("_y")
   30829                      .dwattr DW$2253, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   30830                      .dwattr DW$2253, DW_AT_accessibility(DW_ACCESS_public)
   30831              DW$2254 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   30832                      .dwattr DW$2254, DW_AT_name("state"), DW_AT_symbol_name("_state")
   30833                      .dwattr DW$2254, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   30834                      .dwattr DW$2254, DW_AT_accessibility(DW_ACCESS_public)
   30835                      .dwendtag DW$T$28
   30836              
   30837              DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$30)
   30838                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  594

   30839              DW$2255 .dwtag  DW_TAG_far_type
   30840                      .dwattr DW$2255, DW_AT_type(*DW$T$34)
   30841              DW$T$35 .dwtag  DW_TAG_const_type
   30842                      .dwattr DW$T$35, DW_AT_type(*DW$2255)
   30843              DW$T$43 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$39)
   30844                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
   30845              DW$2256 .dwtag  DW_TAG_far_type
   30846                      .dwattr DW$2256, DW_AT_type(*DW$T$44)
   30847              DW$T$433        .dwtag  DW_TAG_const_type
   30848                      .dwattr DW$T$433, DW_AT_type(*DW$2256)
   30849              DW$T$435        .dwtag  DW_TAG_typedef, DW_AT_name("widget_button_t"), DW_AT_type(*DW$T$41)
   30850                      .dwattr DW$T$435, DW_AT_language(DW_LANG_C)
   30851              DW$T$422        .dwtag  DW_TAG_typedef, DW_AT_name("dialogBox_t"), DW_AT_type(*DW$T$47)
   30852                      .dwattr DW$T$422, DW_AT_language(DW_LANG_C)
   30853              DW$2257 .dwtag  DW_TAG_far_type
   30854                      .dwattr DW$2257, DW_AT_type(*DW$T$422)
   30855              DW$T$423        .dwtag  DW_TAG_const_type
   30856                      .dwattr DW$T$423, DW_AT_type(*DW$2257)
   30857              DW$T$236        .dwtag  DW_TAG_typedef, DW_AT_name("lcd_csr_arg_t"), DW_AT_type(*DW$T$50)
   30858                      .dwattr DW$T$236, DW_AT_language(DW_LANG_C)
   30859              DW$T$242        .dwtag  DW_TAG_typedef, DW_AT_name("touch_scale_save_t"), DW_AT_type(*DW$T$54)
   30860                      .dwattr DW$T$242, DW_AT_language(DW_LANG_C)
   30861              
   30862              DW$T$91 .dwtag  DW_TAG_structure_type
   30863                      .dwattr DW$T$91, DW_AT_name("GPIO_MUX_REGS")
   30864                      .dwattr DW$T$91, DW_AT_byte_size(0x20)
   30865              DW$2258 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
   30866                      .dwattr DW$2258, DW_AT_name("GPAMUX"), DW_AT_symbol_name("_GPAMUX")
   30867                      .dwattr DW$2258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   30868                      .dwattr DW$2258, DW_AT_accessibility(DW_ACCESS_public)
   30869              DW$2259 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
   30870                      .dwattr DW$2259, DW_AT_name("GPADIR"), DW_AT_symbol_name("_GPADIR")
   30871                      .dwattr DW$2259, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   30872                      .dwattr DW$2259, DW_AT_accessibility(DW_ACCESS_public)
   30873              DW$2260 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
   30874                      .dwattr DW$2260, DW_AT_name("GPAQUAL"), DW_AT_symbol_name("_GPAQUAL")
   30875                      .dwattr DW$2260, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   30876                      .dwattr DW$2260, DW_AT_accessibility(DW_ACCESS_public)
   30877              DW$2261 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   30878                      .dwattr DW$2261, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
   30879                      .dwattr DW$2261, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   30880                      .dwattr DW$2261, DW_AT_accessibility(DW_ACCESS_public)
   30881              DW$2262 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
   30882                      .dwattr DW$2262, DW_AT_name("GPBMUX"), DW_AT_symbol_name("_GPBMUX")
   30883                      .dwattr DW$2262, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   30884                      .dwattr DW$2262, DW_AT_accessibility(DW_ACCESS_public)
   30885              DW$2263 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
   30886                      .dwattr DW$2263, DW_AT_name("GPBDIR"), DW_AT_symbol_name("_GPBDIR")
   30887                      .dwattr DW$2263, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   30888                      .dwattr DW$2263, DW_AT_accessibility(DW_ACCESS_public)
   30889              DW$2264 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
   30890                      .dwattr DW$2264, DW_AT_name("GPBQUAL"), DW_AT_symbol_name("_GPBQUAL")
   30891                      .dwattr DW$2264, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   30892                      .dwattr DW$2264, DW_AT_accessibility(DW_ACCESS_public)
   30893              DW$2265 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  595

   30894                      .dwattr DW$2265, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
   30895                      .dwattr DW$2265, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   30896                      .dwattr DW$2265, DW_AT_accessibility(DW_ACCESS_public)
   30897              DW$2266 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
   30898                      .dwattr DW$2266, DW_AT_name("GPDMUX"), DW_AT_symbol_name("_GPDMUX")
   30899                      .dwattr DW$2266, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   30900                      .dwattr DW$2266, DW_AT_accessibility(DW_ACCESS_public)
   30901              DW$2267 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
   30902                      .dwattr DW$2267, DW_AT_name("GPDDIR"), DW_AT_symbol_name("_GPDDIR")
   30903                      .dwattr DW$2267, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   30904                      .dwattr DW$2267, DW_AT_accessibility(DW_ACCESS_public)
   30905              DW$2268 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
   30906                      .dwattr DW$2268, DW_AT_name("GPDQUAL"), DW_AT_symbol_name("_GPDQUAL")
   30907                      .dwattr DW$2268, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   30908                      .dwattr DW$2268, DW_AT_accessibility(DW_ACCESS_public)
   30909              DW$2269 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   30910                      .dwattr DW$2269, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
   30911                      .dwattr DW$2269, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
   30912                      .dwattr DW$2269, DW_AT_accessibility(DW_ACCESS_public)
   30913              DW$2270 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$75)
   30914                      .dwattr DW$2270, DW_AT_name("GPEMUX"), DW_AT_symbol_name("_GPEMUX")
   30915                      .dwattr DW$2270, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   30916                      .dwattr DW$2270, DW_AT_accessibility(DW_ACCESS_public)
   30917              DW$2271 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
   30918                      .dwattr DW$2271, DW_AT_name("GPEDIR"), DW_AT_symbol_name("_GPEDIR")
   30919                      .dwattr DW$2271, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   30920                      .dwattr DW$2271, DW_AT_accessibility(DW_ACCESS_public)
   30921              DW$2272 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
   30922                      .dwattr DW$2272, DW_AT_name("GPEQUAL"), DW_AT_symbol_name("_GPEQUAL")
   30923                      .dwattr DW$2272, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   30924                      .dwattr DW$2272, DW_AT_accessibility(DW_ACCESS_public)
   30925              DW$2273 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   30926                      .dwattr DW$2273, DW_AT_name("rsvd4"), DW_AT_symbol_name("_rsvd4")
   30927                      .dwattr DW$2273, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
   30928                      .dwattr DW$2273, DW_AT_accessibility(DW_ACCESS_public)
   30929              DW$2274 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$81)
   30930                      .dwattr DW$2274, DW_AT_name("GPFMUX"), DW_AT_symbol_name("_GPFMUX")
   30931                      .dwattr DW$2274, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   30932                      .dwattr DW$2274, DW_AT_accessibility(DW_ACCESS_public)
   30933              DW$2275 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$83)
   30934                      .dwattr DW$2275, DW_AT_name("GPFDIR"), DW_AT_symbol_name("_GPFDIR")
   30935                      .dwattr DW$2275, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   30936                      .dwattr DW$2275, DW_AT_accessibility(DW_ACCESS_public)
   30937              DW$2276 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
   30938                      .dwattr DW$2276, DW_AT_name("rsvd5"), DW_AT_symbol_name("_rsvd5")
   30939                      .dwattr DW$2276, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   30940                      .dwattr DW$2276, DW_AT_accessibility(DW_ACCESS_public)
   30941              DW$2277 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$85)
   30942                      .dwattr DW$2277, DW_AT_name("GPGMUX"), DW_AT_symbol_name("_GPGMUX")
   30943                      .dwattr DW$2277, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   30944                      .dwattr DW$2277, DW_AT_accessibility(DW_ACCESS_public)
   30945              DW$2278 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$87)
   30946                      .dwattr DW$2278, DW_AT_name("GPGDIR"), DW_AT_symbol_name("_GPGDIR")
   30947                      .dwattr DW$2278, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   30948                      .dwattr DW$2278, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  596

   30949              DW$2279 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
   30950                      .dwattr DW$2279, DW_AT_name("rsvd6"), DW_AT_symbol_name("_rsvd6")
   30951                      .dwattr DW$2279, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   30952                      .dwattr DW$2279, DW_AT_accessibility(DW_ACCESS_public)
   30953                      .dwendtag DW$T$91
   30954              
   30955              
   30956              DW$T$123        .dwtag  DW_TAG_structure_type
   30957                      .dwattr DW$T$123, DW_AT_name("EVB_REGS")
   30958                      .dwattr DW$T$123, DW_AT_byte_size(0x32)
   30959              DW$2280 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$93)
   30960                      .dwattr DW$2280, DW_AT_name("GPTCONB"), DW_AT_symbol_name("_GPTCONB")
   30961                      .dwattr DW$2280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   30962                      .dwattr DW$2280, DW_AT_accessibility(DW_ACCESS_public)
   30963              DW$2281 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   30964                      .dwattr DW$2281, DW_AT_name("T3CNT"), DW_AT_symbol_name("_T3CNT")
   30965                      .dwattr DW$2281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   30966                      .dwattr DW$2281, DW_AT_accessibility(DW_ACCESS_public)
   30967              DW$2282 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   30968                      .dwattr DW$2282, DW_AT_name("T3CMPR"), DW_AT_symbol_name("_T3CMPR")
   30969                      .dwattr DW$2282, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   30970                      .dwattr DW$2282, DW_AT_accessibility(DW_ACCESS_public)
   30971              DW$2283 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   30972                      .dwattr DW$2283, DW_AT_name("T3PR"), DW_AT_symbol_name("_T3PR")
   30973                      .dwattr DW$2283, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   30974                      .dwattr DW$2283, DW_AT_accessibility(DW_ACCESS_public)
   30975              DW$2284 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
   30976                      .dwattr DW$2284, DW_AT_name("T3CON"), DW_AT_symbol_name("_T3CON")
   30977                      .dwattr DW$2284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   30978                      .dwattr DW$2284, DW_AT_accessibility(DW_ACCESS_public)
   30979              DW$2285 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   30980                      .dwattr DW$2285, DW_AT_name("T4CNT"), DW_AT_symbol_name("_T4CNT")
   30981                      .dwattr DW$2285, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   30982                      .dwattr DW$2285, DW_AT_accessibility(DW_ACCESS_public)
   30983              DW$2286 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   30984                      .dwattr DW$2286, DW_AT_name("T4CMPR"), DW_AT_symbol_name("_T4CMPR")
   30985                      .dwattr DW$2286, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   30986                      .dwattr DW$2286, DW_AT_accessibility(DW_ACCESS_public)
   30987              DW$2287 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   30988                      .dwattr DW$2287, DW_AT_name("T4PR"), DW_AT_symbol_name("_T4PR")
   30989                      .dwattr DW$2287, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   30990                      .dwattr DW$2287, DW_AT_accessibility(DW_ACCESS_public)
   30991              DW$2288 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
   30992                      .dwattr DW$2288, DW_AT_name("T4CON"), DW_AT_symbol_name("_T4CON")
   30993                      .dwattr DW$2288, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   30994                      .dwattr DW$2288, DW_AT_accessibility(DW_ACCESS_public)
   30995              DW$2289 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
   30996                      .dwattr DW$2289, DW_AT_name("EXTCONB"), DW_AT_symbol_name("_EXTCONB")
   30997                      .dwattr DW$2289, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   30998                      .dwattr DW$2289, DW_AT_accessibility(DW_ACCESS_public)
   30999              DW$2290 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$122)
   31000                      .dwattr DW$2290, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
   31001                      .dwattr DW$2290, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   31002                      .dwattr DW$2290, DW_AT_accessibility(DW_ACCESS_public)
   31003              DW$2291 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  597

   31004                      .dwattr DW$2291, DW_AT_name("COMCONB"), DW_AT_symbol_name("_COMCONB")
   31005                      .dwattr DW$2291, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
   31006                      .dwattr DW$2291, DW_AT_accessibility(DW_ACCESS_public)
   31007              DW$2292 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31008                      .dwattr DW$2292, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
   31009                      .dwattr DW$2292, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   31010                      .dwattr DW$2292, DW_AT_accessibility(DW_ACCESS_public)
   31011              DW$2293 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
   31012                      .dwattr DW$2293, DW_AT_name("ACTRB"), DW_AT_symbol_name("_ACTRB")
   31013                      .dwattr DW$2293, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
   31014                      .dwattr DW$2293, DW_AT_accessibility(DW_ACCESS_public)
   31015              DW$2294 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31016                      .dwattr DW$2294, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
   31017                      .dwattr DW$2294, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   31018                      .dwattr DW$2294, DW_AT_accessibility(DW_ACCESS_public)
   31019              DW$2295 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
   31020                      .dwattr DW$2295, DW_AT_name("DBTCONB"), DW_AT_symbol_name("_DBTCONB")
   31021                      .dwattr DW$2295, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   31022                      .dwattr DW$2295, DW_AT_accessibility(DW_ACCESS_public)
   31023              DW$2296 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31024                      .dwattr DW$2296, DW_AT_name("rsvd4"), DW_AT_symbol_name("_rsvd4")
   31025                      .dwattr DW$2296, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   31026                      .dwattr DW$2296, DW_AT_accessibility(DW_ACCESS_public)
   31027              DW$2297 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31028                      .dwattr DW$2297, DW_AT_name("CMPR4"), DW_AT_symbol_name("_CMPR4")
   31029                      .dwattr DW$2297, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   31030                      .dwattr DW$2297, DW_AT_accessibility(DW_ACCESS_public)
   31031              DW$2298 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31032                      .dwattr DW$2298, DW_AT_name("CMPR5"), DW_AT_symbol_name("_CMPR5")
   31033                      .dwattr DW$2298, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   31034                      .dwattr DW$2298, DW_AT_accessibility(DW_ACCESS_public)
   31035              DW$2299 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31036                      .dwattr DW$2299, DW_AT_name("CMPR6"), DW_AT_symbol_name("_CMPR6")
   31037                      .dwattr DW$2299, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   31038                      .dwattr DW$2299, DW_AT_accessibility(DW_ACCESS_public)
   31039              DW$2300 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
   31040                      .dwattr DW$2300, DW_AT_name("rsvd5"), DW_AT_symbol_name("_rsvd5")
   31041                      .dwattr DW$2300, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   31042                      .dwattr DW$2300, DW_AT_accessibility(DW_ACCESS_public)
   31043              DW$2301 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
   31044                      .dwattr DW$2301, DW_AT_name("CAPCONB"), DW_AT_symbol_name("_CAPCONB")
   31045                      .dwattr DW$2301, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   31046                      .dwattr DW$2301, DW_AT_accessibility(DW_ACCESS_public)
   31047              DW$2302 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31048                      .dwattr DW$2302, DW_AT_name("rsvd6"), DW_AT_symbol_name("_rsvd6")
   31049                      .dwattr DW$2302, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   31050                      .dwattr DW$2302, DW_AT_accessibility(DW_ACCESS_public)
   31051              DW$2303 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$109)
   31052                      .dwattr DW$2303, DW_AT_name("CAPFIFOB"), DW_AT_symbol_name("_CAPFIFOB")
   31053                      .dwattr DW$2303, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   31054                      .dwattr DW$2303, DW_AT_accessibility(DW_ACCESS_public)
   31055              DW$2304 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31056                      .dwattr DW$2304, DW_AT_name("CAP4FIFO"), DW_AT_symbol_name("_CAP4FIFO")
   31057                      .dwattr DW$2304, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
   31058                      .dwattr DW$2304, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  598

   31059              DW$2305 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31060                      .dwattr DW$2305, DW_AT_name("CAP5FIFO"), DW_AT_symbol_name("_CAP5FIFO")
   31061                      .dwattr DW$2305, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   31062                      .dwattr DW$2305, DW_AT_accessibility(DW_ACCESS_public)
   31063              DW$2306 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31064                      .dwattr DW$2306, DW_AT_name("CAP6FIFO"), DW_AT_symbol_name("_CAP6FIFO")
   31065                      .dwattr DW$2306, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
   31066                      .dwattr DW$2306, DW_AT_accessibility(DW_ACCESS_public)
   31067              DW$2307 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31068                      .dwattr DW$2307, DW_AT_name("rsvd7"), DW_AT_symbol_name("_rsvd7")
   31069                      .dwattr DW$2307, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   31070                      .dwattr DW$2307, DW_AT_accessibility(DW_ACCESS_public)
   31071              DW$2308 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31072                      .dwattr DW$2308, DW_AT_name("CAP4FBOT"), DW_AT_symbol_name("_CAP4FBOT")
   31073                      .dwattr DW$2308, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   31074                      .dwattr DW$2308, DW_AT_accessibility(DW_ACCESS_public)
   31075              DW$2309 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31076                      .dwattr DW$2309, DW_AT_name("CAP5FBOT"), DW_AT_symbol_name("_CAP5FBOT")
   31077                      .dwattr DW$2309, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   31078                      .dwattr DW$2309, DW_AT_accessibility(DW_ACCESS_public)
   31079              DW$2310 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31080                      .dwattr DW$2310, DW_AT_name("CAP6FBOT"), DW_AT_symbol_name("_CAP6FBOT")
   31081                      .dwattr DW$2310, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
   31082                      .dwattr DW$2310, DW_AT_accessibility(DW_ACCESS_public)
   31083              DW$2311 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
   31084                      .dwattr DW$2311, DW_AT_name("rsvd8"), DW_AT_symbol_name("_rsvd8")
   31085                      .dwattr DW$2311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   31086                      .dwattr DW$2311, DW_AT_accessibility(DW_ACCESS_public)
   31087              DW$2312 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$111)
   31088                      .dwattr DW$2312, DW_AT_name("EVBIMRA"), DW_AT_symbol_name("_EVBIMRA")
   31089                      .dwattr DW$2312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   31090                      .dwattr DW$2312, DW_AT_accessibility(DW_ACCESS_public)
   31091              DW$2313 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$113)
   31092                      .dwattr DW$2313, DW_AT_name("EVBIMRB"), DW_AT_symbol_name("_EVBIMRB")
   31093                      .dwattr DW$2313, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
   31094                      .dwattr DW$2313, DW_AT_accessibility(DW_ACCESS_public)
   31095              DW$2314 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$115)
   31096                      .dwattr DW$2314, DW_AT_name("EVBIMRC"), DW_AT_symbol_name("_EVBIMRC")
   31097                      .dwattr DW$2314, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
   31098                      .dwattr DW$2314, DW_AT_accessibility(DW_ACCESS_public)
   31099              DW$2315 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
   31100                      .dwattr DW$2315, DW_AT_name("EVBIFRA"), DW_AT_symbol_name("_EVBIFRA")
   31101                      .dwattr DW$2315, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
   31102                      .dwattr DW$2315, DW_AT_accessibility(DW_ACCESS_public)
   31103              DW$2316 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
   31104                      .dwattr DW$2316, DW_AT_name("EVBIFRB"), DW_AT_symbol_name("_EVBIFRB")
   31105                      .dwattr DW$2316, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   31106                      .dwattr DW$2316, DW_AT_accessibility(DW_ACCESS_public)
   31107              DW$2317 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$121)
   31108                      .dwattr DW$2317, DW_AT_name("EVBIFRC"), DW_AT_symbol_name("_EVBIFRC")
   31109                      .dwattr DW$2317, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
   31110                      .dwattr DW$2317, DW_AT_accessibility(DW_ACCESS_public)
   31111                      .dwendtag DW$T$123
   31112              
   31113              DW$T$459        .dwtag  DW_TAG_typedef, DW_AT_name("dialogBox_ctl_t"), DW_AT_type(*DW$T$124)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  599

   31114                      .dwattr DW$T$459, DW_AT_language(DW_LANG_C)
   31115              
   31116              DW$T$125        .dwtag  DW_TAG_structure_type
   31117                      .dwattr DW$T$125, DW_AT_byte_size(0x08)
   31118              DW$2318 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   31119                      .dwattr DW$2318, DW_AT_name("Kx"), DW_AT_symbol_name("_Kx")
   31120                      .dwattr DW$2318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31121                      .dwattr DW$2318, DW_AT_accessibility(DW_ACCESS_public)
   31122              DW$2319 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
   31123                      .dwattr DW$2319, DW_AT_name("Ky"), DW_AT_symbol_name("_Ky")
   31124                      .dwattr DW$2319, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   31125                      .dwattr DW$2319, DW_AT_accessibility(DW_ACCESS_public)
   31126              DW$2320 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   31127                      .dwattr DW$2320, DW_AT_name("lcdx"), DW_AT_symbol_name("_lcdx")
   31128                      .dwattr DW$2320, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   31129                      .dwattr DW$2320, DW_AT_accessibility(DW_ACCESS_public)
   31130              DW$2321 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   31131                      .dwattr DW$2321, DW_AT_name("lcdy"), DW_AT_symbol_name("_lcdy")
   31132                      .dwattr DW$2321, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   31133                      .dwattr DW$2321, DW_AT_accessibility(DW_ACCESS_public)
   31134              DW$2322 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   31135                      .dwattr DW$2322, DW_AT_name("touchx"), DW_AT_symbol_name("_touchx")
   31136                      .dwattr DW$2322, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   31137                      .dwattr DW$2322, DW_AT_accessibility(DW_ACCESS_public)
   31138              DW$2323 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   31139                      .dwattr DW$2323, DW_AT_name("touchy"), DW_AT_symbol_name("_touchy")
   31140                      .dwattr DW$2323, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   31141                      .dwattr DW$2323, DW_AT_accessibility(DW_ACCESS_public)
   31142                      .dwendtag DW$T$125
   31143              
   31144              DW$T$465        .dwtag  DW_TAG_typedef, DW_AT_name("touch_coord_t"), DW_AT_type(*DW$T$126)
   31145                      .dwattr DW$T$465, DW_AT_language(DW_LANG_C)
   31146              
   31147              DW$T$127        .dwtag  DW_TAG_structure_type
   31148                      .dwattr DW$T$127, DW_AT_byte_size(0x08)
   31149              DW$2324 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31150                      .dwattr DW$2324, DW_AT_name("is_first_flag"), DW_AT_symbol_name("_is_first_flag")
   31151                      .dwattr DW$2324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31152                      .dwattr DW$2324, DW_AT_accessibility(DW_ACCESS_public)
   31153              DW$2325 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   31154                      .dwattr DW$2325, DW_AT_name("hz_lib_start_addr"), DW_AT_symbol_name("_hz_lib_start_addr")
   31155                      .dwattr DW$2325, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   31156                      .dwattr DW$2325, DW_AT_accessibility(DW_ACCESS_public)
   31157              DW$2326 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   31158                      .dwattr DW$2326, DW_AT_name("hz_lib_size"), DW_AT_symbol_name("_hz_lib_size")
   31159                      .dwattr DW$2326, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   31160                      .dwattr DW$2326, DW_AT_accessibility(DW_ACCESS_public)
   31161              DW$2327 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   31162                      .dwattr DW$2327, DW_AT_name("asc_lib_start_addr"), DW_AT_symbol_name("_asc_lib_start_addr")
   31163                      .dwattr DW$2327, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   31164                      .dwattr DW$2327, DW_AT_accessibility(DW_ACCESS_public)
   31165                      .dwendtag DW$T$127
   31166              
   31167              DW$T$55 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$11)
   31168                      .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  600

   31169              
   31170              DW$T$88 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$55)
   31171                      .dwattr DW$T$88, DW_AT_language(DW_LANG_C)
   31172                      .dwattr DW$T$88, DW_AT_byte_size(0x05)
   31173              DW$2328 .dwtag  DW_TAG_subrange_type
   31174                      .dwattr DW$2328, DW_AT_upper_bound(0x04)
   31175                      .dwendtag DW$T$88
   31176              
   31177              
   31178              DW$T$89 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$55)
   31179                      .dwattr DW$T$89, DW_AT_language(DW_LANG_C)
   31180                      .dwattr DW$T$89, DW_AT_byte_size(0x02)
   31181              DW$2329 .dwtag  DW_TAG_subrange_type
   31182                      .dwattr DW$2329, DW_AT_upper_bound(0x01)
   31183                      .dwendtag DW$T$89
   31184              
   31185              
   31186              DW$T$90 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$55)
   31187                      .dwattr DW$T$90, DW_AT_language(DW_LANG_C)
   31188                      .dwattr DW$T$90, DW_AT_byte_size(0x06)
   31189              DW$2330 .dwtag  DW_TAG_subrange_type
   31190                      .dwattr DW$2330, DW_AT_upper_bound(0x05)
   31191                      .dwendtag DW$T$90
   31192              
   31193              
   31194              DW$T$122        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$55)
   31195                      .dwattr DW$T$122, DW_AT_language(DW_LANG_C)
   31196                      .dwattr DW$T$122, DW_AT_byte_size(0x07)
   31197              DW$2331 .dwtag  DW_TAG_subrange_type
   31198                      .dwattr DW$2331, DW_AT_upper_bound(0x06)
   31199                      .dwendtag DW$T$122
   31200              
   31201              
   31202              DW$T$22 .dwtag  DW_TAG_structure_type
   31203                      .dwattr DW$T$22, DW_AT_name("os_event")
   31204                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
   31205              DW$2332 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
   31206                      .dwattr DW$2332, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
   31207                      .dwattr DW$2332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31208                      .dwattr DW$2332, DW_AT_accessibility(DW_ACCESS_public)
   31209              DW$2333 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
   31210                      .dwattr DW$2333, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
   31211                      .dwattr DW$2333, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   31212                      .dwattr DW$2333, DW_AT_accessibility(DW_ACCESS_public)
   31213              DW$2334 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
   31214                      .dwattr DW$2334, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
   31215                      .dwattr DW$2334, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   31216                      .dwattr DW$2334, DW_AT_accessibility(DW_ACCESS_public)
   31217              DW$2335 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
   31218                      .dwattr DW$2335, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
   31219                      .dwattr DW$2335, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   31220                      .dwattr DW$2335, DW_AT_accessibility(DW_ACCESS_public)
   31221              DW$2336 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
   31222                      .dwattr DW$2336, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
   31223                      .dwattr DW$2336, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  601

   31224                      .dwattr DW$2336, DW_AT_accessibility(DW_ACCESS_public)
   31225                      .dwendtag DW$T$22
   31226              
   31227              
   31228              DW$T$27 .dwtag  DW_TAG_structure_type
   31229                      .dwattr DW$T$27, DW_AT_byte_size(0x0a)
   31230              DW$2337 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
   31231                      .dwattr DW$2337, DW_AT_name("function"), DW_AT_symbol_name("_function")
   31232                      .dwattr DW$2337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31233                      .dwattr DW$2337, DW_AT_accessibility(DW_ACCESS_public)
   31234              DW$2338 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   31235                      .dwattr DW$2338, DW_AT_name("expires"), DW_AT_symbol_name("_expires")
   31236                      .dwattr DW$2338, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   31237                      .dwattr DW$2338, DW_AT_accessibility(DW_ACCESS_public)
   31238              DW$2339 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   31239                      .dwattr DW$2339, DW_AT_name("tmr_state"), DW_AT_symbol_name("_tmr_state")
   31240                      .dwattr DW$2339, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   31241                      .dwattr DW$2339, DW_AT_accessibility(DW_ACCESS_public)
   31242              DW$2340 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   31243                      .dwattr DW$2340, DW_AT_name("type"), DW_AT_symbol_name("_type")
   31244                      .dwattr DW$2340, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   31245                      .dwattr DW$2340, DW_AT_accessibility(DW_ACCESS_public)
   31246              DW$2341 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   31247                      .dwattr DW$2341, DW_AT_name("auto_load_expires"), DW_AT_symbol_name("_auto_load_expires")
   31248                      .dwattr DW$2341, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   31249                      .dwattr DW$2341, DW_AT_accessibility(DW_ACCESS_public)
   31250              DW$2342 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
   31251                      .dwattr DW$2342, DW_AT_name("p_arg"), DW_AT_symbol_name("_p_arg")
   31252                      .dwattr DW$2342, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   31253                      .dwattr DW$2342, DW_AT_accessibility(DW_ACCESS_public)
   31254                      .dwendtag DW$T$27
   31255              
   31256              
   31257              DW$T$30 .dwtag  DW_TAG_structure_type
   31258                      .dwattr DW$T$30, DW_AT_name("edit_mem")
   31259                      .dwattr DW$T$30, DW_AT_byte_size(0x08)
   31260              DW$2343 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31261                      .dwattr DW$2343, DW_AT_name("x"), DW_AT_symbol_name("_x")
   31262                      .dwattr DW$2343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31263                      .dwattr DW$2343, DW_AT_accessibility(DW_ACCESS_public)
   31264              DW$2344 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31265                      .dwattr DW$2344, DW_AT_name("y"), DW_AT_symbol_name("_y")
   31266                      .dwattr DW$2344, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   31267                      .dwattr DW$2344, DW_AT_accessibility(DW_ACCESS_public)
   31268              DW$2345 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   31269                      .dwattr DW$2345, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
   31270                      .dwattr DW$2345, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   31271                      .dwattr DW$2345, DW_AT_accessibility(DW_ACCESS_public)
   31272              DW$2346 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   31273                      .dwattr DW$2346, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
   31274                      .dwattr DW$2346, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   31275                      .dwattr DW$2346, DW_AT_accessibility(DW_ACCESS_public)
   31276              DW$2347 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   31277                      .dwattr DW$2347, DW_AT_name("id"), DW_AT_symbol_name("_id")
   31278                      .dwattr DW$2347, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  602

   31279                      .dwattr DW$2347, DW_AT_accessibility(DW_ACCESS_public)
   31280              DW$2348 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   31281                      .dwattr DW$2348, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
   31282                      .dwattr DW$2348, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   31283                      .dwattr DW$2348, DW_AT_accessibility(DW_ACCESS_public)
   31284              DW$2349 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
   31285                      .dwattr DW$2349, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
   31286                      .dwattr DW$2349, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   31287                      .dwattr DW$2349, DW_AT_accessibility(DW_ACCESS_public)
   31288                      .dwendtag DW$T$30
   31289              
   31290              DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
   31291                      .dwattr DW$T$29, DW_AT_address_class(0x16)
   31292              
   31293              DW$T$39 .dwtag  DW_TAG_structure_type
   31294                      .dwattr DW$T$39, DW_AT_name("hwin")
   31295                      .dwattr DW$T$39, DW_AT_byte_size(0x22)
   31296              DW$2350 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   31297                      .dwattr DW$2350, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
   31298                      .dwattr DW$2350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31299                      .dwattr DW$2350, DW_AT_accessibility(DW_ACCESS_public)
   31300              DW$2351 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31301                      .dwattr DW$2351, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
   31302                      .dwattr DW$2351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   31303                      .dwattr DW$2351, DW_AT_accessibility(DW_ACCESS_public)
   31304              DW$2352 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31305                      .dwattr DW$2352, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
   31306                      .dwattr DW$2352, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   31307                      .dwattr DW$2352, DW_AT_accessibility(DW_ACCESS_public)
   31308              DW$2353 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   31309                      .dwattr DW$2353, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
   31310                      .dwattr DW$2353, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   31311                      .dwattr DW$2353, DW_AT_accessibility(DW_ACCESS_public)
   31312              DW$2354 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   31313                      .dwattr DW$2354, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
   31314                      .dwattr DW$2354, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   31315                      .dwattr DW$2354, DW_AT_accessibility(DW_ACCESS_public)
   31316              DW$2355 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31317                      .dwattr DW$2355, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
   31318                      .dwattr DW$2355, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   31319                      .dwattr DW$2355, DW_AT_accessibility(DW_ACCESS_public)
   31320              DW$2356 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31321                      .dwattr DW$2356, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
   31322                      .dwattr DW$2356, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   31323                      .dwattr DW$2356, DW_AT_accessibility(DW_ACCESS_public)
   31324              DW$2357 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31325                      .dwattr DW$2357, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
   31326                      .dwattr DW$2357, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   31327                      .dwattr DW$2357, DW_AT_accessibility(DW_ACCESS_public)
   31328              DW$2358 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   31329                      .dwattr DW$2358, DW_AT_name("type"), DW_AT_symbol_name("_type")
   31330                      .dwattr DW$2358, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   31331                      .dwattr DW$2358, DW_AT_accessibility(DW_ACCESS_public)
   31332              DW$2359 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
   31333                      .dwattr DW$2359, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  603

   31334                      .dwattr DW$2359, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   31335                      .dwattr DW$2359, DW_AT_accessibility(DW_ACCESS_public)
   31336              DW$2360 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
   31337                      .dwattr DW$2360, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
   31338                      .dwattr DW$2360, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   31339                      .dwattr DW$2360, DW_AT_accessibility(DW_ACCESS_public)
   31340              DW$2361 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
   31341                      .dwattr DW$2361, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
   31342                      .dwattr DW$2361, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   31343                      .dwattr DW$2361, DW_AT_accessibility(DW_ACCESS_public)
   31344              DW$2362 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
   31345                      .dwattr DW$2362, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
   31346                      .dwattr DW$2362, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   31347                      .dwattr DW$2362, DW_AT_accessibility(DW_ACCESS_public)
   31348              DW$2363 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
   31349                      .dwattr DW$2363, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
   31350                      .dwattr DW$2363, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   31351                      .dwattr DW$2363, DW_AT_accessibility(DW_ACCESS_public)
   31352              DW$2364 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
   31353                      .dwattr DW$2364, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
   31354                      .dwattr DW$2364, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   31355                      .dwattr DW$2364, DW_AT_accessibility(DW_ACCESS_public)
   31356              DW$2365 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   31357                      .dwattr DW$2365, DW_AT_name("drop_list_is_start"), DW_AT_symbol_name("_drop_list_is_start")
   31358                      .dwattr DW$2365, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   31359                      .dwattr DW$2365, DW_AT_accessibility(DW_ACCESS_public)
   31360              DW$2366 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
   31361                      .dwattr DW$2366, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
   31362                      .dwattr DW$2366, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   31363                      .dwattr DW$2366, DW_AT_accessibility(DW_ACCESS_public)
   31364              DW$2367 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   31365                      .dwattr DW$2367, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
   31366                      .dwattr DW$2367, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   31367                      .dwattr DW$2367, DW_AT_accessibility(DW_ACCESS_public)
   31368              DW$2368 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   31369                      .dwattr DW$2368, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
   31370                      .dwattr DW$2368, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
   31371                      .dwattr DW$2368, DW_AT_accessibility(DW_ACCESS_public)
   31372              DW$2369 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
   31373                      .dwattr DW$2369, DW_AT_name("checkbox_radio_state"), DW_AT_symbol_name("_checkbox_radio_state")
   31374                      .dwattr DW$2369, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   31375                      .dwattr DW$2369, DW_AT_accessibility(DW_ACCESS_public)
   31376              DW$2370 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31377                      .dwattr DW$2370, DW_AT_name("title_len"), DW_AT_symbol_name("_title_len")
   31378                      .dwattr DW$2370, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
   31379                      .dwattr DW$2370, DW_AT_accessibility(DW_ACCESS_public)
   31380              DW$2371 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31381                      .dwattr DW$2371, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
   31382                      .dwattr DW$2371, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   31383                      .dwattr DW$2371, DW_AT_accessibility(DW_ACCESS_public)
   31384              DW$2372 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
   31385                      .dwattr DW$2372, DW_AT_name("pwidget"), DW_AT_symbol_name("_pwidget")
   31386                      .dwattr DW$2372, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   31387                      .dwattr DW$2372, DW_AT_accessibility(DW_ACCESS_public)
   31388                      .dwendtag DW$T$39
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  604

   31389              
   31390              DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$39)
   31391                      .dwattr DW$T$31, DW_AT_address_class(0x16)
   31392              
   31393              DW$T$41 .dwtag  DW_TAG_structure_type
   31394                      .dwattr DW$T$41, DW_AT_byte_size(0x1c)
   31395              DW$2373 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
   31396                      .dwattr DW$2373, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
   31397                      .dwattr DW$2373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31398                      .dwattr DW$2373, DW_AT_accessibility(DW_ACCESS_public)
   31399              DW$2374 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
   31400                      .dwattr DW$2374, DW_AT_name("button_icon"), DW_AT_symbol_name("_button_icon")
   31401                      .dwattr DW$2374, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   31402                      .dwattr DW$2374, DW_AT_accessibility(DW_ACCESS_public)
   31403              DW$2375 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31404                      .dwattr DW$2375, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
   31405                      .dwattr DW$2375, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   31406                      .dwattr DW$2375, DW_AT_accessibility(DW_ACCESS_public)
   31407              DW$2376 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31408                      .dwattr DW$2376, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
   31409                      .dwattr DW$2376, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   31410                      .dwattr DW$2376, DW_AT_accessibility(DW_ACCESS_public)
   31411              DW$2377 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   31412                      .dwattr DW$2377, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
   31413                      .dwattr DW$2377, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   31414                      .dwattr DW$2377, DW_AT_accessibility(DW_ACCESS_public)
   31415                      .dwendtag DW$T$41
   31416              
   31417              
   31418              DW$T$47 .dwtag  DW_TAG_structure_type
   31419                      .dwattr DW$T$47, DW_AT_byte_size(0x10)
   31420              DW$2378 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   31421                      .dwattr DW$2378, DW_AT_name("member_type"), DW_AT_symbol_name("_member_type")
   31422                      .dwattr DW$2378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31423                      .dwattr DW$2378, DW_AT_accessibility(DW_ACCESS_public)
   31424              DW$2379 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   31425                      .dwattr DW$2379, DW_AT_name("member_id"), DW_AT_symbol_name("_member_id")
   31426                      .dwattr DW$2379, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   31427                      .dwattr DW$2379, DW_AT_accessibility(DW_ACCESS_public)
   31428              DW$2380 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
   31429                      .dwattr DW$2380, DW_AT_name("member_title"), DW_AT_symbol_name("_member_title")
   31430                      .dwattr DW$2380, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   31431                      .dwattr DW$2380, DW_AT_accessibility(DW_ACCESS_public)
   31432              DW$2381 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31433                      .dwattr DW$2381, DW_AT_name("x"), DW_AT_symbol_name("_x")
   31434                      .dwattr DW$2381, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   31435                      .dwattr DW$2381, DW_AT_accessibility(DW_ACCESS_public)
   31436              DW$2382 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31437                      .dwattr DW$2382, DW_AT_name("y"), DW_AT_symbol_name("_y")
   31438                      .dwattr DW$2382, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   31439                      .dwattr DW$2382, DW_AT_accessibility(DW_ACCESS_public)
   31440              DW$2383 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31441                      .dwattr DW$2383, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
   31442                      .dwattr DW$2383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   31443                      .dwattr DW$2383, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  605

   31444              DW$2384 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31445                      .dwattr DW$2384, DW_AT_name("high"), DW_AT_symbol_name("_high")
   31446                      .dwattr DW$2384, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   31447                      .dwattr DW$2384, DW_AT_accessibility(DW_ACCESS_public)
   31448              DW$2385 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   31449                      .dwattr DW$2385, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
   31450                      .dwattr DW$2385, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   31451                      .dwattr DW$2385, DW_AT_accessibility(DW_ACCESS_public)
   31452              DW$2386 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
   31453                      .dwattr DW$2386, DW_AT_name("parg"), DW_AT_symbol_name("_parg")
   31454                      .dwattr DW$2386, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   31455                      .dwattr DW$2386, DW_AT_accessibility(DW_ACCESS_public)
   31456              DW$2387 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   31457                      .dwattr DW$2387, DW_AT_name("arg_size"), DW_AT_symbol_name("_arg_size")
   31458                      .dwattr DW$2387, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   31459                      .dwattr DW$2387, DW_AT_accessibility(DW_ACCESS_public)
   31460              DW$2388 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
   31461                      .dwattr DW$2388, DW_AT_name("callblack"), DW_AT_symbol_name("_callblack")
   31462                      .dwattr DW$2388, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   31463                      .dwattr DW$2388, DW_AT_accessibility(DW_ACCESS_public)
   31464                      .dwendtag DW$T$47
   31465              
   31466              
   31467              DW$T$50 .dwtag  DW_TAG_structure_type
   31468                      .dwattr DW$T$50, DW_AT_byte_size(0x0a)
   31469              DW$2389 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31470                      .dwattr DW$2389, DW_AT_name("x"), DW_AT_symbol_name("_x")
   31471                      .dwattr DW$2389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31472                      .dwattr DW$2389, DW_AT_accessibility(DW_ACCESS_public)
   31473              DW$2390 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31474                      .dwattr DW$2390, DW_AT_name("y"), DW_AT_symbol_name("_y")
   31475                      .dwattr DW$2390, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   31476                      .dwattr DW$2390, DW_AT_accessibility(DW_ACCESS_public)
   31477              DW$2391 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31478                      .dwattr DW$2391, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
   31479                      .dwattr DW$2391, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   31480                      .dwattr DW$2391, DW_AT_accessibility(DW_ACCESS_public)
   31481              DW$2392 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   31482                      .dwattr DW$2392, DW_AT_name("high"), DW_AT_symbol_name("_high")
   31483                      .dwattr DW$2392, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   31484                      .dwattr DW$2392, DW_AT_accessibility(DW_ACCESS_public)
   31485              DW$2393 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
   31486                      .dwattr DW$2393, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
   31487                      .dwattr DW$2393, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   31488                      .dwattr DW$2393, DW_AT_accessibility(DW_ACCESS_public)
   31489              DW$2394 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
   31490                      .dwattr DW$2394, DW_AT_name("flicker_flag"), DW_AT_symbol_name("_flicker_flag")
   31491                      .dwattr DW$2394, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   31492                      .dwattr DW$2394, DW_AT_accessibility(DW_ACCESS_public)
   31493              DW$2395 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
   31494                      .dwattr DW$2395, DW_AT_name("csr_shadow"), DW_AT_symbol_name("_csr_shadow")
   31495                      .dwattr DW$2395, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   31496                      .dwattr DW$2395, DW_AT_accessibility(DW_ACCESS_public)
   31497              DW$2396 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
   31498                      .dwattr DW$2396, DW_AT_name("csr_tmr_id"), DW_AT_symbol_name("_csr_tmr_id")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  606

   31499                      .dwattr DW$2396, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   31500                      .dwattr DW$2396, DW_AT_accessibility(DW_ACCESS_public)
   31501                      .dwendtag DW$T$50
   31502              
   31503              
   31504              DW$T$54 .dwtag  DW_TAG_structure_type
   31505                      .dwattr DW$T$54, DW_AT_byte_size(0x2e)
   31506              DW$2397 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
   31507                      .dwattr DW$2397, DW_AT_name("reset"), DW_AT_symbol_name("_reset")
   31508                      .dwattr DW$2397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31509                      .dwattr DW$2397, DW_AT_accessibility(DW_ACCESS_public)
   31510              DW$2398 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
   31511                      .dwattr DW$2398, DW_AT_name("cKx"), DW_AT_symbol_name("_cKx")
   31512                      .dwattr DW$2398, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   31513                      .dwattr DW$2398, DW_AT_accessibility(DW_ACCESS_public)
   31514              DW$2399 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
   31515                      .dwattr DW$2399, DW_AT_name("cKy"), DW_AT_symbol_name("_cKy")
   31516                      .dwattr DW$2399, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   31517                      .dwattr DW$2399, DW_AT_accessibility(DW_ACCESS_public)
   31518              DW$2400 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
   31519                      .dwattr DW$2400, DW_AT_name("clcdx"), DW_AT_symbol_name("_clcdx")
   31520                      .dwattr DW$2400, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   31521                      .dwattr DW$2400, DW_AT_accessibility(DW_ACCESS_public)
   31522              DW$2401 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
   31523                      .dwattr DW$2401, DW_AT_name("clcdy"), DW_AT_symbol_name("_clcdy")
   31524                      .dwattr DW$2401, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   31525                      .dwattr DW$2401, DW_AT_accessibility(DW_ACCESS_public)
   31526              DW$2402 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
   31527                      .dwattr DW$2402, DW_AT_name("ctouchx"), DW_AT_symbol_name("_ctouchx")
   31528                      .dwattr DW$2402, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   31529                      .dwattr DW$2402, DW_AT_accessibility(DW_ACCESS_public)
   31530              DW$2403 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
   31531                      .dwattr DW$2403, DW_AT_name("ctouchy"), DW_AT_symbol_name("_ctouchy")
   31532                      .dwattr DW$2403, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   31533                      .dwattr DW$2403, DW_AT_accessibility(DW_ACCESS_public)
   31534                      .dwendtag DW$T$54
   31535              
   31536              
   31537              DW$T$57 .dwtag  DW_TAG_union_type
   31538                      .dwattr DW$T$57, DW_AT_name("GPAMUX_REG")
   31539                      .dwattr DW$T$57, DW_AT_byte_size(0x01)
   31540              DW$2404 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31541                      .dwattr DW$2404, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31542                      .dwattr DW$2404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31543                      .dwattr DW$2404, DW_AT_accessibility(DW_ACCESS_public)
   31544              DW$2405 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
   31545                      .dwattr DW$2405, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31546                      .dwattr DW$2405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31547                      .dwattr DW$2405, DW_AT_accessibility(DW_ACCESS_public)
   31548                      .dwendtag DW$T$57
   31549              
   31550              
   31551              DW$T$59 .dwtag  DW_TAG_union_type
   31552                      .dwattr DW$T$59, DW_AT_name("GPADIR_REG")
   31553                      .dwattr DW$T$59, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  607

   31554              DW$2406 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31555                      .dwattr DW$2406, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31556                      .dwattr DW$2406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31557                      .dwattr DW$2406, DW_AT_accessibility(DW_ACCESS_public)
   31558              DW$2407 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
   31559                      .dwattr DW$2407, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31560                      .dwattr DW$2407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31561                      .dwattr DW$2407, DW_AT_accessibility(DW_ACCESS_public)
   31562                      .dwendtag DW$T$59
   31563              
   31564              
   31565              DW$T$61 .dwtag  DW_TAG_union_type
   31566                      .dwattr DW$T$61, DW_AT_name("GPAQUAL_REG")
   31567                      .dwattr DW$T$61, DW_AT_byte_size(0x01)
   31568              DW$2408 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31569                      .dwattr DW$2408, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31570                      .dwattr DW$2408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31571                      .dwattr DW$2408, DW_AT_accessibility(DW_ACCESS_public)
   31572              DW$2409 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
   31573                      .dwattr DW$2409, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31574                      .dwattr DW$2409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31575                      .dwattr DW$2409, DW_AT_accessibility(DW_ACCESS_public)
   31576                      .dwendtag DW$T$61
   31577              
   31578              
   31579              DW$T$63 .dwtag  DW_TAG_union_type
   31580                      .dwattr DW$T$63, DW_AT_name("GPBMUX_REG")
   31581                      .dwattr DW$T$63, DW_AT_byte_size(0x01)
   31582              DW$2410 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31583                      .dwattr DW$2410, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31584                      .dwattr DW$2410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31585                      .dwattr DW$2410, DW_AT_accessibility(DW_ACCESS_public)
   31586              DW$2411 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
   31587                      .dwattr DW$2411, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31588                      .dwattr DW$2411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31589                      .dwattr DW$2411, DW_AT_accessibility(DW_ACCESS_public)
   31590                      .dwendtag DW$T$63
   31591              
   31592              
   31593              DW$T$65 .dwtag  DW_TAG_union_type
   31594                      .dwattr DW$T$65, DW_AT_name("GPBDIR_REG")
   31595                      .dwattr DW$T$65, DW_AT_byte_size(0x01)
   31596              DW$2412 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31597                      .dwattr DW$2412, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31598                      .dwattr DW$2412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31599                      .dwattr DW$2412, DW_AT_accessibility(DW_ACCESS_public)
   31600              DW$2413 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
   31601                      .dwattr DW$2413, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31602                      .dwattr DW$2413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31603                      .dwattr DW$2413, DW_AT_accessibility(DW_ACCESS_public)
   31604                      .dwendtag DW$T$65
   31605              
   31606              
   31607              DW$T$67 .dwtag  DW_TAG_union_type
   31608                      .dwattr DW$T$67, DW_AT_name("GPBQUAL_REG")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  608

   31609                      .dwattr DW$T$67, DW_AT_byte_size(0x01)
   31610              DW$2414 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31611                      .dwattr DW$2414, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31612                      .dwattr DW$2414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31613                      .dwattr DW$2414, DW_AT_accessibility(DW_ACCESS_public)
   31614              DW$2415 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
   31615                      .dwattr DW$2415, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31616                      .dwattr DW$2415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31617                      .dwattr DW$2415, DW_AT_accessibility(DW_ACCESS_public)
   31618                      .dwendtag DW$T$67
   31619              
   31620              
   31621              DW$T$69 .dwtag  DW_TAG_union_type
   31622                      .dwattr DW$T$69, DW_AT_name("GPDMUX_REG")
   31623                      .dwattr DW$T$69, DW_AT_byte_size(0x01)
   31624              DW$2416 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31625                      .dwattr DW$2416, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31626                      .dwattr DW$2416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31627                      .dwattr DW$2416, DW_AT_accessibility(DW_ACCESS_public)
   31628              DW$2417 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
   31629                      .dwattr DW$2417, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31630                      .dwattr DW$2417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31631                      .dwattr DW$2417, DW_AT_accessibility(DW_ACCESS_public)
   31632                      .dwendtag DW$T$69
   31633              
   31634              
   31635              DW$T$71 .dwtag  DW_TAG_union_type
   31636                      .dwattr DW$T$71, DW_AT_name("GPDDIR_REG")
   31637                      .dwattr DW$T$71, DW_AT_byte_size(0x01)
   31638              DW$2418 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31639                      .dwattr DW$2418, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31640                      .dwattr DW$2418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31641                      .dwattr DW$2418, DW_AT_accessibility(DW_ACCESS_public)
   31642              DW$2419 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
   31643                      .dwattr DW$2419, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31644                      .dwattr DW$2419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31645                      .dwattr DW$2419, DW_AT_accessibility(DW_ACCESS_public)
   31646                      .dwendtag DW$T$71
   31647              
   31648              
   31649              DW$T$73 .dwtag  DW_TAG_union_type
   31650                      .dwattr DW$T$73, DW_AT_name("GPDQUAL_REG")
   31651                      .dwattr DW$T$73, DW_AT_byte_size(0x01)
   31652              DW$2420 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31653                      .dwattr DW$2420, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31654                      .dwattr DW$2420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31655                      .dwattr DW$2420, DW_AT_accessibility(DW_ACCESS_public)
   31656              DW$2421 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
   31657                      .dwattr DW$2421, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31658                      .dwattr DW$2421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31659                      .dwattr DW$2421, DW_AT_accessibility(DW_ACCESS_public)
   31660                      .dwendtag DW$T$73
   31661              
   31662              
   31663              DW$T$75 .dwtag  DW_TAG_union_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  609

   31664                      .dwattr DW$T$75, DW_AT_name("GPEMUX_REG")
   31665                      .dwattr DW$T$75, DW_AT_byte_size(0x01)
   31666              DW$2422 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31667                      .dwattr DW$2422, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31668                      .dwattr DW$2422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31669                      .dwattr DW$2422, DW_AT_accessibility(DW_ACCESS_public)
   31670              DW$2423 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
   31671                      .dwattr DW$2423, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31672                      .dwattr DW$2423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31673                      .dwattr DW$2423, DW_AT_accessibility(DW_ACCESS_public)
   31674                      .dwendtag DW$T$75
   31675              
   31676              
   31677              DW$T$77 .dwtag  DW_TAG_union_type
   31678                      .dwattr DW$T$77, DW_AT_name("GPEDIR_REG")
   31679                      .dwattr DW$T$77, DW_AT_byte_size(0x01)
   31680              DW$2424 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31681                      .dwattr DW$2424, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31682                      .dwattr DW$2424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31683                      .dwattr DW$2424, DW_AT_accessibility(DW_ACCESS_public)
   31684              DW$2425 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
   31685                      .dwattr DW$2425, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31686                      .dwattr DW$2425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31687                      .dwattr DW$2425, DW_AT_accessibility(DW_ACCESS_public)
   31688                      .dwendtag DW$T$77
   31689              
   31690              
   31691              DW$T$79 .dwtag  DW_TAG_union_type
   31692                      .dwattr DW$T$79, DW_AT_name("GPEQUAL_REG")
   31693                      .dwattr DW$T$79, DW_AT_byte_size(0x01)
   31694              DW$2426 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31695                      .dwattr DW$2426, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31696                      .dwattr DW$2426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31697                      .dwattr DW$2426, DW_AT_accessibility(DW_ACCESS_public)
   31698              DW$2427 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
   31699                      .dwattr DW$2427, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31700                      .dwattr DW$2427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31701                      .dwattr DW$2427, DW_AT_accessibility(DW_ACCESS_public)
   31702                      .dwendtag DW$T$79
   31703              
   31704              
   31705              DW$T$81 .dwtag  DW_TAG_union_type
   31706                      .dwattr DW$T$81, DW_AT_name("GPFMUX_REG")
   31707                      .dwattr DW$T$81, DW_AT_byte_size(0x01)
   31708              DW$2428 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31709                      .dwattr DW$2428, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31710                      .dwattr DW$2428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31711                      .dwattr DW$2428, DW_AT_accessibility(DW_ACCESS_public)
   31712              DW$2429 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
   31713                      .dwattr DW$2429, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31714                      .dwattr DW$2429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31715                      .dwattr DW$2429, DW_AT_accessibility(DW_ACCESS_public)
   31716                      .dwendtag DW$T$81
   31717              
   31718              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  610

   31719              DW$T$83 .dwtag  DW_TAG_union_type
   31720                      .dwattr DW$T$83, DW_AT_name("GPFDIR_REG")
   31721                      .dwattr DW$T$83, DW_AT_byte_size(0x01)
   31722              DW$2430 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31723                      .dwattr DW$2430, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31724                      .dwattr DW$2430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31725                      .dwattr DW$2430, DW_AT_accessibility(DW_ACCESS_public)
   31726              DW$2431 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
   31727                      .dwattr DW$2431, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31728                      .dwattr DW$2431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31729                      .dwattr DW$2431, DW_AT_accessibility(DW_ACCESS_public)
   31730                      .dwendtag DW$T$83
   31731              
   31732              
   31733              DW$T$85 .dwtag  DW_TAG_union_type
   31734                      .dwattr DW$T$85, DW_AT_name("GPGMUX_REG")
   31735                      .dwattr DW$T$85, DW_AT_byte_size(0x01)
   31736              DW$2432 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31737                      .dwattr DW$2432, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31738                      .dwattr DW$2432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31739                      .dwattr DW$2432, DW_AT_accessibility(DW_ACCESS_public)
   31740              DW$2433 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
   31741                      .dwattr DW$2433, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31742                      .dwattr DW$2433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31743                      .dwattr DW$2433, DW_AT_accessibility(DW_ACCESS_public)
   31744                      .dwendtag DW$T$85
   31745              
   31746              
   31747              DW$T$87 .dwtag  DW_TAG_union_type
   31748                      .dwattr DW$T$87, DW_AT_name("GPGDIR_REG")
   31749                      .dwattr DW$T$87, DW_AT_byte_size(0x01)
   31750              DW$2434 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31751                      .dwattr DW$2434, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31752                      .dwattr DW$2434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31753                      .dwattr DW$2434, DW_AT_accessibility(DW_ACCESS_public)
   31754              DW$2435 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
   31755                      .dwattr DW$2435, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31756                      .dwattr DW$2435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31757                      .dwattr DW$2435, DW_AT_accessibility(DW_ACCESS_public)
   31758                      .dwendtag DW$T$87
   31759              
   31760              
   31761              DW$T$93 .dwtag  DW_TAG_union_type
   31762                      .dwattr DW$T$93, DW_AT_name("GPTCONB_REG")
   31763                      .dwattr DW$T$93, DW_AT_byte_size(0x01)
   31764              DW$2436 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31765                      .dwattr DW$2436, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31766                      .dwattr DW$2436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31767                      .dwattr DW$2436, DW_AT_accessibility(DW_ACCESS_public)
   31768              DW$2437 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
   31769                      .dwattr DW$2437, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31770                      .dwattr DW$2437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31771                      .dwattr DW$2437, DW_AT_accessibility(DW_ACCESS_public)
   31772                      .dwendtag DW$T$93
   31773              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  611

   31774              
   31775              DW$T$95 .dwtag  DW_TAG_union_type
   31776                      .dwattr DW$T$95, DW_AT_name("T3CON_REG")
   31777                      .dwattr DW$T$95, DW_AT_byte_size(0x01)
   31778              DW$2438 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31779                      .dwattr DW$2438, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31780                      .dwattr DW$2438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31781                      .dwattr DW$2438, DW_AT_accessibility(DW_ACCESS_public)
   31782              DW$2439 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
   31783                      .dwattr DW$2439, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31784                      .dwattr DW$2439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31785                      .dwattr DW$2439, DW_AT_accessibility(DW_ACCESS_public)
   31786                      .dwendtag DW$T$95
   31787              
   31788              
   31789              DW$T$97 .dwtag  DW_TAG_union_type
   31790                      .dwattr DW$T$97, DW_AT_name("T4CON_REG")
   31791                      .dwattr DW$T$97, DW_AT_byte_size(0x01)
   31792              DW$2440 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31793                      .dwattr DW$2440, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31794                      .dwattr DW$2440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31795                      .dwattr DW$2440, DW_AT_accessibility(DW_ACCESS_public)
   31796              DW$2441 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$96)
   31797                      .dwattr DW$2441, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31798                      .dwattr DW$2441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31799                      .dwattr DW$2441, DW_AT_accessibility(DW_ACCESS_public)
   31800                      .dwendtag DW$T$97
   31801              
   31802              
   31803              DW$T$99 .dwtag  DW_TAG_union_type
   31804                      .dwattr DW$T$99, DW_AT_name("EXTCONB_REG")
   31805                      .dwattr DW$T$99, DW_AT_byte_size(0x01)
   31806              DW$2442 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31807                      .dwattr DW$2442, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31808                      .dwattr DW$2442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31809                      .dwattr DW$2442, DW_AT_accessibility(DW_ACCESS_public)
   31810              DW$2443 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$98)
   31811                      .dwattr DW$2443, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31812                      .dwattr DW$2443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31813                      .dwattr DW$2443, DW_AT_accessibility(DW_ACCESS_public)
   31814                      .dwendtag DW$T$99
   31815              
   31816              
   31817              DW$T$101        .dwtag  DW_TAG_union_type
   31818                      .dwattr DW$T$101, DW_AT_name("COMCONB_REG")
   31819                      .dwattr DW$T$101, DW_AT_byte_size(0x01)
   31820              DW$2444 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31821                      .dwattr DW$2444, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31822                      .dwattr DW$2444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31823                      .dwattr DW$2444, DW_AT_accessibility(DW_ACCESS_public)
   31824              DW$2445 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$100)
   31825                      .dwattr DW$2445, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31826                      .dwattr DW$2445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31827                      .dwattr DW$2445, DW_AT_accessibility(DW_ACCESS_public)
   31828                      .dwendtag DW$T$101
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  612

   31829              
   31830              
   31831              DW$T$103        .dwtag  DW_TAG_union_type
   31832                      .dwattr DW$T$103, DW_AT_name("ACTRB_REG")
   31833                      .dwattr DW$T$103, DW_AT_byte_size(0x01)
   31834              DW$2446 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31835                      .dwattr DW$2446, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31836                      .dwattr DW$2446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31837                      .dwattr DW$2446, DW_AT_accessibility(DW_ACCESS_public)
   31838              DW$2447 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$102)
   31839                      .dwattr DW$2447, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31840                      .dwattr DW$2447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31841                      .dwattr DW$2447, DW_AT_accessibility(DW_ACCESS_public)
   31842                      .dwendtag DW$T$103
   31843              
   31844              
   31845              DW$T$105        .dwtag  DW_TAG_union_type
   31846                      .dwattr DW$T$105, DW_AT_name("DBTCON_REG")
   31847                      .dwattr DW$T$105, DW_AT_byte_size(0x01)
   31848              DW$2448 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31849                      .dwattr DW$2448, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31850                      .dwattr DW$2448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31851                      .dwattr DW$2448, DW_AT_accessibility(DW_ACCESS_public)
   31852              DW$2449 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$104)
   31853                      .dwattr DW$2449, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31854                      .dwattr DW$2449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31855                      .dwattr DW$2449, DW_AT_accessibility(DW_ACCESS_public)
   31856                      .dwendtag DW$T$105
   31857              
   31858              
   31859              DW$T$107        .dwtag  DW_TAG_union_type
   31860                      .dwattr DW$T$107, DW_AT_name("CAPCONB_REG")
   31861                      .dwattr DW$T$107, DW_AT_byte_size(0x01)
   31862              DW$2450 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31863                      .dwattr DW$2450, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31864                      .dwattr DW$2450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31865                      .dwattr DW$2450, DW_AT_accessibility(DW_ACCESS_public)
   31866              DW$2451 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$106)
   31867                      .dwattr DW$2451, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31868                      .dwattr DW$2451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31869                      .dwattr DW$2451, DW_AT_accessibility(DW_ACCESS_public)
   31870                      .dwendtag DW$T$107
   31871              
   31872              
   31873              DW$T$109        .dwtag  DW_TAG_union_type
   31874                      .dwattr DW$T$109, DW_AT_name("CAPFIFOB_REG")
   31875                      .dwattr DW$T$109, DW_AT_byte_size(0x01)
   31876              DW$2452 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31877                      .dwattr DW$2452, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31878                      .dwattr DW$2452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31879                      .dwattr DW$2452, DW_AT_accessibility(DW_ACCESS_public)
   31880              DW$2453 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$108)
   31881                      .dwattr DW$2453, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31882                      .dwattr DW$2453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31883                      .dwattr DW$2453, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  613

   31884                      .dwendtag DW$T$109
   31885              
   31886              
   31887              DW$T$111        .dwtag  DW_TAG_union_type
   31888                      .dwattr DW$T$111, DW_AT_name("EVBIMRA_REG")
   31889                      .dwattr DW$T$111, DW_AT_byte_size(0x01)
   31890              DW$2454 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31891                      .dwattr DW$2454, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31892                      .dwattr DW$2454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31893                      .dwattr DW$2454, DW_AT_accessibility(DW_ACCESS_public)
   31894              DW$2455 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$110)
   31895                      .dwattr DW$2455, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31896                      .dwattr DW$2455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31897                      .dwattr DW$2455, DW_AT_accessibility(DW_ACCESS_public)
   31898                      .dwendtag DW$T$111
   31899              
   31900              
   31901              DW$T$113        .dwtag  DW_TAG_union_type
   31902                      .dwattr DW$T$113, DW_AT_name("EVBIMRB_REG")
   31903                      .dwattr DW$T$113, DW_AT_byte_size(0x01)
   31904              DW$2456 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31905                      .dwattr DW$2456, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31906                      .dwattr DW$2456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31907                      .dwattr DW$2456, DW_AT_accessibility(DW_ACCESS_public)
   31908              DW$2457 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$112)
   31909                      .dwattr DW$2457, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31910                      .dwattr DW$2457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31911                      .dwattr DW$2457, DW_AT_accessibility(DW_ACCESS_public)
   31912                      .dwendtag DW$T$113
   31913              
   31914              
   31915              DW$T$115        .dwtag  DW_TAG_union_type
   31916                      .dwattr DW$T$115, DW_AT_name("EVBIMRC_REG")
   31917                      .dwattr DW$T$115, DW_AT_byte_size(0x01)
   31918              DW$2458 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31919                      .dwattr DW$2458, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31920                      .dwattr DW$2458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31921                      .dwattr DW$2458, DW_AT_accessibility(DW_ACCESS_public)
   31922              DW$2459 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$114)
   31923                      .dwattr DW$2459, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31924                      .dwattr DW$2459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31925                      .dwattr DW$2459, DW_AT_accessibility(DW_ACCESS_public)
   31926                      .dwendtag DW$T$115
   31927              
   31928              
   31929              DW$T$117        .dwtag  DW_TAG_union_type
   31930                      .dwattr DW$T$117, DW_AT_name("EVBIFRA_REG")
   31931                      .dwattr DW$T$117, DW_AT_byte_size(0x01)
   31932              DW$2460 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
   31933                      .dwattr DW$2460, DW_AT_name("all"), DW_AT_symbol_name("_all")
   31934                      .dwattr DW$2460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   31935                      .dwattr DW$2460, DW_AT_accessibility(DW_ACCESS_public)
   31936              DW$2461 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$116)
   31937                      .dwattr DW$2461, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
   31938                      .dwattr DW$2461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 23 15:51:06 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9562                            PAGE  614

   31939                      .dwattr DW$2461, DW_AT_accessibility(DW_ACCESS_public)
   31940                      .dwendtag DW$T$117
   31941              
   31942              
   31943              DW$T$119        .dwtag  DW_TAG_union_type
   31944                      .dwattr DW$T$119, DW_AT_name("EVBIFRB_REG")
   31945                      .dwattr DW$T$119, DW_AT_byte_size(0x01)
   31946              DW$2462 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
