TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Tue Sep 28 14:46:11 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("fm25c164.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    3746                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    3747              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    3748                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3749                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
    3750              DW$T$75 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$10)
    3751                      .dwattr DW$T$75, DW_AT_address_class(0x16)
    3752              DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("int16"), DW_AT_type(*DW$T$10)
    3753                      .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    3754              DW$T$100        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$80)
    3755                      .dwattr DW$T$100, DW_AT_address_class(0x16)
    3756              
    3757              DW$T$106        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$80)
    3758                      .dwattr DW$T$106, DW_AT_language(DW_LANG_C)
    3759              
    3760              DW$T$107        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$80)
    3761                      .dwattr DW$T$107, DW_AT_language(DW_LANG_C)
    3762                      .dwattr DW$T$107, DW_AT_byte_size(0x08)
    3763              DW$305  .dwtag  DW_TAG_subrange_type
    3764                      .dwattr DW$305, DW_AT_upper_bound(0x07)
    3765                      .dwendtag DW$T$107
    3766              
    3767              
    3768              DW$T$109        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    3769                      .dwattr DW$T$109, DW_AT_language(DW_LANG_C)
    3770              DW$306  .dwtag  DW_TAG_far_type
    3771                      .dwattr DW$306, DW_AT_type(*DW$T$10)
    3772              DW$T$111        .dwtag  DW_TAG_volatile_type
    3773                      .dwattr DW$T$111, DW_AT_type(*DW$306)
    3774              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    3775                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3776                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    3777              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$11)
    3778                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    3779              DW$T$89 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$11)
    3780                      .dwattr DW$T$89, DW_AT_address_class(0x16)
    3781              DW$T$12 .dwtag  DW_TAG_base_type, DW_AT_name("long")
    3782                      .dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3783                      .dwattr DW$T$12, DW_AT_byte_size(0x02)
    3784              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    3785                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3786                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    3787              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
    3788                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
    3789                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
    3790              DW$T$95 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$16)
    3791                      .dwattr DW$T$95, DW_AT_address_class(0x16)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   74

    3792              
    3793              DW$T$114        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$16)
    3794                      .dwattr DW$T$114, DW_AT_language(DW_LANG_C)
    3795              DW$307  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$86)
    3796                      .dwendtag DW$T$114
    3797              
    3798              
    3799              DW$T$116        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$16)
    3800                      .dwattr DW$T$116, DW_AT_language(DW_LANG_C)
    3801              DW$308  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$16)
    3802              DW$309  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$16)
    3803              DW$310  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$16)
    3804                      .dwendtag DW$T$116
    3805              
    3806              
    3807              DW$T$117        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$16)
    3808                      .dwattr DW$T$117, DW_AT_language(DW_LANG_C)
    3809              DW$311  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    3810              DW$312  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$95)
    3811              DW$313  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    3812                      .dwendtag DW$T$117
    3813              
    3814              DW$T$17 .dwtag  DW_TAG_base_type, DW_AT_name("double")
    3815                      .dwattr DW$T$17, DW_AT_encoding(DW_ATE_float)
    3816                      .dwattr DW$T$17, DW_AT_byte_size(0x02)
    3817              
    3818              DW$T$118        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$17)
    3819                      .dwattr DW$T$118, DW_AT_language(DW_LANG_C)
    3820              DW$314  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$17)
    3821                      .dwendtag DW$T$118
    3822              
    3823              DW$315  .dwtag  DW_TAG_far_type
    3824                      .dwattr DW$315, DW_AT_type(*DW$T$69)
    3825              DW$T$123        .dwtag  DW_TAG_volatile_type
    3826                      .dwattr DW$T$123, DW_AT_type(*DW$315)
    3827              
    3828              DW$T$71 .dwtag  DW_TAG_union_type
    3829                      .dwattr DW$T$71, DW_AT_name("union_temp")
    3830                      .dwattr DW$T$71, DW_AT_byte_size(0x02)
    3831              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3832                      .dwattr DW$316, DW_AT_name("F"), DW_AT_symbol_name("_F")
    3833                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3834                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3835              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    3836                      .dwattr DW$317, DW_AT_name("I"), DW_AT_symbol_name("_I")
    3837                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3838                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3839                      .dwendtag DW$T$71
    3840              
    3841              
    3842              DW$T$72 .dwtag  DW_TAG_union_type
    3843                      .dwattr DW$T$72, DW_AT_name("union_temp")
    3844                      .dwattr DW$T$72, DW_AT_byte_size(0x02)
    3845              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3846                      .dwattr DW$318, DW_AT_name("F"), DW_AT_symbol_name("_F")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   75

    3847                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3848                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3849              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    3850                      .dwattr DW$319, DW_AT_name("I"), DW_AT_symbol_name("_I")
    3851                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3852                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3853                      .dwendtag DW$T$72
    3854              
    3855              
    3856              DW$T$73 .dwtag  DW_TAG_union_type
    3857                      .dwattr DW$T$73, DW_AT_name("union_temp")
    3858                      .dwattr DW$T$73, DW_AT_byte_size(0x02)
    3859              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3860                      .dwattr DW$320, DW_AT_name("F"), DW_AT_symbol_name("_F")
    3861                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3862                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3863              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    3864                      .dwattr DW$321, DW_AT_name("I"), DW_AT_symbol_name("_I")
    3865                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3866                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3867                      .dwendtag DW$T$73
    3868              
    3869              
    3870              DW$T$74 .dwtag  DW_TAG_union_type
    3871                      .dwattr DW$T$74, DW_AT_name("union_temp")
    3872                      .dwattr DW$T$74, DW_AT_byte_size(0x02)
    3873              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3874                      .dwattr DW$322, DW_AT_name("F"), DW_AT_symbol_name("_F")
    3875                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3876                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3877              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    3878                      .dwattr DW$323, DW_AT_name("I"), DW_AT_symbol_name("_I")
    3879                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3880                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3881                      .dwendtag DW$T$74
    3882              
    3883              DW$T$85 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    3884                      .dwattr DW$T$85, DW_AT_encoding(DW_ATE_signed_char)
    3885                      .dwattr DW$T$85, DW_AT_byte_size(0x01)
    3886              DW$T$86 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$85)
    3887                      .dwattr DW$T$86, DW_AT_address_class(0x16)
    3888              
    3889              DW$T$70 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    3890                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    3891                      .dwattr DW$T$70, DW_AT_byte_size(0x02)
    3892              DW$324  .dwtag  DW_TAG_subrange_type
    3893                      .dwattr DW$324, DW_AT_upper_bound(0x01)
    3894                      .dwendtag DW$T$70
    3895              
    3896              
    3897              DW$T$69 .dwtag  DW_TAG_structure_type
    3898                      .dwattr DW$T$69, DW_AT_name("GPIO_DATA_REGS")
    3899                      .dwattr DW$T$69, DW_AT_byte_size(0x20)
    3900              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    3901                      .dwattr DW$325, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   76

    3902                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3903                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3904              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3905                      .dwattr DW$326, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
    3906                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3907                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3908              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    3909                      .dwattr DW$327, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
    3910                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3911                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3912              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    3913                      .dwattr DW$328, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
    3914                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3915                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3916              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    3917                      .dwattr DW$329, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
    3918                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3919                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3920              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3921                      .dwattr DW$330, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
    3922                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3923                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3924              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    3925                      .dwattr DW$331, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
    3926                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3927                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3928              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    3929                      .dwattr DW$332, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
    3930                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3931                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3932              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    3933                      .dwattr DW$333, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3934                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3935                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3936              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3937                      .dwattr DW$334, DW_AT_name("GPDDAT"), DW_AT_symbol_name("_GPDDAT")
    3938                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3939                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3940              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3941                      .dwattr DW$335, DW_AT_name("GPDSET"), DW_AT_symbol_name("_GPDSET")
    3942                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3943                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3944              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    3945                      .dwattr DW$336, DW_AT_name("GPDCLEAR"), DW_AT_symbol_name("_GPDCLEAR")
    3946                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3947                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3948              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    3949                      .dwattr DW$337, DW_AT_name("GPDTOGGLE"), DW_AT_symbol_name("_GPDTOGGLE")
    3950                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3951                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3952              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    3953                      .dwattr DW$338, DW_AT_name("GPEDAT"), DW_AT_symbol_name("_GPEDAT")
    3954                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3955                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3956              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   77

    3957                      .dwattr DW$339, DW_AT_name("GPESET"), DW_AT_symbol_name("_GPESET")
    3958                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3959                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3960              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    3961                      .dwattr DW$340, DW_AT_name("GPECLEAR"), DW_AT_symbol_name("_GPECLEAR")
    3962                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3963                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3964              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    3965                      .dwattr DW$341, DW_AT_name("GPETOGGLE"), DW_AT_symbol_name("_GPETOGGLE")
    3966                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3967                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3968              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
    3969                      .dwattr DW$342, DW_AT_name("GPFDAT"), DW_AT_symbol_name("_GPFDAT")
    3970                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3971                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3972              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
    3973                      .dwattr DW$343, DW_AT_name("GPFSET"), DW_AT_symbol_name("_GPFSET")
    3974                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3975                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3976              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    3977                      .dwattr DW$344, DW_AT_name("GPFCLEAR"), DW_AT_symbol_name("_GPFCLEAR")
    3978                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3979                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3980              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    3981                      .dwattr DW$345, DW_AT_name("GPFTOGGLE"), DW_AT_symbol_name("_GPFTOGGLE")
    3982                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3983                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3984              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    3985                      .dwattr DW$346, DW_AT_name("GPGDAT"), DW_AT_symbol_name("_GPGDAT")
    3986                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3987                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3988              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    3989                      .dwattr DW$347, DW_AT_name("GPGSET"), DW_AT_symbol_name("_GPGSET")
    3990                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3991                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3992              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    3993                      .dwattr DW$348, DW_AT_name("GPGCLEAR"), DW_AT_symbol_name("_GPGCLEAR")
    3994                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3995                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3996              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    3997                      .dwattr DW$349, DW_AT_name("GPGTOGGLE"), DW_AT_symbol_name("_GPGTOGGLE")
    3998                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3999                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4000              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    4001                      .dwattr DW$350, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    4002                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4003                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4004                      .dwendtag DW$T$69
    4005              
    4006              
    4007              DW$T$68 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    4008                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    4009                      .dwattr DW$T$68, DW_AT_byte_size(0x04)
    4010              DW$351  .dwtag  DW_TAG_subrange_type
    4011                      .dwattr DW$351, DW_AT_upper_bound(0x03)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   78

    4012                      .dwendtag DW$T$68
    4013              
    4014              
    4015              DW$T$21 .dwtag  DW_TAG_union_type
    4016                      .dwattr DW$T$21, DW_AT_name("GPADAT_REG")
    4017                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
    4018              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4019                      .dwattr DW$352, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4020                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4021                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4022              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    4023                      .dwattr DW$353, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4024                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4025                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4026                      .dwendtag DW$T$21
    4027              
    4028              
    4029              DW$T$23 .dwtag  DW_TAG_union_type
    4030                      .dwattr DW$T$23, DW_AT_name("GPASET_REG")
    4031                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    4032              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4033                      .dwattr DW$354, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4034                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4035                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4036              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    4037                      .dwattr DW$355, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4038                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4039                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4040                      .dwendtag DW$T$23
    4041              
    4042              
    4043              DW$T$25 .dwtag  DW_TAG_union_type
    4044                      .dwattr DW$T$25, DW_AT_name("GPACLEAR_REG")
    4045                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    4046              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4047                      .dwattr DW$356, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4048                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4049                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4050              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    4051                      .dwattr DW$357, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4052                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4053                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4054                      .dwendtag DW$T$25
    4055              
    4056              
    4057              DW$T$27 .dwtag  DW_TAG_union_type
    4058                      .dwattr DW$T$27, DW_AT_name("GPATOGGLE_REG")
    4059                      .dwattr DW$T$27, DW_AT_byte_size(0x01)
    4060              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4061                      .dwattr DW$358, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4062                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4063                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4064              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    4065                      .dwattr DW$359, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4066                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   79

    4067                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4068                      .dwendtag DW$T$27
    4069              
    4070              
    4071              DW$T$29 .dwtag  DW_TAG_union_type
    4072                      .dwattr DW$T$29, DW_AT_name("GPBDAT_REG")
    4073                      .dwattr DW$T$29, DW_AT_byte_size(0x01)
    4074              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4075                      .dwattr DW$360, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4076                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4077                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4078              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    4079                      .dwattr DW$361, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4080                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4081                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4082                      .dwendtag DW$T$29
    4083              
    4084              
    4085              DW$T$31 .dwtag  DW_TAG_union_type
    4086                      .dwattr DW$T$31, DW_AT_name("GPBSET_REG")
    4087                      .dwattr DW$T$31, DW_AT_byte_size(0x01)
    4088              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4089                      .dwattr DW$362, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4090                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4091                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4092              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    4093                      .dwattr DW$363, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4094                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4095                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4096                      .dwendtag DW$T$31
    4097              
    4098              
    4099              DW$T$33 .dwtag  DW_TAG_union_type
    4100                      .dwattr DW$T$33, DW_AT_name("GPBCLEAR_REG")
    4101                      .dwattr DW$T$33, DW_AT_byte_size(0x01)
    4102              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4103                      .dwattr DW$364, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4104                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4105                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4106              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    4107                      .dwattr DW$365, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4108                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4109                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4110                      .dwendtag DW$T$33
    4111              
    4112              
    4113              DW$T$35 .dwtag  DW_TAG_union_type
    4114                      .dwattr DW$T$35, DW_AT_name("GPBTOGGLE_REG")
    4115                      .dwattr DW$T$35, DW_AT_byte_size(0x01)
    4116              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4117                      .dwattr DW$366, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4118                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4119                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4120              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    4121                      .dwattr DW$367, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   80

    4122                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4123                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4124                      .dwendtag DW$T$35
    4125              
    4126              
    4127              DW$T$37 .dwtag  DW_TAG_union_type
    4128                      .dwattr DW$T$37, DW_AT_name("GPDDAT_REG")
    4129                      .dwattr DW$T$37, DW_AT_byte_size(0x01)
    4130              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4131                      .dwattr DW$368, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4132                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4133                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4134              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    4135                      .dwattr DW$369, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4136                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4137                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4138                      .dwendtag DW$T$37
    4139              
    4140              
    4141              DW$T$39 .dwtag  DW_TAG_union_type
    4142                      .dwattr DW$T$39, DW_AT_name("GPDSET_REG")
    4143                      .dwattr DW$T$39, DW_AT_byte_size(0x01)
    4144              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4145                      .dwattr DW$370, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4146                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4147                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4148              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    4149                      .dwattr DW$371, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4150                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4151                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4152                      .dwendtag DW$T$39
    4153              
    4154              
    4155              DW$T$41 .dwtag  DW_TAG_union_type
    4156                      .dwattr DW$T$41, DW_AT_name("GPDCLEAR_REG")
    4157                      .dwattr DW$T$41, DW_AT_byte_size(0x01)
    4158              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4159                      .dwattr DW$372, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4160                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4161                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4162              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    4163                      .dwattr DW$373, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4164                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4165                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4166                      .dwendtag DW$T$41
    4167              
    4168              
    4169              DW$T$43 .dwtag  DW_TAG_union_type
    4170                      .dwattr DW$T$43, DW_AT_name("GPDTOGGLE_REG")
    4171                      .dwattr DW$T$43, DW_AT_byte_size(0x01)
    4172              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4173                      .dwattr DW$374, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4174                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4175                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4176              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   81

    4177                      .dwattr DW$375, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4178                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4179                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4180                      .dwendtag DW$T$43
    4181              
    4182              
    4183              DW$T$45 .dwtag  DW_TAG_union_type
    4184                      .dwattr DW$T$45, DW_AT_name("GPEDAT_REG")
    4185                      .dwattr DW$T$45, DW_AT_byte_size(0x01)
    4186              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4187                      .dwattr DW$376, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4188                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4189                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4190              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    4191                      .dwattr DW$377, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4192                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4193                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4194                      .dwendtag DW$T$45
    4195              
    4196              
    4197              DW$T$47 .dwtag  DW_TAG_union_type
    4198                      .dwattr DW$T$47, DW_AT_name("GPESET_REG")
    4199                      .dwattr DW$T$47, DW_AT_byte_size(0x01)
    4200              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4201                      .dwattr DW$378, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4202                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4203                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4204              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    4205                      .dwattr DW$379, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4206                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4207                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4208                      .dwendtag DW$T$47
    4209              
    4210              
    4211              DW$T$49 .dwtag  DW_TAG_union_type
    4212                      .dwattr DW$T$49, DW_AT_name("GPECLEAR_REG")
    4213                      .dwattr DW$T$49, DW_AT_byte_size(0x01)
    4214              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4215                      .dwattr DW$380, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4216                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4217                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4218              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    4219                      .dwattr DW$381, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4220                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4221                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4222                      .dwendtag DW$T$49
    4223              
    4224              
    4225              DW$T$51 .dwtag  DW_TAG_union_type
    4226                      .dwattr DW$T$51, DW_AT_name("GPETOGGLE_REG")
    4227                      .dwattr DW$T$51, DW_AT_byte_size(0x01)
    4228              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4229                      .dwattr DW$382, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4230                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4231                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   82

    4232              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    4233                      .dwattr DW$383, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4234                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4235                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4236                      .dwendtag DW$T$51
    4237              
    4238              
    4239              DW$T$53 .dwtag  DW_TAG_union_type
    4240                      .dwattr DW$T$53, DW_AT_name("GPFDAT_REG")
    4241                      .dwattr DW$T$53, DW_AT_byte_size(0x01)
    4242              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4243                      .dwattr DW$384, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4244                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4245                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4246              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    4247                      .dwattr DW$385, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4248                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4249                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4250                      .dwendtag DW$T$53
    4251              
    4252              
    4253              DW$T$55 .dwtag  DW_TAG_union_type
    4254                      .dwattr DW$T$55, DW_AT_name("GPFSET_REG")
    4255                      .dwattr DW$T$55, DW_AT_byte_size(0x01)
    4256              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4257                      .dwattr DW$386, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4258                      .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4259                      .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4260              DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    4261                      .dwattr DW$387, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4262                      .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4263                      .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4264                      .dwendtag DW$T$55
    4265              
    4266              
    4267              DW$T$57 .dwtag  DW_TAG_union_type
    4268                      .dwattr DW$T$57, DW_AT_name("GPFCLEAR_REG")
    4269                      .dwattr DW$T$57, DW_AT_byte_size(0x01)
    4270              DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4271                      .dwattr DW$388, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4272                      .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4273                      .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4274              DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    4275                      .dwattr DW$389, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4276                      .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4277                      .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4278                      .dwendtag DW$T$57
    4279              
    4280              
    4281              DW$T$59 .dwtag  DW_TAG_union_type
    4282                      .dwattr DW$T$59, DW_AT_name("GPFTOGGLE_REG")
    4283                      .dwattr DW$T$59, DW_AT_byte_size(0x01)
    4284              DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4285                      .dwattr DW$390, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4286                      .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   83

    4287                      .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4288              DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    4289                      .dwattr DW$391, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4290                      .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4291                      .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4292                      .dwendtag DW$T$59
    4293              
    4294              
    4295              DW$T$61 .dwtag  DW_TAG_union_type
    4296                      .dwattr DW$T$61, DW_AT_name("GPGDAT_REG")
    4297                      .dwattr DW$T$61, DW_AT_byte_size(0x01)
    4298              DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4299                      .dwattr DW$392, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4300                      .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4301                      .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4302              DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    4303                      .dwattr DW$393, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4304                      .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4305                      .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4306                      .dwendtag DW$T$61
    4307              
    4308              
    4309              DW$T$63 .dwtag  DW_TAG_union_type
    4310                      .dwattr DW$T$63, DW_AT_name("GPGSET_REG")
    4311                      .dwattr DW$T$63, DW_AT_byte_size(0x01)
    4312              DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4313                      .dwattr DW$394, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4314                      .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4315                      .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4316              DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    4317                      .dwattr DW$395, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4318                      .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4319                      .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4320                      .dwendtag DW$T$63
    4321              
    4322              
    4323              DW$T$65 .dwtag  DW_TAG_union_type
    4324                      .dwattr DW$T$65, DW_AT_name("GPGCLEAR_REG")
    4325                      .dwattr DW$T$65, DW_AT_byte_size(0x01)
    4326              DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4327                      .dwattr DW$396, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4328                      .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4329                      .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4330              DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    4331                      .dwattr DW$397, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4332                      .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4333                      .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4334                      .dwendtag DW$T$65
    4335              
    4336              
    4337              DW$T$67 .dwtag  DW_TAG_union_type
    4338                      .dwattr DW$T$67, DW_AT_name("GPGTOGGLE_REG")
    4339                      .dwattr DW$T$67, DW_AT_byte_size(0x01)
    4340              DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4341                      .dwattr DW$398, DW_AT_name("all"), DW_AT_symbol_name("_all")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   84

    4342                      .dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4343                      .dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4344              DW$399  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    4345                      .dwattr DW$399, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4346                      .dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4347                      .dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4348                      .dwendtag DW$T$67
    4349              
    4350              
    4351              DW$T$20 .dwtag  DW_TAG_structure_type
    4352                      .dwattr DW$T$20, DW_AT_name("GPADAT_BITS")
    4353                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    4354              DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4355                      .dwattr DW$400, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    4356                      .dwattr DW$400, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4357                      .dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4358                      .dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4359              DW$401  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4360                      .dwattr DW$401, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    4361                      .dwattr DW$401, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4362                      .dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4363                      .dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4364              DW$402  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4365                      .dwattr DW$402, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    4366                      .dwattr DW$402, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4367                      .dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4368                      .dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4369              DW$403  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4370                      .dwattr DW$403, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    4371                      .dwattr DW$403, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4372                      .dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4373                      .dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4374              DW$404  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4375                      .dwattr DW$404, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    4376                      .dwattr DW$404, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4377                      .dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4378                      .dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4379              DW$405  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4380                      .dwattr DW$405, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    4381                      .dwattr DW$405, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4382                      .dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4383                      .dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4384              DW$406  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4385                      .dwattr DW$406, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    4386                      .dwattr DW$406, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4387                      .dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4388                      .dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4389              DW$407  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4390                      .dwattr DW$407, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    4391                      .dwattr DW$407, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4392                      .dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4393                      .dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4394              DW$408  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4395                      .dwattr DW$408, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    4396                      .dwattr DW$408, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   85

    4397                      .dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4398                      .dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4399              DW$409  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4400                      .dwattr DW$409, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    4401                      .dwattr DW$409, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4402                      .dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4403                      .dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4404              DW$410  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4405                      .dwattr DW$410, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    4406                      .dwattr DW$410, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4407                      .dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4408                      .dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4409              DW$411  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4410                      .dwattr DW$411, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    4411                      .dwattr DW$411, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4412                      .dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4413                      .dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4414              DW$412  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4415                      .dwattr DW$412, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    4416                      .dwattr DW$412, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4417                      .dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4418                      .dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4419              DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4420                      .dwattr DW$413, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    4421                      .dwattr DW$413, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4422                      .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4423                      .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4424              DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4425                      .dwattr DW$414, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    4426                      .dwattr DW$414, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4427                      .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4428                      .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4429              DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4430                      .dwattr DW$415, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    4431                      .dwattr DW$415, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4432                      .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4433                      .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4434                      .dwendtag DW$T$20
    4435              
    4436              
    4437              DW$T$22 .dwtag  DW_TAG_structure_type
    4438                      .dwattr DW$T$22, DW_AT_name("GPASET_BITS")
    4439                      .dwattr DW$T$22, DW_AT_byte_size(0x01)
    4440              DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4441                      .dwattr DW$416, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    4442                      .dwattr DW$416, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4443                      .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4444                      .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4445              DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4446                      .dwattr DW$417, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    4447                      .dwattr DW$417, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4448                      .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4449                      .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4450              DW$418  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4451                      .dwattr DW$418, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   86

    4452                      .dwattr DW$418, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4453                      .dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4454                      .dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4455              DW$419  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4456                      .dwattr DW$419, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    4457                      .dwattr DW$419, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4458                      .dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4459                      .dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4460              DW$420  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4461                      .dwattr DW$420, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    4462                      .dwattr DW$420, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4463                      .dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4464                      .dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4465              DW$421  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4466                      .dwattr DW$421, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    4467                      .dwattr DW$421, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4468                      .dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4469                      .dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4470              DW$422  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4471                      .dwattr DW$422, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    4472                      .dwattr DW$422, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4473                      .dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4474                      .dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4475              DW$423  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4476                      .dwattr DW$423, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    4477                      .dwattr DW$423, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4478                      .dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4479                      .dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4480              DW$424  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4481                      .dwattr DW$424, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    4482                      .dwattr DW$424, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4483                      .dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4484                      .dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4485              DW$425  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4486                      .dwattr DW$425, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    4487                      .dwattr DW$425, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4488                      .dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4489                      .dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4490              DW$426  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4491                      .dwattr DW$426, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    4492                      .dwattr DW$426, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4493                      .dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4494                      .dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4495              DW$427  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4496                      .dwattr DW$427, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    4497                      .dwattr DW$427, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4498                      .dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4499                      .dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4500              DW$428  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4501                      .dwattr DW$428, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    4502                      .dwattr DW$428, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4503                      .dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4504                      .dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4505              DW$429  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4506                      .dwattr DW$429, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   87

    4507                      .dwattr DW$429, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4508                      .dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4509                      .dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4510              DW$430  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4511                      .dwattr DW$430, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    4512                      .dwattr DW$430, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4513                      .dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4514                      .dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4515              DW$431  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4516                      .dwattr DW$431, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    4517                      .dwattr DW$431, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4518                      .dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4519                      .dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4520                      .dwendtag DW$T$22
    4521              
    4522              
    4523              DW$T$24 .dwtag  DW_TAG_structure_type
    4524                      .dwattr DW$T$24, DW_AT_name("GPACLEAR_BITS")
    4525                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
    4526              DW$432  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4527                      .dwattr DW$432, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    4528                      .dwattr DW$432, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4529                      .dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4530                      .dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4531              DW$433  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4532                      .dwattr DW$433, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    4533                      .dwattr DW$433, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4534                      .dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4535                      .dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4536              DW$434  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4537                      .dwattr DW$434, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    4538                      .dwattr DW$434, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4539                      .dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4540                      .dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4541              DW$435  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4542                      .dwattr DW$435, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    4543                      .dwattr DW$435, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4544                      .dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4545                      .dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4546              DW$436  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4547                      .dwattr DW$436, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    4548                      .dwattr DW$436, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4549                      .dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4550                      .dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4551              DW$437  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4552                      .dwattr DW$437, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    4553                      .dwattr DW$437, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4554                      .dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4555                      .dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4556              DW$438  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4557                      .dwattr DW$438, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    4558                      .dwattr DW$438, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4559                      .dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4560                      .dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4561              DW$439  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   88

    4562                      .dwattr DW$439, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    4563                      .dwattr DW$439, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4564                      .dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4565                      .dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4566              DW$440  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4567                      .dwattr DW$440, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    4568                      .dwattr DW$440, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4569                      .dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4570                      .dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4571              DW$441  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4572                      .dwattr DW$441, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    4573                      .dwattr DW$441, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4574                      .dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4575                      .dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4576              DW$442  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4577                      .dwattr DW$442, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    4578                      .dwattr DW$442, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4579                      .dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4580                      .dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4581              DW$443  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4582                      .dwattr DW$443, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    4583                      .dwattr DW$443, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4584                      .dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4585                      .dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4586              DW$444  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4587                      .dwattr DW$444, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    4588                      .dwattr DW$444, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4589                      .dwattr DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4590                      .dwattr DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4591              DW$445  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4592                      .dwattr DW$445, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    4593                      .dwattr DW$445, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4594                      .dwattr DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4595                      .dwattr DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4596              DW$446  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4597                      .dwattr DW$446, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    4598                      .dwattr DW$446, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4599                      .dwattr DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4600                      .dwattr DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4601              DW$447  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4602                      .dwattr DW$447, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    4603                      .dwattr DW$447, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4604                      .dwattr DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4605                      .dwattr DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4606                      .dwendtag DW$T$24
    4607              
    4608              
    4609              DW$T$26 .dwtag  DW_TAG_structure_type
    4610                      .dwattr DW$T$26, DW_AT_name("GPATOGGLE_BITS")
    4611                      .dwattr DW$T$26, DW_AT_byte_size(0x01)
    4612              DW$448  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4613                      .dwattr DW$448, DW_AT_name("GPIOA0"), DW_AT_symbol_name("_GPIOA0")
    4614                      .dwattr DW$448, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4615                      .dwattr DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4616                      .dwattr DW$448, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   89

    4617              DW$449  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4618                      .dwattr DW$449, DW_AT_name("GPIOA1"), DW_AT_symbol_name("_GPIOA1")
    4619                      .dwattr DW$449, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4620                      .dwattr DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4621                      .dwattr DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4622              DW$450  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4623                      .dwattr DW$450, DW_AT_name("GPIOA2"), DW_AT_symbol_name("_GPIOA2")
    4624                      .dwattr DW$450, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4625                      .dwattr DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4626                      .dwattr DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4627              DW$451  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4628                      .dwattr DW$451, DW_AT_name("GPIOA3"), DW_AT_symbol_name("_GPIOA3")
    4629                      .dwattr DW$451, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4630                      .dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4631                      .dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4632              DW$452  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4633                      .dwattr DW$452, DW_AT_name("GPIOA4"), DW_AT_symbol_name("_GPIOA4")
    4634                      .dwattr DW$452, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4635                      .dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4636                      .dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4637              DW$453  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4638                      .dwattr DW$453, DW_AT_name("GPIOA5"), DW_AT_symbol_name("_GPIOA5")
    4639                      .dwattr DW$453, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4640                      .dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4641                      .dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4642              DW$454  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4643                      .dwattr DW$454, DW_AT_name("GPIOA6"), DW_AT_symbol_name("_GPIOA6")
    4644                      .dwattr DW$454, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4645                      .dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4646                      .dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4647              DW$455  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4648                      .dwattr DW$455, DW_AT_name("GPIOA7"), DW_AT_symbol_name("_GPIOA7")
    4649                      .dwattr DW$455, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4650                      .dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4651                      .dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4652              DW$456  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4653                      .dwattr DW$456, DW_AT_name("GPIOA8"), DW_AT_symbol_name("_GPIOA8")
    4654                      .dwattr DW$456, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4655                      .dwattr DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4656                      .dwattr DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4657              DW$457  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4658                      .dwattr DW$457, DW_AT_name("GPIOA9"), DW_AT_symbol_name("_GPIOA9")
    4659                      .dwattr DW$457, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4660                      .dwattr DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4661                      .dwattr DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4662              DW$458  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4663                      .dwattr DW$458, DW_AT_name("GPIOA10"), DW_AT_symbol_name("_GPIOA10")
    4664                      .dwattr DW$458, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4665                      .dwattr DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4666                      .dwattr DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4667              DW$459  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4668                      .dwattr DW$459, DW_AT_name("GPIOA11"), DW_AT_symbol_name("_GPIOA11")
    4669                      .dwattr DW$459, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4670                      .dwattr DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4671                      .dwattr DW$459, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   90

    4672              DW$460  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4673                      .dwattr DW$460, DW_AT_name("GPIOA12"), DW_AT_symbol_name("_GPIOA12")
    4674                      .dwattr DW$460, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4675                      .dwattr DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4676                      .dwattr DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4677              DW$461  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4678                      .dwattr DW$461, DW_AT_name("GPIOA13"), DW_AT_symbol_name("_GPIOA13")
    4679                      .dwattr DW$461, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4680                      .dwattr DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4681                      .dwattr DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4682              DW$462  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4683                      .dwattr DW$462, DW_AT_name("GPIOA14"), DW_AT_symbol_name("_GPIOA14")
    4684                      .dwattr DW$462, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4685                      .dwattr DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4686                      .dwattr DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4687              DW$463  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4688                      .dwattr DW$463, DW_AT_name("GPIOA15"), DW_AT_symbol_name("_GPIOA15")
    4689                      .dwattr DW$463, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4690                      .dwattr DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4691                      .dwattr DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4692                      .dwendtag DW$T$26
    4693              
    4694              
    4695              DW$T$28 .dwtag  DW_TAG_structure_type
    4696                      .dwattr DW$T$28, DW_AT_name("GPBDAT_BITS")
    4697                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
    4698              DW$464  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4699                      .dwattr DW$464, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    4700                      .dwattr DW$464, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4701                      .dwattr DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4702                      .dwattr DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4703              DW$465  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4704                      .dwattr DW$465, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    4705                      .dwattr DW$465, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4706                      .dwattr DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4707                      .dwattr DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4708              DW$466  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4709                      .dwattr DW$466, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    4710                      .dwattr DW$466, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4711                      .dwattr DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4712                      .dwattr DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4713              DW$467  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4714                      .dwattr DW$467, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    4715                      .dwattr DW$467, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4716                      .dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4717                      .dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4718              DW$468  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4719                      .dwattr DW$468, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    4720                      .dwattr DW$468, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4721                      .dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4722                      .dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4723              DW$469  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4724                      .dwattr DW$469, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    4725                      .dwattr DW$469, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4726                      .dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   91

    4727                      .dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4728              DW$470  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4729                      .dwattr DW$470, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    4730                      .dwattr DW$470, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4731                      .dwattr DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4732                      .dwattr DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4733              DW$471  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4734                      .dwattr DW$471, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
    4735                      .dwattr DW$471, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4736                      .dwattr DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4737                      .dwattr DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4738              DW$472  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4739                      .dwattr DW$472, DW_AT_name("GPIOB8"), DW_AT_symbol_name("_GPIOB8")
    4740                      .dwattr DW$472, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4741                      .dwattr DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4742                      .dwattr DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4743              DW$473  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4744                      .dwattr DW$473, DW_AT_name("GPIOB9"), DW_AT_symbol_name("_GPIOB9")
    4745                      .dwattr DW$473, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4746                      .dwattr DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4747                      .dwattr DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4748              DW$474  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4749                      .dwattr DW$474, DW_AT_name("GPIOB10"), DW_AT_symbol_name("_GPIOB10")
    4750                      .dwattr DW$474, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4751                      .dwattr DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4752                      .dwattr DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4753              DW$475  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4754                      .dwattr DW$475, DW_AT_name("GPIOB11"), DW_AT_symbol_name("_GPIOB11")
    4755                      .dwattr DW$475, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4756                      .dwattr DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4757                      .dwattr DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4758              DW$476  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4759                      .dwattr DW$476, DW_AT_name("GPIOB12"), DW_AT_symbol_name("_GPIOB12")
    4760                      .dwattr DW$476, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4761                      .dwattr DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4762                      .dwattr DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4763              DW$477  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4764                      .dwattr DW$477, DW_AT_name("GPIOB13"), DW_AT_symbol_name("_GPIOB13")
    4765                      .dwattr DW$477, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4766                      .dwattr DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4767                      .dwattr DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4768              DW$478  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4769                      .dwattr DW$478, DW_AT_name("GPIOB14"), DW_AT_symbol_name("_GPIOB14")
    4770                      .dwattr DW$478, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4771                      .dwattr DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4772                      .dwattr DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4773              DW$479  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4774                      .dwattr DW$479, DW_AT_name("GPIOB15"), DW_AT_symbol_name("_GPIOB15")
    4775                      .dwattr DW$479, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4776                      .dwattr DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4777                      .dwattr DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4778                      .dwendtag DW$T$28
    4779              
    4780              
    4781              DW$T$30 .dwtag  DW_TAG_structure_type
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   92

    4782                      .dwattr DW$T$30, DW_AT_name("GPBSET_BITS")
    4783                      .dwattr DW$T$30, DW_AT_byte_size(0x01)
    4784              DW$480  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4785                      .dwattr DW$480, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    4786                      .dwattr DW$480, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4787                      .dwattr DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4788                      .dwattr DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4789              DW$481  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4790                      .dwattr DW$481, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    4791                      .dwattr DW$481, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4792                      .dwattr DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4793                      .dwattr DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4794              DW$482  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4795                      .dwattr DW$482, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    4796                      .dwattr DW$482, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4797                      .dwattr DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4798                      .dwattr DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4799              DW$483  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4800                      .dwattr DW$483, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    4801                      .dwattr DW$483, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4802                      .dwattr DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4803                      .dwattr DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4804              DW$484  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4805                      .dwattr DW$484, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
    4806                      .dwattr DW$484, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4807                      .dwattr DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4808                      .dwattr DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4809              DW$485  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4810                      .dwattr DW$485, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    4811                      .dwattr DW$485, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4812                      .dwattr DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4813                      .dwattr DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4814              DW$486  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4815                      .dwattr DW$486, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    4816                      .dwattr DW$486, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4817                      .dwattr DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4818                      .dwattr DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4819              DW$487  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4820                      .dwattr DW$487, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
    4821                      .dwattr DW$487, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4822                      .dwattr DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4823                      .dwattr DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4824              DW$488  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4825                      .dwattr DW$488, DW_AT_name("GPIOB8"), DW_AT_symbol_name("_GPIOB8")
    4826                      .dwattr DW$488, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4827                      .dwattr DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4828                      .dwattr DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4829              DW$489  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4830                      .dwattr DW$489, DW_AT_name("GPIOB9"), DW_AT_symbol_name("_GPIOB9")
    4831                      .dwattr DW$489, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4832                      .dwattr DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4833                      .dwattr DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4834              DW$490  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4835                      .dwattr DW$490, DW_AT_name("GPIOB10"), DW_AT_symbol_name("_GPIOB10")
    4836                      .dwattr DW$490, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   93

    4837                      .dwattr DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4838                      .dwattr DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4839              DW$491  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4840                      .dwattr DW$491, DW_AT_name("GPIOB11"), DW_AT_symbol_name("_GPIOB11")
    4841                      .dwattr DW$491, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4842                      .dwattr DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4843                      .dwattr DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4844              DW$492  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4845                      .dwattr DW$492, DW_AT_name("GPIOB12"), DW_AT_symbol_name("_GPIOB12")
    4846                      .dwattr DW$492, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4847                      .dwattr DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4848                      .dwattr DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4849              DW$493  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4850                      .dwattr DW$493, DW_AT_name("GPIOB13"), DW_AT_symbol_name("_GPIOB13")
    4851                      .dwattr DW$493, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4852                      .dwattr DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4853                      .dwattr DW$493, DW_AT_accessibility(DW_ACCESS_public)
    4854              DW$494  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4855                      .dwattr DW$494, DW_AT_name("GPIOB14"), DW_AT_symbol_name("_GPIOB14")
    4856                      .dwattr DW$494, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4857                      .dwattr DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4858                      .dwattr DW$494, DW_AT_accessibility(DW_ACCESS_public)
    4859              DW$495  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4860                      .dwattr DW$495, DW_AT_name("GPIOB15"), DW_AT_symbol_name("_GPIOB15")
    4861                      .dwattr DW$495, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4862                      .dwattr DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4863                      .dwattr DW$495, DW_AT_accessibility(DW_ACCESS_public)
    4864                      .dwendtag DW$T$30
    4865              
    4866              
    4867              DW$T$32 .dwtag  DW_TAG_structure_type
    4868                      .dwattr DW$T$32, DW_AT_name("GPBCLEAR_BITS")
    4869                      .dwattr DW$T$32, DW_AT_byte_size(0x01)
    4870              DW$496  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4871                      .dwattr DW$496, DW_AT_name("GPIOB0"), DW_AT_symbol_name("_GPIOB0")
    4872                      .dwattr DW$496, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4873                      .dwattr DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4874                      .dwattr DW$496, DW_AT_accessibility(DW_ACCESS_public)
    4875              DW$497  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4876                      .dwattr DW$497, DW_AT_name("GPIOB1"), DW_AT_symbol_name("_GPIOB1")
    4877                      .dwattr DW$497, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4878                      .dwattr DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4879                      .dwattr DW$497, DW_AT_accessibility(DW_ACCESS_public)
    4880              DW$498  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4881                      .dwattr DW$498, DW_AT_name("GPIOB2"), DW_AT_symbol_name("_GPIOB2")
    4882                      .dwattr DW$498, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4883                      .dwattr DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4884                      .dwattr DW$498, DW_AT_accessibility(DW_ACCESS_public)
    4885              DW$499  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4886                      .dwattr DW$499, DW_AT_name("GPIOB3"), DW_AT_symbol_name("_GPIOB3")
    4887                      .dwattr DW$499, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4888                      .dwattr DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4889                      .dwattr DW$499, DW_AT_accessibility(DW_ACCESS_public)
    4890              DW$500  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4891                      .dwattr DW$500, DW_AT_name("GPIOB4"), DW_AT_symbol_name("_GPIOB4")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:46:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0042                            PAGE   94

    4892                      .dwattr DW$500, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4893                      .dwattr DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4894                      .dwattr DW$500, DW_AT_accessibility(DW_ACCESS_public)
    4895              DW$501  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4896                      .dwattr DW$501, DW_AT_name("GPIOB5"), DW_AT_symbol_name("_GPIOB5")
    4897                      .dwattr DW$501, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4898                      .dwattr DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4899                      .dwattr DW$501, DW_AT_accessibility(DW_ACCESS_public)
    4900              DW$502  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4901                      .dwattr DW$502, DW_AT_name("GPIOB6"), DW_AT_symbol_name("_GPIOB6")
    4902                      .dwattr DW$502, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4903                      .dwattr DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4904                      .dwattr DW$502, DW_AT_accessibility(DW_ACCESS_public)
    4905              DW$503  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4906                      .dwattr DW$503, DW_AT_name("GPIOB7"), DW_AT_symbol_name("_GPIOB7")
    4907                      .dwattr DW$503, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4908                      .dwattr DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4909                      .dwattr DW$503, DW_AT_accessibility(DW_ACCESS_public)
    4910              DW$504  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4911                      .dwattr DW$504, DW_AT_name("GPIOB8"), DW_AT_symbol_name("_GPIOB8")
    4912                      .dwattr DW$504, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4913                      .dwattr DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4914                      .dwattr DW$504, DW_AT_accessibility(DW_ACCESS_public)
    4915              DW$505  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4916                      .dwattr DW$505, DW_AT_name("GPIOB9"), DW_AT_symbol_name("_GPIOB9")
    4917                      .dwattr DW$505, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4918                      .dwattr DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4919                      .dwattr DW$505, DW_AT_accessibility(DW_ACCESS_public)
    4920              DW$506  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4921                      .dwattr DW$506, DW_AT_name("GPIOB10"), DW_AT_symbol_name("_GPIOB10")
    4922                      .dwattr DW$506, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4923                      .dwattr DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4924                      .dwattr DW$506, DW_AT_accessibility(DW_ACCESS_public)
    4925              DW$507  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4926                      .dwattr DW$507, DW_AT_name("GPIOB11"), DW_AT_symbol_name("_GPIOB11")
    4927                      .dwattr DW$507, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4928                      .dwattr DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4929                      .dwattr DW$507, DW_AT_accessibility(DW_ACCESS_public)
    4930              DW$508  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4931                      .dwattr DW$508, DW_AT_name("GPIOB12"), DW_AT_symbol_name("_GPIOB12")
    4932                      .dwattr DW$508, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4933                      .dwattr DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4934                      .dwattr DW$508, DW_AT_accessibility(DW_ACCESS_public)
    4935              DW$509  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4936                      .dwattr DW$509, DW_AT_name("GPIOB13"), DW_AT_symbol_name("_GPIOB13")
    4937                      .dwattr DW$509, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
