TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Tue Sep 28 14:43:24 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("spi.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              DW$1    .dwtag  DW_TAG_variable, DW_AT_name("SpiaRegs"), DW_AT_symbol_name("_SpiaRegs")
      14                      .dwattr DW$1, DW_AT_type(*DW$T$136)
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)

     345                      .dwattr DW$23, DW_AT_begin_file("spi.c")
     346                      .dwattr DW$23, DW_AT_begin_line(0x61)
     347                      .dwattr DW$23, DW_AT_begin_column(0x06)
     348                      .dwpsn  "spi.c",98,1
     349              
     350                      .dwfde DW$CIE
     351              
     352              ;***************************************************************
     353              ;* FNAME: _spi_fifo_init                FR SIZE:   0           *
     354              ;*                                                             *
     355              ;* FUNCTION ENVIRONMENT                                        *
     356              ;*                                                             *
     357              ;* FUNCTION PROPERTIES                                         *
     358              ;*                            0 Parameter,  0 Auto,  0 SOE     *
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE    8

     359              ;***************************************************************
     360              
     361              _spi_fifo_init:
     362                      .dwcfa  0x1d, -2
     363                      .dwcfa  0x1c, 26, 0
     364                      .dwcfa  0x09, 40, 26
     365                      .dwpsn  "spi.c",100,2
     366 0000006b 761F!         MOVW      DP,#_SpiaRegs+10
         0000006c 0000 
     367 0000006d 280A!         MOV       @_SpiaRegs+10,#57408  ; |100| 
         0000006e E040 
     368                      .dwpsn  "spi.c",101,2
     369 0000006f 280B!         MOV       @_SpiaRegs+11,#8271   ; |101| 
         00000070 204F 
     370                      .dwpsn  "spi.c",102,1
     371 00000071 0006          LRETR
     372                      ; return occurs
     373                      .dwattr DW$23, DW_AT_end_file("spi.c")
     374                      .dwattr DW$23, DW_AT_end_line(0x66)
     375                      .dwattr DW$23, DW_AT_end_column(0x01)
     376                      .dwendentry
     377                      .dwendtag DW$23
     378              
     379              ;***************************************************************
     380              ;* UNDEFINED EXTERNAL REFERENCES                               *
     381              ;***************************************************************
     382                      .global _SpiaRegs
     383                      .global _GpioDataRegs
     384                      .global _GpioMuxRegs
     385              
     386              ;***************************************************************
     387              ;* TYPE INFORMATION                                            *
     388              ;***************************************************************
     389              
     390              DW$T$121        .dwtag  DW_TAG_subroutine_type
     391                      .dwattr DW$T$121, DW_AT_language(DW_LANG_C)
     392              
     393              DW$T$124        .dwtag  DW_TAG_subroutine_type
     394                      .dwattr DW$T$124, DW_AT_language(DW_LANG_C)
     395              DW$24   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$122)
     396              DW$25   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$123)
     397                      .dwendtag DW$T$124
     398              
     399              DW$T$123        .dwtag  DW_TAG_typedef, DW_AT_name("int16"), DW_AT_type(*DW$T$10)
     400                      .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
     401              
     402              DW$T$125        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$123)
     403                      .dwattr DW$T$125, DW_AT_language(DW_LANG_C)
     404              DW$26   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$122)
     405              DW$27   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$123)
     406                      .dwendtag DW$T$125
     407              
     408              DW$28   .dwtag  DW_TAG_far_type
     409                      .dwattr DW$28, DW_AT_type(*DW$T$35)
     410              DW$T$136        .dwtag  DW_TAG_volatile_type
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE    9

     411                      .dwattr DW$T$136, DW_AT_type(*DW$28)
     412              DW$29   .dwtag  DW_TAG_far_type
     413                      .dwattr DW$29, DW_AT_type(*DW$T$70)
     414              DW$T$138        .dwtag  DW_TAG_volatile_type
     415                      .dwattr DW$T$138, DW_AT_type(*DW$29)
     416              DW$30   .dwtag  DW_TAG_far_type
     417                      .dwattr DW$30, DW_AT_type(*DW$T$120)
     418              DW$T$141        .dwtag  DW_TAG_volatile_type
     419                      .dwattr DW$T$141, DW_AT_type(*DW$30)
     420              DW$T$122        .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     421                      .dwattr DW$T$122, DW_AT_encoding(DW_ATE_signed_char)
     422                      .dwattr DW$T$122, DW_AT_byte_size(0x01)
     423              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     424                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     425                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     426              
     427              DW$T$35 .dwtag  DW_TAG_structure_type
     428                      .dwattr DW$T$35, DW_AT_name("SPI_REGS")
     429                      .dwattr DW$T$35, DW_AT_byte_size(0x10)
     430              DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     431                      .dwattr DW$31, DW_AT_name("SPICCR"), DW_AT_symbol_name("_SPICCR")
     432                      .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     433                      .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     434              DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     435                      .dwattr DW$32, DW_AT_name("SPICTL"), DW_AT_symbol_name("_SPICTL")
     436                      .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     437                      .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     438              DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     439                      .dwattr DW$33, DW_AT_name("SPISTS"), DW_AT_symbol_name("_SPISTS")
     440                      .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     441                      .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     442              DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     443                      .dwattr DW$34, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
     444                      .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     445                      .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     446              DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     447                      .dwattr DW$35, DW_AT_name("SPIBRR"), DW_AT_symbol_name("_SPIBRR")
     448                      .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     449                      .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     450              DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     451                      .dwattr DW$36, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
     452                      .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     453                      .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     454              DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     455                      .dwattr DW$37, DW_AT_name("SPIRXEMU"), DW_AT_symbol_name("_SPIRXEMU")
     456                      .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     457                      .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     458              DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     459                      .dwattr DW$38, DW_AT_name("SPIRXBUF"), DW_AT_symbol_name("_SPIRXBUF")
     460                      .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     461                      .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     462              DW$39   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     463                      .dwattr DW$39, DW_AT_name("SPITXBUF"), DW_AT_symbol_name("_SPITXBUF")
     464                      .dwattr DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     465                      .dwattr DW$39, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   10

     466              DW$40   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     467                      .dwattr DW$40, DW_AT_name("SPIDAT"), DW_AT_symbol_name("_SPIDAT")
     468                      .dwattr DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     469                      .dwattr DW$40, DW_AT_accessibility(DW_ACCESS_public)
     470              DW$41   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
     471                      .dwattr DW$41, DW_AT_name("SPIFFTX"), DW_AT_symbol_name("_SPIFFTX")
     472                      .dwattr DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     473                      .dwattr DW$41, DW_AT_accessibility(DW_ACCESS_public)
     474              DW$42   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     475                      .dwattr DW$42, DW_AT_name("SPIFFRX"), DW_AT_symbol_name("_SPIFFRX")
     476                      .dwattr DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     477                      .dwattr DW$42, DW_AT_accessibility(DW_ACCESS_public)
     478              DW$43   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
     479                      .dwattr DW$43, DW_AT_name("SPIFFCT"), DW_AT_symbol_name("_SPIFFCT")
     480                      .dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     481                      .dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
     482              DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     483                      .dwattr DW$44, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
     484                      .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     485                      .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
     486              DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
     487                      .dwattr DW$45, DW_AT_name("SPIPRI"), DW_AT_symbol_name("_SPIPRI")
     488                      .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     489                      .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
     490                      .dwendtag DW$T$35
     491              
     492              
     493              DW$T$70 .dwtag  DW_TAG_structure_type
     494                      .dwattr DW$T$70, DW_AT_name("GPIO_MUX_REGS")
     495                      .dwattr DW$T$70, DW_AT_byte_size(0x20)
     496              DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
     497                      .dwattr DW$46, DW_AT_name("GPAMUX"), DW_AT_symbol_name("_GPAMUX")
     498                      .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     499                      .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
     500              DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
     501                      .dwattr DW$47, DW_AT_name("GPADIR"), DW_AT_symbol_name("_GPADIR")
     502                      .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     503                      .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     504              DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
     505                      .dwattr DW$48, DW_AT_name("GPAQUAL"), DW_AT_symbol_name("_GPAQUAL")
     506                      .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     507                      .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     508              DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     509                      .dwattr DW$49, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
     510                      .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     511                      .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     512              DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
     513                      .dwattr DW$50, DW_AT_name("GPBMUX"), DW_AT_symbol_name("_GPBMUX")
     514                      .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     515                      .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     516              DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
     517                      .dwattr DW$51, DW_AT_name("GPBDIR"), DW_AT_symbol_name("_GPBDIR")
     518                      .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     519                      .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
     520              DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   11

     521                      .dwattr DW$52, DW_AT_name("GPBQUAL"), DW_AT_symbol_name("_GPBQUAL")
     522                      .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     523                      .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     524              DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
     525                      .dwattr DW$53, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
     526                      .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     527                      .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
     528              DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
     529                      .dwattr DW$54, DW_AT_name("GPDMUX"), DW_AT_symbol_name("_GPDMUX")
     530                      .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     531                      .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     532              DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
     533                      .dwattr DW$55, DW_AT_name("GPDDIR"), DW_AT_symbol_name("_GPDDIR")
     534                      .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     535                      .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     536              DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
     537                      .dwattr DW$56, DW_AT_name("GPDQUAL"), DW_AT_symbol_name("_GPDQUAL")
     538                      .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     539                      .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     540              DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     541                      .dwattr DW$57, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
     542                      .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     543                      .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     544              DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
     545                      .dwattr DW$58, DW_AT_name("GPEMUX"), DW_AT_symbol_name("_GPEMUX")
     546                      .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     547                      .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     548              DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
     549                      .dwattr DW$59, DW_AT_name("GPEDIR"), DW_AT_symbol_name("_GPEDIR")
     550                      .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     551                      .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     552              DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     553                      .dwattr DW$60, DW_AT_name("GPEQUAL"), DW_AT_symbol_name("_GPEQUAL")
     554                      .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     555                      .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     556              DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     557                      .dwattr DW$61, DW_AT_name("rsvd4"), DW_AT_symbol_name("_rsvd4")
     558                      .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     559                      .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     560              DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
     561                      .dwattr DW$62, DW_AT_name("GPFMUX"), DW_AT_symbol_name("_GPFMUX")
     562                      .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     563                      .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     564              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
     565                      .dwattr DW$63, DW_AT_name("GPFDIR"), DW_AT_symbol_name("_GPFDIR")
     566                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     567                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     568              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     569                      .dwattr DW$64, DW_AT_name("rsvd5"), DW_AT_symbol_name("_rsvd5")
     570                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     571                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     572              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
     573                      .dwattr DW$65, DW_AT_name("GPGMUX"), DW_AT_symbol_name("_GPGMUX")
     574                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     575                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   12

     576              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
     577                      .dwattr DW$66, DW_AT_name("GPGDIR"), DW_AT_symbol_name("_GPGDIR")
     578                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     579                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     580              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
     581                      .dwattr DW$67, DW_AT_name("rsvd6"), DW_AT_symbol_name("_rsvd6")
     582                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     583                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     584                      .dwendtag DW$T$70
     585              
     586              
     587              DW$T$120        .dwtag  DW_TAG_structure_type
     588                      .dwattr DW$T$120, DW_AT_name("GPIO_DATA_REGS")
     589                      .dwattr DW$T$120, DW_AT_byte_size(0x20)
     590              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
     591                      .dwattr DW$68, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
     592                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     593                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     594              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
     595                      .dwattr DW$69, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
     596                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     597                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     598              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
     599                      .dwattr DW$70, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
     600                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     601                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     602              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
     603                      .dwattr DW$71, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
     604                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     605                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     606              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
     607                      .dwattr DW$72, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
     608                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     609                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     610              DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
     611                      .dwattr DW$73, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
     612                      .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     613                      .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     614              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
     615                      .dwattr DW$74, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
     616                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     617                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     618              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
     619                      .dwattr DW$75, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
     620                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     621                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     622              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
     623                      .dwattr DW$76, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
     624                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     625                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     626              DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
     627                      .dwattr DW$77, DW_AT_name("GPDDAT"), DW_AT_symbol_name("_GPDDAT")
     628                      .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     629                      .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     630              DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   13

     631                      .dwattr DW$78, DW_AT_name("GPDSET"), DW_AT_symbol_name("_GPDSET")
     632                      .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     633                      .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     634              DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
     635                      .dwattr DW$79, DW_AT_name("GPDCLEAR"), DW_AT_symbol_name("_GPDCLEAR")
     636                      .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     637                      .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     638              DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
     639                      .dwattr DW$80, DW_AT_name("GPDTOGGLE"), DW_AT_symbol_name("_GPDTOGGLE")
     640                      .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     641                      .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
     642              DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$96)
     643                      .dwattr DW$81, DW_AT_name("GPEDAT"), DW_AT_symbol_name("_GPEDAT")
     644                      .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     645                      .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
     646              DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$98)
     647                      .dwattr DW$82, DW_AT_name("GPESET"), DW_AT_symbol_name("_GPESET")
     648                      .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     649                      .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
     650              DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$100)
     651                      .dwattr DW$83, DW_AT_name("GPECLEAR"), DW_AT_symbol_name("_GPECLEAR")
     652                      .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     653                      .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
     654              DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$102)
     655                      .dwattr DW$84, DW_AT_name("GPETOGGLE"), DW_AT_symbol_name("_GPETOGGLE")
     656                      .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     657                      .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
     658              DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$104)
     659                      .dwattr DW$85, DW_AT_name("GPFDAT"), DW_AT_symbol_name("_GPFDAT")
     660                      .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     661                      .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
     662              DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$106)
     663                      .dwattr DW$86, DW_AT_name("GPFSET"), DW_AT_symbol_name("_GPFSET")
     664                      .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     665                      .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
     666              DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$108)
     667                      .dwattr DW$87, DW_AT_name("GPFCLEAR"), DW_AT_symbol_name("_GPFCLEAR")
     668                      .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     669                      .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
     670              DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$110)
     671                      .dwattr DW$88, DW_AT_name("GPFTOGGLE"), DW_AT_symbol_name("_GPFTOGGLE")
     672                      .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     673                      .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
     674              DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$112)
     675                      .dwattr DW$89, DW_AT_name("GPGDAT"), DW_AT_symbol_name("_GPGDAT")
     676                      .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     677                      .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
     678              DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$114)
     679                      .dwattr DW$90, DW_AT_name("GPGSET"), DW_AT_symbol_name("_GPGSET")
     680                      .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
     681                      .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
     682              DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$116)
     683                      .dwattr DW$91, DW_AT_name("GPGCLEAR"), DW_AT_symbol_name("_GPGCLEAR")
     684                      .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     685                      .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   14

     686              DW$92   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$118)
     687                      .dwattr DW$92, DW_AT_name("GPGTOGGLE"), DW_AT_symbol_name("_GPGTOGGLE")
     688                      .dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
     689                      .dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
     690              DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
     691                      .dwattr DW$93, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
     692                      .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     693                      .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
     694                      .dwendtag DW$T$120
     695              
     696              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$11)
     697                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     698              
     699              DW$T$34 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
     700                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     701                      .dwattr DW$T$34, DW_AT_byte_size(0x02)
     702              DW$94   .dwtag  DW_TAG_subrange_type
     703                      .dwattr DW$94, DW_AT_upper_bound(0x01)
     704                      .dwendtag DW$T$34
     705              
     706              
     707              DW$T$68 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
     708                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
     709                      .dwattr DW$T$68, DW_AT_byte_size(0x05)
     710              DW$95   .dwtag  DW_TAG_subrange_type
     711                      .dwattr DW$95, DW_AT_upper_bound(0x04)
     712                      .dwendtag DW$T$68
     713              
     714              
     715              DW$T$69 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
     716                      .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
     717                      .dwattr DW$T$69, DW_AT_byte_size(0x06)
     718              DW$96   .dwtag  DW_TAG_subrange_type
     719                      .dwattr DW$96, DW_AT_upper_bound(0x05)
     720                      .dwendtag DW$T$69
     721              
     722              
     723              DW$T$119        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
     724                      .dwattr DW$T$119, DW_AT_language(DW_LANG_C)
     725                      .dwattr DW$T$119, DW_AT_byte_size(0x04)
     726              DW$97   .dwtag  DW_TAG_subrange_type
     727                      .dwattr DW$97, DW_AT_upper_bound(0x03)
     728                      .dwendtag DW$T$119
     729              
     730              
     731              DW$T$21 .dwtag  DW_TAG_union_type
     732                      .dwattr DW$T$21, DW_AT_name("SPICCR_REG")
     733                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
     734              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     735                      .dwattr DW$98, DW_AT_name("all"), DW_AT_symbol_name("_all")
     736                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     737                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
     738              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     739                      .dwattr DW$99, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     740                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   15

     741                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
     742                      .dwendtag DW$T$21
     743              
     744              
     745              DW$T$23 .dwtag  DW_TAG_union_type
     746                      .dwattr DW$T$23, DW_AT_name("SPICTL_REG")
     747                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
     748              DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     749                      .dwattr DW$100, DW_AT_name("all"), DW_AT_symbol_name("_all")
     750                      .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     751                      .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
     752              DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     753                      .dwattr DW$101, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     754                      .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     755                      .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
     756                      .dwendtag DW$T$23
     757              
     758              
     759              DW$T$25 .dwtag  DW_TAG_union_type
     760                      .dwattr DW$T$25, DW_AT_name("SPISTS_REG")
     761                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
     762              DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     763                      .dwattr DW$102, DW_AT_name("all"), DW_AT_symbol_name("_all")
     764                      .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     765                      .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
     766              DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     767                      .dwattr DW$103, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     768                      .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     769                      .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
     770                      .dwendtag DW$T$25
     771              
     772              
     773              DW$T$27 .dwtag  DW_TAG_union_type
     774                      .dwattr DW$T$27, DW_AT_name("SPIFFTX_REG")
     775                      .dwattr DW$T$27, DW_AT_byte_size(0x01)
     776              DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     777                      .dwattr DW$104, DW_AT_name("all"), DW_AT_symbol_name("_all")
     778                      .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     779                      .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
     780              DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     781                      .dwattr DW$105, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     782                      .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     783                      .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
     784                      .dwendtag DW$T$27
     785              
     786              
     787              DW$T$29 .dwtag  DW_TAG_union_type
     788                      .dwattr DW$T$29, DW_AT_name("SPIFFRX_REG")
     789                      .dwattr DW$T$29, DW_AT_byte_size(0x01)
     790              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     791                      .dwattr DW$106, DW_AT_name("all"), DW_AT_symbol_name("_all")
     792                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     793                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
     794              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     795                      .dwattr DW$107, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   16

     796                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     797                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
     798                      .dwendtag DW$T$29
     799              
     800              
     801              DW$T$31 .dwtag  DW_TAG_union_type
     802                      .dwattr DW$T$31, DW_AT_name("SPIFFCT_REG")
     803                      .dwattr DW$T$31, DW_AT_byte_size(0x01)
     804              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     805                      .dwattr DW$108, DW_AT_name("all"), DW_AT_symbol_name("_all")
     806                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     807                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
     808              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     809                      .dwattr DW$109, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     810                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     811                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
     812                      .dwendtag DW$T$31
     813              
     814              
     815              DW$T$33 .dwtag  DW_TAG_union_type
     816                      .dwattr DW$T$33, DW_AT_name("SPIPRI_REG")
     817                      .dwattr DW$T$33, DW_AT_byte_size(0x01)
     818              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     819                      .dwattr DW$110, DW_AT_name("all"), DW_AT_symbol_name("_all")
     820                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     821                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
     822              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
     823                      .dwattr DW$111, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     824                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     825                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
     826                      .dwendtag DW$T$33
     827              
     828              
     829              DW$T$37 .dwtag  DW_TAG_union_type
     830                      .dwattr DW$T$37, DW_AT_name("GPAMUX_REG")
     831                      .dwattr DW$T$37, DW_AT_byte_size(0x01)
     832              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     833                      .dwattr DW$112, DW_AT_name("all"), DW_AT_symbol_name("_all")
     834                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     835                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
     836              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
     837                      .dwattr DW$113, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     838                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     839                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
     840                      .dwendtag DW$T$37
     841              
     842              
     843              DW$T$39 .dwtag  DW_TAG_union_type
     844                      .dwattr DW$T$39, DW_AT_name("GPADIR_REG")
     845                      .dwattr DW$T$39, DW_AT_byte_size(0x01)
     846              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     847                      .dwattr DW$114, DW_AT_name("all"), DW_AT_symbol_name("_all")
     848                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     849                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
     850              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   17

     851                      .dwattr DW$115, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     852                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     853                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
     854                      .dwendtag DW$T$39
     855              
     856              
     857              DW$T$41 .dwtag  DW_TAG_union_type
     858                      .dwattr DW$T$41, DW_AT_name("GPAQUAL_REG")
     859                      .dwattr DW$T$41, DW_AT_byte_size(0x01)
     860              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     861                      .dwattr DW$116, DW_AT_name("all"), DW_AT_symbol_name("_all")
     862                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
     864              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
     865                      .dwattr DW$117, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     866                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     867                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
     868                      .dwendtag DW$T$41
     869              
     870              
     871              DW$T$43 .dwtag  DW_TAG_union_type
     872                      .dwattr DW$T$43, DW_AT_name("GPBMUX_REG")
     873                      .dwattr DW$T$43, DW_AT_byte_size(0x01)
     874              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     875                      .dwattr DW$118, DW_AT_name("all"), DW_AT_symbol_name("_all")
     876                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     877                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
     878              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
     879                      .dwattr DW$119, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     880                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     881                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
     882                      .dwendtag DW$T$43
     883              
     884              
     885              DW$T$45 .dwtag  DW_TAG_union_type
     886                      .dwattr DW$T$45, DW_AT_name("GPBDIR_REG")
     887                      .dwattr DW$T$45, DW_AT_byte_size(0x01)
     888              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     889                      .dwattr DW$120, DW_AT_name("all"), DW_AT_symbol_name("_all")
     890                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     891                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
     892              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
     893                      .dwattr DW$121, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     894                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     895                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
     896                      .dwendtag DW$T$45
     897              
     898              
     899              DW$T$47 .dwtag  DW_TAG_union_type
     900                      .dwattr DW$T$47, DW_AT_name("GPBQUAL_REG")
     901                      .dwattr DW$T$47, DW_AT_byte_size(0x01)
     902              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     903                      .dwattr DW$122, DW_AT_name("all"), DW_AT_symbol_name("_all")
     904                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     905                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   18

     906              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
     907                      .dwattr DW$123, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     908                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     909                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
     910                      .dwendtag DW$T$47
     911              
     912              
     913              DW$T$49 .dwtag  DW_TAG_union_type
     914                      .dwattr DW$T$49, DW_AT_name("GPDMUX_REG")
     915                      .dwattr DW$T$49, DW_AT_byte_size(0x01)
     916              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     917                      .dwattr DW$124, DW_AT_name("all"), DW_AT_symbol_name("_all")
     918                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     919                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
     920              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
     921                      .dwattr DW$125, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     922                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     923                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
     924                      .dwendtag DW$T$49
     925              
     926              
     927              DW$T$51 .dwtag  DW_TAG_union_type
     928                      .dwattr DW$T$51, DW_AT_name("GPDDIR_REG")
     929                      .dwattr DW$T$51, DW_AT_byte_size(0x01)
     930              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     931                      .dwattr DW$126, DW_AT_name("all"), DW_AT_symbol_name("_all")
     932                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     933                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
     934              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
     935                      .dwattr DW$127, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     936                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     937                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
     938                      .dwendtag DW$T$51
     939              
     940              
     941              DW$T$53 .dwtag  DW_TAG_union_type
     942                      .dwattr DW$T$53, DW_AT_name("GPDQUAL_REG")
     943                      .dwattr DW$T$53, DW_AT_byte_size(0x01)
     944              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     945                      .dwattr DW$128, DW_AT_name("all"), DW_AT_symbol_name("_all")
     946                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
     948              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
     949                      .dwattr DW$129, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     950                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     951                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
     952                      .dwendtag DW$T$53
     953              
     954              
     955              DW$T$55 .dwtag  DW_TAG_union_type
     956                      .dwattr DW$T$55, DW_AT_name("GPEMUX_REG")
     957                      .dwattr DW$T$55, DW_AT_byte_size(0x01)
     958              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     959                      .dwattr DW$130, DW_AT_name("all"), DW_AT_symbol_name("_all")
     960                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   19

     961                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
     962              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
     963                      .dwattr DW$131, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     964                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     965                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
     966                      .dwendtag DW$T$55
     967              
     968              
     969              DW$T$57 .dwtag  DW_TAG_union_type
     970                      .dwattr DW$T$57, DW_AT_name("GPEDIR_REG")
     971                      .dwattr DW$T$57, DW_AT_byte_size(0x01)
     972              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     973                      .dwattr DW$132, DW_AT_name("all"), DW_AT_symbol_name("_all")
     974                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
     976              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
     977                      .dwattr DW$133, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     978                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     979                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
     980                      .dwendtag DW$T$57
     981              
     982              
     983              DW$T$59 .dwtag  DW_TAG_union_type
     984                      .dwattr DW$T$59, DW_AT_name("GPEQUAL_REG")
     985                      .dwattr DW$T$59, DW_AT_byte_size(0x01)
     986              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     987                      .dwattr DW$134, DW_AT_name("all"), DW_AT_symbol_name("_all")
     988                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     989                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
     990              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
     991                      .dwattr DW$135, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
     992                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
     994                      .dwendtag DW$T$59
     995              
     996              
     997              DW$T$61 .dwtag  DW_TAG_union_type
     998                      .dwattr DW$T$61, DW_AT_name("GPFMUX_REG")
     999                      .dwattr DW$T$61, DW_AT_byte_size(0x01)
    1000              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1001                      .dwattr DW$136, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1002                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1004              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    1005                      .dwattr DW$137, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1006                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1007                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1008                      .dwendtag DW$T$61
    1009              
    1010              
    1011              DW$T$63 .dwtag  DW_TAG_union_type
    1012                      .dwattr DW$T$63, DW_AT_name("GPFDIR_REG")
    1013                      .dwattr DW$T$63, DW_AT_byte_size(0x01)
    1014              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1015                      .dwattr DW$138, DW_AT_name("all"), DW_AT_symbol_name("_all")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   20

    1016                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1018              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    1019                      .dwattr DW$139, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1020                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1021                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1022                      .dwendtag DW$T$63
    1023              
    1024              
    1025              DW$T$65 .dwtag  DW_TAG_union_type
    1026                      .dwattr DW$T$65, DW_AT_name("GPGMUX_REG")
    1027                      .dwattr DW$T$65, DW_AT_byte_size(0x01)
    1028              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1029                      .dwattr DW$140, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1030                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1031                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1032              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    1033                      .dwattr DW$141, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1034                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1036                      .dwendtag DW$T$65
    1037              
    1038              
    1039              DW$T$67 .dwtag  DW_TAG_union_type
    1040                      .dwattr DW$T$67, DW_AT_name("GPGDIR_REG")
    1041                      .dwattr DW$T$67, DW_AT_byte_size(0x01)
    1042              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1043                      .dwattr DW$142, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1044                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1046              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    1047                      .dwattr DW$143, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1048                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1050                      .dwendtag DW$T$67
    1051              
    1052              
    1053              DW$T$72 .dwtag  DW_TAG_union_type
    1054                      .dwattr DW$T$72, DW_AT_name("GPADAT_REG")
    1055                      .dwattr DW$T$72, DW_AT_byte_size(0x01)
    1056              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1057                      .dwattr DW$144, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1058                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1059                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1060              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
    1061                      .dwattr DW$145, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1062                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1064                      .dwendtag DW$T$72
    1065              
    1066              
    1067              DW$T$74 .dwtag  DW_TAG_union_type
    1068                      .dwattr DW$T$74, DW_AT_name("GPASET_REG")
    1069                      .dwattr DW$T$74, DW_AT_byte_size(0x01)
    1070              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   21

    1071                      .dwattr DW$146, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1072                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1073                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1074              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
    1075                      .dwattr DW$147, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1076                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1077                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1078                      .dwendtag DW$T$74
    1079              
    1080              
    1081              DW$T$76 .dwtag  DW_TAG_union_type
    1082                      .dwattr DW$T$76, DW_AT_name("GPACLEAR_REG")
    1083                      .dwattr DW$T$76, DW_AT_byte_size(0x01)
    1084              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1085                      .dwattr DW$148, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1086                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1087                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1088              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$75)
    1089                      .dwattr DW$149, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1090                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1091                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1092                      .dwendtag DW$T$76
    1093              
    1094              
    1095              DW$T$78 .dwtag  DW_TAG_union_type
    1096                      .dwattr DW$T$78, DW_AT_name("GPATOGGLE_REG")
    1097                      .dwattr DW$T$78, DW_AT_byte_size(0x01)
    1098              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1099                      .dwattr DW$150, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1100                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1101                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1102              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
    1103                      .dwattr DW$151, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1104                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1105                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1106                      .dwendtag DW$T$78
    1107              
    1108              
    1109              DW$T$80 .dwtag  DW_TAG_union_type
    1110                      .dwattr DW$T$80, DW_AT_name("GPBDAT_REG")
    1111                      .dwattr DW$T$80, DW_AT_byte_size(0x01)
    1112              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1113                      .dwattr DW$152, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1114                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1115                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1116              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1117                      .dwattr DW$153, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1118                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1119                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1120                      .dwendtag DW$T$80
    1121              
    1122              
    1123              DW$T$82 .dwtag  DW_TAG_union_type
    1124                      .dwattr DW$T$82, DW_AT_name("GPBSET_REG")
    1125                      .dwattr DW$T$82, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   22

    1126              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1127                      .dwattr DW$154, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1128                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1129                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1130              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$81)
    1131                      .dwattr DW$155, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1132                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1133                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1134                      .dwendtag DW$T$82
    1135              
    1136              
    1137              DW$T$84 .dwtag  DW_TAG_union_type
    1138                      .dwattr DW$T$84, DW_AT_name("GPBCLEAR_REG")
    1139                      .dwattr DW$T$84, DW_AT_byte_size(0x01)
    1140              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1141                      .dwattr DW$156, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1142                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1143                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1144              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$83)
    1145                      .dwattr DW$157, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1146                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1147                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1148                      .dwendtag DW$T$84
    1149              
    1150              
    1151              DW$T$86 .dwtag  DW_TAG_union_type
    1152                      .dwattr DW$T$86, DW_AT_name("GPBTOGGLE_REG")
    1153                      .dwattr DW$T$86, DW_AT_byte_size(0x01)
    1154              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1155                      .dwattr DW$158, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1156                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1157                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1158              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$85)
    1159                      .dwattr DW$159, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1160                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1162                      .dwendtag DW$T$86
    1163              
    1164              
    1165              DW$T$88 .dwtag  DW_TAG_union_type
    1166                      .dwattr DW$T$88, DW_AT_name("GPDDAT_REG")
    1167                      .dwattr DW$T$88, DW_AT_byte_size(0x01)
    1168              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1169                      .dwattr DW$160, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1170                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1172              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$87)
    1173                      .dwattr DW$161, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1174                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1175                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1176                      .dwendtag DW$T$88
    1177              
    1178              
    1179              DW$T$90 .dwtag  DW_TAG_union_type
    1180                      .dwattr DW$T$90, DW_AT_name("GPDSET_REG")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   23

    1181                      .dwattr DW$T$90, DW_AT_byte_size(0x01)
    1182              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1183                      .dwattr DW$162, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1184                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1186              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
    1187                      .dwattr DW$163, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1188                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1189                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1190                      .dwendtag DW$T$90
    1191              
    1192              
    1193              DW$T$92 .dwtag  DW_TAG_union_type
    1194                      .dwattr DW$T$92, DW_AT_name("GPDCLEAR_REG")
    1195                      .dwattr DW$T$92, DW_AT_byte_size(0x01)
    1196              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1197                      .dwattr DW$164, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1198                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1200              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$91)
    1201                      .dwattr DW$165, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1202                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1203                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1204                      .dwendtag DW$T$92
    1205              
    1206              
    1207              DW$T$94 .dwtag  DW_TAG_union_type
    1208                      .dwattr DW$T$94, DW_AT_name("GPDTOGGLE_REG")
    1209                      .dwattr DW$T$94, DW_AT_byte_size(0x01)
    1210              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1211                      .dwattr DW$166, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1212                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1214              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$93)
    1215                      .dwattr DW$167, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1216                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1217                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1218                      .dwendtag DW$T$94
    1219              
    1220              
    1221              DW$T$96 .dwtag  DW_TAG_union_type
    1222                      .dwattr DW$T$96, DW_AT_name("GPEDAT_REG")
    1223                      .dwattr DW$T$96, DW_AT_byte_size(0x01)
    1224              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1225                      .dwattr DW$168, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1226                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1228              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    1229                      .dwattr DW$169, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1230                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1231                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1232                      .dwendtag DW$T$96
    1233              
    1234              
    1235              DW$T$98 .dwtag  DW_TAG_union_type
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   24

    1236                      .dwattr DW$T$98, DW_AT_name("GPESET_REG")
    1237                      .dwattr DW$T$98, DW_AT_byte_size(0x01)
    1238              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1239                      .dwattr DW$170, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1240                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1242              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    1243                      .dwattr DW$171, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1244                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1246                      .dwendtag DW$T$98
    1247              
    1248              
    1249              DW$T$100        .dwtag  DW_TAG_union_type
    1250                      .dwattr DW$T$100, DW_AT_name("GPECLEAR_REG")
    1251                      .dwattr DW$T$100, DW_AT_byte_size(0x01)
    1252              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1253                      .dwattr DW$172, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1254                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1256              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    1257                      .dwattr DW$173, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1258                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1259                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1260                      .dwendtag DW$T$100
    1261              
    1262              
    1263              DW$T$102        .dwtag  DW_TAG_union_type
    1264                      .dwattr DW$T$102, DW_AT_name("GPETOGGLE_REG")
    1265                      .dwattr DW$T$102, DW_AT_byte_size(0x01)
    1266              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1267                      .dwattr DW$174, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1268                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1270              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
    1271                      .dwattr DW$175, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1272                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1274                      .dwendtag DW$T$102
    1275              
    1276              
    1277              DW$T$104        .dwtag  DW_TAG_union_type
    1278                      .dwattr DW$T$104, DW_AT_name("GPFDAT_REG")
    1279                      .dwattr DW$T$104, DW_AT_byte_size(0x01)
    1280              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1281                      .dwattr DW$176, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1282                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1284              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
    1285                      .dwattr DW$177, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1286                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1288                      .dwendtag DW$T$104
    1289              
    1290              
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   25

    1291              DW$T$106        .dwtag  DW_TAG_union_type
    1292                      .dwattr DW$T$106, DW_AT_name("GPFSET_REG")
    1293                      .dwattr DW$T$106, DW_AT_byte_size(0x01)
    1294              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1295                      .dwattr DW$178, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1296                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1298              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
    1299                      .dwattr DW$179, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1300                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1301                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1302                      .dwendtag DW$T$106
    1303              
    1304              
    1305              DW$T$108        .dwtag  DW_TAG_union_type
    1306                      .dwattr DW$T$108, DW_AT_name("GPFCLEAR_REG")
    1307                      .dwattr DW$T$108, DW_AT_byte_size(0x01)
    1308              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1309                      .dwattr DW$180, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1310                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1312              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    1313                      .dwattr DW$181, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1314                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1315                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1316                      .dwendtag DW$T$108
    1317              
    1318              
    1319              DW$T$110        .dwtag  DW_TAG_union_type
    1320                      .dwattr DW$T$110, DW_AT_name("GPFTOGGLE_REG")
    1321                      .dwattr DW$T$110, DW_AT_byte_size(0x01)
    1322              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1323                      .dwattr DW$182, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1324                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1326              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$109)
    1327                      .dwattr DW$183, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1328                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1329                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1330                      .dwendtag DW$T$110
    1331              
    1332              
    1333              DW$T$112        .dwtag  DW_TAG_union_type
    1334                      .dwattr DW$T$112, DW_AT_name("GPGDAT_REG")
    1335                      .dwattr DW$T$112, DW_AT_byte_size(0x01)
    1336              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1337                      .dwattr DW$184, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1338                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1340              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$111)
    1341                      .dwattr DW$185, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1342                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1343                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1344                      .dwendtag DW$T$112
    1345              
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   26

    1346              
    1347              DW$T$114        .dwtag  DW_TAG_union_type
    1348                      .dwattr DW$T$114, DW_AT_name("GPGSET_REG")
    1349                      .dwattr DW$T$114, DW_AT_byte_size(0x01)
    1350              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1351                      .dwattr DW$186, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1352                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1354              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$113)
    1355                      .dwattr DW$187, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1356                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1358                      .dwendtag DW$T$114
    1359              
    1360              
    1361              DW$T$116        .dwtag  DW_TAG_union_type
    1362                      .dwattr DW$T$116, DW_AT_name("GPGCLEAR_REG")
    1363                      .dwattr DW$T$116, DW_AT_byte_size(0x01)
    1364              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1365                      .dwattr DW$188, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1366                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1368              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$115)
    1369                      .dwattr DW$189, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1370                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1371                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1372                      .dwendtag DW$T$116
    1373              
    1374              
    1375              DW$T$118        .dwtag  DW_TAG_union_type
    1376                      .dwattr DW$T$118, DW_AT_name("GPGTOGGLE_REG")
    1377                      .dwattr DW$T$118, DW_AT_byte_size(0x01)
    1378              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1379                      .dwattr DW$190, DW_AT_name("all"), DW_AT_symbol_name("_all")
    1380                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1381                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1382              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    1383                      .dwattr DW$191, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    1384                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1386                      .dwendtag DW$T$118
    1387              
    1388              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1389                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1390                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1391              
    1392              DW$T$20 .dwtag  DW_TAG_structure_type
    1393                      .dwattr DW$T$20, DW_AT_name("SPICCR_BITS")
    1394                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    1395              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1396                      .dwattr DW$192, DW_AT_name("SPICHAR"), DW_AT_symbol_name("_SPICHAR")
    1397                      .dwattr DW$192, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1398                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1399                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1400              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   27

    1401                      .dwattr DW$193, DW_AT_name("SPILBK"), DW_AT_symbol_name("_SPILBK")
    1402                      .dwattr DW$193, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1403                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1405              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1406                      .dwattr DW$194, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    1407                      .dwattr DW$194, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1408                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1410              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1411                      .dwattr DW$195, DW_AT_name("CLKPOLARITY"), DW_AT_symbol_name("_CLKPOLARITY")
    1412                      .dwattr DW$195, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1413                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1414                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1415              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1416                      .dwattr DW$196, DW_AT_name("SPISWRESET"), DW_AT_symbol_name("_SPISWRESET")
    1417                      .dwattr DW$196, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1418                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1420              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1421                      .dwattr DW$197, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    1422                      .dwattr DW$197, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1423                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1424                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1425                      .dwendtag DW$T$20
    1426              
    1427              
    1428              DW$T$22 .dwtag  DW_TAG_structure_type
    1429                      .dwattr DW$T$22, DW_AT_name("SPICTL_BITS")
    1430                      .dwattr DW$T$22, DW_AT_byte_size(0x01)
    1431              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1432                      .dwattr DW$198, DW_AT_name("SPIINTENA"), DW_AT_symbol_name("_SPIINTENA")
    1433                      .dwattr DW$198, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1434                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1435                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1436              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1437                      .dwattr DW$199, DW_AT_name("TALK"), DW_AT_symbol_name("_TALK")
    1438                      .dwattr DW$199, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1439                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1441              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1442                      .dwattr DW$200, DW_AT_name("MASTER_SLAVE"), DW_AT_symbol_name("_MASTER_SLAVE")
    1443                      .dwattr DW$200, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1444                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1446              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1447                      .dwattr DW$201, DW_AT_name("CLK_PHASE"), DW_AT_symbol_name("_CLK_PHASE")
    1448                      .dwattr DW$201, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1449                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1450                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1451              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1452                      .dwattr DW$202, DW_AT_name("OVERRUNINTENA"), DW_AT_symbol_name("_OVERRUNINTENA")
    1453                      .dwattr DW$202, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1454                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   28

    1456              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1457                      .dwattr DW$203, DW_AT_name("rsvd"), DW_AT_symbol_name("_rsvd")
    1458                      .dwattr DW$203, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0b)
    1459                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1460                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1461                      .dwendtag DW$T$22
    1462              
    1463              
    1464              DW$T$24 .dwtag  DW_TAG_structure_type
    1465                      .dwattr DW$T$24, DW_AT_name("SPISTS_BITS")
    1466                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
    1467              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1468                      .dwattr DW$204, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    1469                      .dwattr DW$204, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    1470                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1471                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1472              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1473                      .dwattr DW$205, DW_AT_name("BUFFULL_FLAG"), DW_AT_symbol_name("_BUFFULL_FLAG")
    1474                      .dwattr DW$205, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1475                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1477              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1478                      .dwattr DW$206, DW_AT_name("INT_FLAG"), DW_AT_symbol_name("_INT_FLAG")
    1479                      .dwattr DW$206, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1480                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1481                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1482              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1483                      .dwattr DW$207, DW_AT_name("OVERRUN_FLAG"), DW_AT_symbol_name("_OVERRUN_FLAG")
    1484                      .dwattr DW$207, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1485                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1486                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1487              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1488                      .dwattr DW$208, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    1489                      .dwattr DW$208, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1490                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1492                      .dwendtag DW$T$24
    1493              
    1494              
    1495              DW$T$26 .dwtag  DW_TAG_structure_type
    1496                      .dwattr DW$T$26, DW_AT_name("SPIFFTX_BITS")
    1497                      .dwattr DW$T$26, DW_AT_byte_size(0x01)
    1498              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1499                      .dwattr DW$209, DW_AT_name("TXFFIL"), DW_AT_symbol_name("_TXFFIL")
    1500                      .dwattr DW$209, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    1501                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1503              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1504                      .dwattr DW$210, DW_AT_name("TXFFIENA"), DW_AT_symbol_name("_TXFFIENA")
    1505                      .dwattr DW$210, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1506                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1508              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1509                      .dwattr DW$211, DW_AT_name("TXFFINTCLR"), DW_AT_symbol_name("_TXFFINTCLR")
    1510                      .dwattr DW$211, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   29

    1511                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1513              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1514                      .dwattr DW$212, DW_AT_name("TXFFINT"), DW_AT_symbol_name("_TXFFINT")
    1515                      .dwattr DW$212, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1516                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1517                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1518              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1519                      .dwattr DW$213, DW_AT_name("TXFFST"), DW_AT_symbol_name("_TXFFST")
    1520                      .dwattr DW$213, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    1521                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1523              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1524                      .dwattr DW$214, DW_AT_name("TXFIFO"), DW_AT_symbol_name("_TXFIFO")
    1525                      .dwattr DW$214, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1526                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1528              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1529                      .dwattr DW$215, DW_AT_name("SPIFFENA"), DW_AT_symbol_name("_SPIFFENA")
    1530                      .dwattr DW$215, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1531                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1532                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1533              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1534                      .dwattr DW$216, DW_AT_name("SPIRST"), DW_AT_symbol_name("_SPIRST")
    1535                      .dwattr DW$216, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1536                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1537                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1538                      .dwendtag DW$T$26
    1539              
    1540              
    1541              DW$T$28 .dwtag  DW_TAG_structure_type
    1542                      .dwattr DW$T$28, DW_AT_name("SPIFFRX_BITS")
    1543                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
    1544              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1545                      .dwattr DW$217, DW_AT_name("RXFFIL"), DW_AT_symbol_name("_RXFFIL")
    1546                      .dwattr DW$217, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    1547                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1548                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1549              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1550                      .dwattr DW$218, DW_AT_name("RXFFIENA"), DW_AT_symbol_name("_RXFFIENA")
    1551                      .dwattr DW$218, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1552                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1553                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1554              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1555                      .dwattr DW$219, DW_AT_name("RXFFINTCLR"), DW_AT_symbol_name("_RXFFINTCLR")
    1556                      .dwattr DW$219, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1557                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1559              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1560                      .dwattr DW$220, DW_AT_name("RXFFINT"), DW_AT_symbol_name("_RXFFINT")
    1561                      .dwattr DW$220, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1562                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1563                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1564              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1565                      .dwattr DW$221, DW_AT_name("RXFFST"), DW_AT_symbol_name("_RXFFST")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 28 14:43:24 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0242                            PAGE   30

    1566                      .dwattr DW$221, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    1567                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1568                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1569              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1570                      .dwattr DW$222, DW_AT_name("RXFIFORESET"), DW_AT_symbol_name("_RXFIFORESET")
    1571                      .dwattr DW$222, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1572                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1573                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1574              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1575                      .dwattr DW$223, DW_AT_name("RXFFOVFCLR"), DW_AT_symbol_name("_RXFFOVFCLR")
    1576                      .dwattr DW$223, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1577                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1578                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1579              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1580                      .dwattr DW$224, DW_AT_name("RXFFOVF"), DW_AT_symbol_name("_RXFFOVF")
    1581                      .dwattr DW$224, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1582                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1583                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1584                      .dwendtag DW$T$28
    1585              
    1586              
    1587              DW$T$30 .dwtag  DW_TAG_structure_type
    1588                      .dwattr DW$T$30, DW_AT_name("SPIFFCT_BITS")
    1589                      .dwattr DW$T$30, DW_AT_byte_size(0x01)
    1590              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1591                      .dwattr DW$225, DW_AT_name("TXDLY"), DW_AT_symbol_name("_TXDLY")
    1592                      .dwattr DW$225, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1593                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1594                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1595              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1596                      .dwattr DW$226, DW_AT_name("rsvd"), DW_AT_symbol_name("_rsvd")
    1597                      .dwattr DW$226, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1598                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1599                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
