TMS320C2000 COFF Assembler PC v4.1.3 Thu Jan 06 09:41:22 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4402                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Jan 06 09:41:22 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_wavemod_interface.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

     794                      .dwendtag DW$T$41
     795              
     796              
     797              DW$T$43 .dwtag  DW_TAG_subroutine_type
     798                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
     799              
     800              DW$T$46 .dwtag  DW_TAG_subroutine_type
     801                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
     802              DW$77   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     803              DW$78   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$45)
     804              DW$79   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     805                      .dwendtag DW$T$46
     806              
     807              DW$T$47 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$6)
     808                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
     809              
     810              DW$T$49 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$47)
     811                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
     812              DW$80   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
     813              DW$81   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$48)
     814                      .dwendtag DW$T$49
     815              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Jan 06 09:41:22 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4402                            PAGE   18

     816              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     817                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     818                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     819              
     820              DW$T$51 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     821                      .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
     822              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     823                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     824                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     825              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
     826                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     827              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
     828                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
     829                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
     830              DW$T$45 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$16)
     831                      .dwattr DW$T$45, DW_AT_address_class(0x16)
     832              DW$T$48 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
     833                      .dwattr DW$T$48, DW_AT_address_class(0x16)
     834              DW$T$36 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
     835                      .dwattr DW$T$36, DW_AT_address_class(0x16)
     836              
     837              DW$T$53 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$36)
     838                      .dwattr DW$T$53, DW_AT_language(DW_LANG_C)
     839              
     840              DW$T$55 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$36)
     841                      .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
     842              DW$82   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     843              DW$83   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     844              DW$84   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     845              DW$85   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     846              DW$86   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     847              DW$87   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
     848                      .dwendtag DW$T$55
     849              
     850              
     851              DW$T$57 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$36)
     852                      .dwattr DW$T$57, DW_AT_language(DW_LANG_C)
     853              DW$88   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     854              DW$89   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     855              DW$90   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     856              DW$91   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     857              DW$92   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$48)
     858              DW$93   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     859              DW$94   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
     860                      .dwendtag DW$T$57
     861              
     862              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     863                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     864                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
     865              DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     866                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
     867                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
     868              DW$T$35 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$32)
     869                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
     870              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Jan 06 09:41:22 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4402                            PAGE   19

     871              DW$T$32 .dwtag  DW_TAG_structure_type
     872                      .dwattr DW$T$32, DW_AT_name("hwin")
     873                      .dwattr DW$T$32, DW_AT_byte_size(0x42)
     874              DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     875                      .dwattr DW$95, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
     876                      .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     877                      .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
     878              DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     879                      .dwattr DW$96, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
     880                      .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     881                      .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
     882              DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     883                      .dwattr DW$97, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
     884                      .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     885                      .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
     886              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     887                      .dwattr DW$98, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
     888                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     889                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
     890              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     891                      .dwattr DW$99, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
     892                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     893                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
     894              DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     895                      .dwattr DW$100, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
     896                      .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     897                      .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
     898              DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     899                      .dwattr DW$101, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
     900                      .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     901                      .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
     902              DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     903                      .dwattr DW$102, DW_AT_name("type"), DW_AT_symbol_name("_type")
     904                      .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     905                      .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
     906              DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     907                      .dwattr DW$103, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
     908                      .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     909                      .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
     910              DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     911                      .dwattr DW$104, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
     912                      .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     913                      .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
     914              DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     915                      .dwattr DW$105, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
     916                      .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     917                      .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
     918              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     919                      .dwattr DW$106, DW_AT_name("nline"), DW_AT_symbol_name("_nline")
     920                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     921                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
     922              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     923                      .dwattr DW$107, DW_AT_name("nrow"), DW_AT_symbol_name("_nrow")
     924                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     925                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Jan 06 09:41:22 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4402                            PAGE   20

     926              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     927                      .dwattr DW$108, DW_AT_name("grid_wide"), DW_AT_symbol_name("_grid_wide")
     928                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     929                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
     930              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     931                      .dwattr DW$109, DW_AT_name("grid_high"), DW_AT_symbol_name("_grid_high")
     932                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     933                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
     934              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     935                      .dwattr DW$110, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
     936                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     937                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
     938              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     939                      .dwattr DW$111, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
     940                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     941                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
     942              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     943                      .dwattr DW$112, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
     944                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     945                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
     946              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     947                      .dwattr DW$113, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
     948                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     949                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
     950              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     951                      .dwattr DW$114, DW_AT_name("button_flags"), DW_AT_symbol_name("_button_flags")
     952                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     953                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
     954              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     955                      .dwattr DW$115, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
     956                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
     957                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
     958              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     959                      .dwattr DW$116, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
     960                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     961                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
     962              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     963                      .dwattr DW$117, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
     964                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     965                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
     966              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
     967                      .dwattr DW$118, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
     968                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     969                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
     970              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
     971                      .dwattr DW$119, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
     972                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     973                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
     974              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
     975                      .dwattr DW$120, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
     976                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
     977                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
     978              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     979                      .dwattr DW$121, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
     980                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Jan 06 09:41:22 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4402                            PAGE   21

     981                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
     982                      .dwendtag DW$T$32
     983              
     984              DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
     985                      .dwattr DW$T$22, DW_AT_address_class(0x16)
     986              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
     987                      .dwattr DW$T$28, DW_AT_address_class(0x16)
     988              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
     989                      .dwattr DW$T$24, DW_AT_address_class(0x16)
     990              
     991              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
     992                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
     993                      .dwattr DW$T$26, DW_AT_byte_size(0x1e)
     994              DW$122  .dwtag  DW_TAG_subrange_type
     995                      .dwattr DW$122, DW_AT_upper_bound(0x1d)
     996                      .dwendtag DW$T$26
     997              
     998              DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
     999                      .dwattr DW$T$31, DW_AT_address_class(0x16)
    1000              
    1001              DW$T$27 .dwtag  DW_TAG_subroutine_type
    1002                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    1003              DW$123  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1004                      .dwendtag DW$T$27
    1005              
    1006              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$21)
    1007                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    1008              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    1009                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    1010              DW$T$3  .dwtag  DW_TAG_pointer_type
    1011                      .dwattr DW$T$3, DW_AT_address_class(0x16)
    1012              
    1013              DW$T$21 .dwtag  DW_TAG_structure_type
    1014                      .dwattr DW$T$21, DW_AT_name("edit_mem")
    1015                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    1016              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1017                      .dwattr DW$124, DW_AT_name("x"), DW_AT_symbol_name("_x")
    1018                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1019                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1020              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1021                      .dwattr DW$125, DW_AT_name("y"), DW_AT_symbol_name("_y")
    1022                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1023                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1024              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1025                      .dwattr DW$126, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    1026                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1027                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1028              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1029                      .dwattr DW$127, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    1030                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1031                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1032              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1033                      .dwattr DW$128, DW_AT_name("id"), DW_AT_symbol_name("_id")
    1034                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1035                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Jan 06 09:41:22 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4402                            PAGE   22

    1036              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1037                      .dwattr DW$129, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    1038                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1039                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1040                      .dwendtag DW$T$21
    1041              
    1042              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
    1043                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    1044              DW$130  .dwtag  DW_TAG_far_type
    1045                      .dwattr DW$130, DW_AT_type(*DW$T$25)
    1046              DW$T$29 .dwtag  DW_TAG_const_type
    1047                      .dwattr DW$T$29, DW_AT_type(*DW$130)
    1048              
    1049                      .dwattr DW$48, DW_AT_external(0x01)
    1050                      .dwattr DW$62, DW_AT_external(0x01)
    1051                      .dwattr DW$49, DW_AT_external(0x01)
    1052                      .dwattr DW$64, DW_AT_external(0x01)
    1053                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1054              
    1055              ;***************************************************************
    1056              ;* DWARF CIE ENTRIES                                           *
    1057              ;***************************************************************
    1058              
    1059              DW$CIE  .dwcie 1, 40
    1060                      .dwcfa  0x0c, 20, 0
    1061                      .dwcfa  0x07, 0
    1062                      .dwcfa  0x07, 1
    1063                      .dwcfa  0x07, 2
    1064                      .dwcfa  0x07, 3
    1065                      .dwcfa  0x07, 4
    1066                      .dwcfa  0x07, 5
    1067                      .dwcfa  0x08, 6
    1068                      .dwcfa  0x08, 7
    1069                      .dwcfa  0x08, 8
    1070                      .dwcfa  0x08, 9
    1071                      .dwcfa  0x08, 10
    1072                      .dwcfa  0x08, 11
    1073                      .dwcfa  0x07, 12
    1074                      .dwcfa  0x07, 13
    1075                      .dwcfa  0x07, 14
    1076                      .dwcfa  0x07, 15
    1077                      .dwcfa  0x07, 16
    1078                      .dwcfa  0x07, 17
    1079                      .dwcfa  0x07, 18
    1080                      .dwcfa  0x07, 19
    1081                      .dwcfa  0x07, 20
    1082                      .dwcfa  0x07, 21
    1083                      .dwcfa  0x07, 22
    1084                      .dwcfa  0x07, 23
    1085                      .dwcfa  0x07, 24
    1086                      .dwcfa  0x07, 25
    1087                      .dwcfa  0x07, 26
    1088                      .dwcfa  0x08, 27
    1089                      .dwcfa  0x07, 28
    1090                      .dwcfa  0x07, 29
TMS320C2000 COFF Assembler PC v4.1.3 Thu Jan 06 09:41:22 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4402                            PAGE   23

    1091                      .dwcfa  0x07, 30
    1092                      .dwcfa  0x07, 31
    1093                      .dwcfa  0x07, 32
    1094                      .dwcfa  0x07, 33
    1095                      .dwcfa  0x07, 34
    1096                      .dwcfa  0x07, 35
    1097                      .dwcfa  0x07, 36
    1098                      .dwcfa  0x07, 37
    1099                      .dwcfa  0x07, 38
    1100                      .dwcfa  0x07, 39
    1101                      .dwcfa  0x07, 40
    1102              
    1103              ;***************************************************************
    1104              ;* DWARF REGISTER MAP                                          *
    1105              ;***************************************************************
    1106              
    1107              DW$131  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    1108                      .dwattr DW$131, DW_AT_location[DW_OP_reg0]
