TMS320C2000 COFF Assembler PC v4.1.3 Tue Jan 11 09:59:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8523                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Tue Jan 11 09:59:31 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_wavemod_fun.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

     553              
     554              DW$T$26 .dwtag  DW_TAG_subroutine_type
     555                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
     556              DW$52   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     557                      .dwendtag DW$T$26
     558              
     559              DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
     560                      .dwattr DW$T$27, DW_AT_address_class(0x16)
     561              
     562              DW$T$28 .dwtag  DW_TAG_subroutine_type
     563                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     564              
     565              DW$T$30 .dwtag  DW_TAG_subroutine_type
     566                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     567              DW$53   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     568                      .dwendtag DW$T$30
     569              
     570              
     571              DW$T$33 .dwtag  DW_TAG_subroutine_type
     572                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
     573              DW$54   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     574              DW$55   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
     575              DW$56   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     576                      .dwendtag DW$T$33
     577              
     578              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     579                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     580                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Jan 11 09:59:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8523                            PAGE   13

     581              
     582              DW$T$35 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     583                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
     584              DW$57   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
     585              DW$58   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     586                      .dwendtag DW$T$35
     587              
     588              
     589              DW$T$39 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     590                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     591              DW$59   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     592              DW$60   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
     593                      .dwendtag DW$T$39
     594              
     595              
     596              DW$T$41 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     597                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
     598              DW$61   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     599                      .dwendtag DW$T$41
     600              
     601              DW$T$43 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
     602                      .dwattr DW$T$43, DW_AT_address_class(0x16)
     603              
     604              DW$T$44 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     605                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
     606              DW$62   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$43)
     607              DW$63   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     608                      .dwendtag DW$T$44
     609              
     610              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     611                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     612                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     613              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
     614                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     615              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
     616                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     617              DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$16)
     618                      .dwattr DW$T$32, DW_AT_address_class(0x16)
     619              DW$T$17 .dwtag  DW_TAG_base_type, DW_AT_name("double")
     620                      .dwattr DW$T$17, DW_AT_encoding(DW_ATE_float)
     621                      .dwattr DW$T$17, DW_AT_byte_size(0x02)
     622              
     623              DW$T$46 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$17)
     624                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
     625              DW$64   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$17)
     626                      .dwendtag DW$T$46
     627              
     628              DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("module_id_t"), DW_AT_type(*DW$T$20)
     629                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
     630              DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
     631                      .dwattr DW$T$38, DW_AT_address_class(0x16)
     632              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
     633                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
     634                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
     635              
TMS320C2000 COFF Assembler PC v4.1.3 Tue Jan 11 09:59:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8523                            PAGE   14

     636              DW$T$20 .dwtag  DW_TAG_structure_type
     637                      .dwattr DW$T$20, DW_AT_byte_size(0x0c)
     638              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     639                      .dwattr DW$65, DW_AT_name("DL_measure_mod_id"), DW_AT_symbol_name("_DL_measure_mod_id")
     640                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     641                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     642              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     643                      .dwattr DW$66, DW_AT_name("Sys_setup_mod_id"), DW_AT_symbol_name("_Sys_setup_mod_id")
     644                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     645                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     646              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     647                      .dwattr DW$67, DW_AT_name("USB_mod_id"), DW_AT_symbol_name("_USB_mod_id")
     648                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     649                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     650              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     651                      .dwattr DW$68, DW_AT_name("RM_mod_id"), DW_AT_symbol_name("_RM_mod_id")
     652                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     653                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     654              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     655                      .dwattr DW$69, DW_AT_name("PC_mod_id"), DW_AT_symbol_name("_PC_mod_id")
     656                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     657                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     658              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     659                      .dwattr DW$70, DW_AT_name("Help_mod_id"), DW_AT_symbol_name("_Help_mod_id")
     660                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     661                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     662              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     663                      .dwattr DW$71, DW_AT_name("HZ_input_mod_id"), DW_AT_symbol_name("_HZ_input_mod_id")
     664                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     665                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     666              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     667                      .dwattr DW$72, DW_AT_name("Err_correct_mod_id"), DW_AT_symbol_name("_Err_correct_mod_id")
     668                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     669                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     670              DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     671                      .dwattr DW$73, DW_AT_name("Wave_mod_id"), DW_AT_symbol_name("_Wave_mod_id")
     672                      .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     673                      .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     674              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     675                      .dwattr DW$74, DW_AT_name("USER_mod_id"), DW_AT_symbol_name("_USER_mod_id")
     676                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     677                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     678              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     679                      .dwattr DW$75, DW_AT_name("COMR_mod_id"), DW_AT_symbol_name("_COMR_mod_id")
     680                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     681                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     682              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     683                      .dwattr DW$76, DW_AT_name("WIR_mod_id"), DW_AT_symbol_name("_WIR_mod_id")
     684                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     685                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     686                      .dwendtag DW$T$20
     687              
     688              DW$T$37 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     689                      .dwattr DW$T$37, DW_AT_encoding(DW_ATE_signed_char)
     690                      .dwattr DW$T$37, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Jan 11 09:59:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8523                            PAGE   15

     691              
     692                      .dwattr DW$29, DW_AT_external(0x01)
     693                      .dwattr DW$48, DW_AT_external(0x01)
     694                      .dwattr DW$49, DW_AT_external(0x01)
     695                      .dwattr DW$38, DW_AT_external(0x01)
     696                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     697              
     698              ;***************************************************************
     699              ;* DWARF CIE ENTRIES                                           *
     700              ;***************************************************************
     701              
     702              DW$CIE  .dwcie 1, 40
     703                      .dwcfa  0x0c, 20, 0
     704                      .dwcfa  0x07, 0
     705                      .dwcfa  0x07, 1
     706                      .dwcfa  0x07, 2
     707                      .dwcfa  0x07, 3
     708                      .dwcfa  0x07, 4
     709                      .dwcfa  0x07, 5
     710                      .dwcfa  0x08, 6
     711                      .dwcfa  0x08, 7
     712                      .dwcfa  0x08, 8
     713                      .dwcfa  0x08, 9
     714                      .dwcfa  0x08, 10
     715                      .dwcfa  0x08, 11
     716                      .dwcfa  0x07, 12
     717                      .dwcfa  0x07, 13
     718                      .dwcfa  0x07, 14
     719                      .dwcfa  0x07, 15
     720                      .dwcfa  0x07, 16
     721                      .dwcfa  0x07, 17
     722                      .dwcfa  0x07, 18
     723                      .dwcfa  0x07, 19
     724                      .dwcfa  0x07, 20
     725                      .dwcfa  0x07, 21
     726                      .dwcfa  0x07, 22
     727                      .dwcfa  0x07, 23
     728                      .dwcfa  0x07, 24
     729                      .dwcfa  0x07, 25
     730                      .dwcfa  0x07, 26
     731                      .dwcfa  0x08, 27
     732                      .dwcfa  0x07, 28
     733                      .dwcfa  0x07, 29
     734                      .dwcfa  0x07, 30
     735                      .dwcfa  0x07, 31
     736                      .dwcfa  0x07, 32
     737                      .dwcfa  0x07, 33
     738                      .dwcfa  0x07, 34
     739                      .dwcfa  0x07, 35
     740                      .dwcfa  0x07, 36
     741                      .dwcfa  0x07, 37
     742                      .dwcfa  0x07, 38
     743                      .dwcfa  0x07, 39
     744                      .dwcfa  0x07, 40
     745              
TMS320C2000 COFF Assembler PC v4.1.3 Tue Jan 11 09:59:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8523                            PAGE   16

     746              ;***************************************************************
     747              ;* DWARF REGISTER MAP                                          *
     748              ;***************************************************************
     749              
     750              DW$77   .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
     751                      .dwattr DW$77, DW_AT_location[DW_OP_reg0]
