TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:59 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4322                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Mon May 09 17:05:56 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("FatFs.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("SD_spi_config"), DW_AT_symbol_name("_SD_spi_config")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4322                            PAGE  265

   13825                      .dwattr DW$T$201, DW_AT_language(DW_LANG_C)
   13826              DW$902  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$122)
   13827              DW$903  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$139)
   13828              DW$904  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$166)
   13829                      .dwendtag DW$T$201
   13830              
   13831              
   13832              DW$T$202        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$55)
   13833                      .dwattr DW$T$202, DW_AT_language(DW_LANG_C)
   13834              DW$905  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$122)
   13835                      .dwendtag DW$T$202
   13836              
   13837              
   13838              DW$T$203        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$55)
   13839                      .dwattr DW$T$203, DW_AT_language(DW_LANG_C)
   13840              DW$906  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$122)
   13841              DW$907  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   13842              DW$908  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   13843                      .dwendtag DW$T$203
   13844              
   13845              
   13846              DW$T$206        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$55)
   13847                      .dwattr DW$T$206, DW_AT_language(DW_LANG_C)
   13848              DW$909  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$122)
   13849              DW$910  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$205)
   13850                      .dwendtag DW$T$206
   13851              
   13852              
   13853              DW$T$207        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$55)
   13854                      .dwattr DW$T$207, DW_AT_language(DW_LANG_C)
   13855              DW$911  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$122)
   13856              DW$912  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$122)
   13857                      .dwendtag DW$T$207
   13858              
   13859              DW$T$146        .dwtag  DW_TAG_typedef, DW_AT_name("DRESULT"), DW_AT_type(*DW$T$145)
   13860                      .dwattr DW$T$146, DW_AT_language(DW_LANG_C)
   13861              
   13862              DW$T$147        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$146)
   13863                      .dwattr DW$T$147, DW_AT_language(DW_LANG_C)
   13864              DW$913  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   13865              DW$914  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
   13866              DW$915  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
   13867              DW$916  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   13868                      .dwendtag DW$T$147
   13869              
   13870              
   13871              DW$T$149        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$146)
   13872                      .dwattr DW$T$149, DW_AT_language(DW_LANG_C)
   13873              DW$917  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   13874              DW$918  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$85)
   13875              DW$919  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
   13876              DW$920  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   13877                      .dwendtag DW$T$149
   13878              
   13879              
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:59 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4322                            PAGE  266

   13880              DW$T$151        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$146)
   13881                      .dwattr DW$T$151, DW_AT_language(DW_LANG_C)
   13882              DW$921  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   13883              DW$922  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   13884              DW$923  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
   13885                      .dwendtag DW$T$151
   13886              
   13887              DW$924  .dwtag  DW_TAG_far_type
   13888              DW$T$47 .dwtag  DW_TAG_const_type
   13889                      .dwattr DW$T$47, DW_AT_type(*DW$924)
   13890              DW$925  .dwtag  DW_TAG_far_type
   13891                      .dwattr DW$925, DW_AT_type(*DW$T$23)
   13892              DW$T$84 .dwtag  DW_TAG_const_type
   13893                      .dwattr DW$T$84, DW_AT_type(*DW$925)
   13894              DW$926  .dwtag  DW_TAG_far_type
   13895                      .dwattr DW$926, DW_AT_type(*DW$T$6)
   13896              DW$T$73 .dwtag  DW_TAG_const_type
   13897                      .dwattr DW$T$73, DW_AT_type(*DW$926)
   13898              DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
   13899                      .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
   13900                      .dwattr DW$T$9, DW_AT_byte_size(0x01)
   13901              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
   13902                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
   13903                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
   13904              DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
   13905                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
   13906              
   13907              DW$T$29 .dwtag  DW_TAG_structure_type
   13908                      .dwattr DW$T$29, DW_AT_byte_size(0x21c)
   13909              DW$927  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   13910                      .dwattr DW$927, DW_AT_name("fs_type"), DW_AT_symbol_name("_fs_type")
   13911                      .dwattr DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13912                      .dwattr DW$927, DW_AT_accessibility(DW_ACCESS_public)
   13913              DW$928  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   13914                      .dwattr DW$928, DW_AT_name("drv"), DW_AT_symbol_name("_drv")
   13915                      .dwattr DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13916                      .dwattr DW$928, DW_AT_accessibility(DW_ACCESS_public)
   13917              DW$929  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   13918                      .dwattr DW$929, DW_AT_name("csize"), DW_AT_symbol_name("_csize")
   13919                      .dwattr DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13920                      .dwattr DW$929, DW_AT_accessibility(DW_ACCESS_public)
   13921              DW$930  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   13922                      .dwattr DW$930, DW_AT_name("n_fats"), DW_AT_symbol_name("_n_fats")
   13923                      .dwattr DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13924                      .dwattr DW$930, DW_AT_accessibility(DW_ACCESS_public)
   13925              DW$931  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   13926                      .dwattr DW$931, DW_AT_name("wflag"), DW_AT_symbol_name("_wflag")
   13927                      .dwattr DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13928                      .dwattr DW$931, DW_AT_accessibility(DW_ACCESS_public)
   13929              DW$932  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   13930                      .dwattr DW$932, DW_AT_name("fsi_flag"), DW_AT_symbol_name("_fsi_flag")
   13931                      .dwattr DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13932                      .dwattr DW$932, DW_AT_accessibility(DW_ACCESS_public)
   13933              DW$933  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   13934                      .dwattr DW$933, DW_AT_name("id"), DW_AT_symbol_name("_id")
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:59 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4322                            PAGE  267

   13935                      .dwattr DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13936                      .dwattr DW$933, DW_AT_accessibility(DW_ACCESS_public)
   13937              DW$934  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   13938                      .dwattr DW$934, DW_AT_name("n_rootdir"), DW_AT_symbol_name("_n_rootdir")
   13939                      .dwattr DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13940                      .dwattr DW$934, DW_AT_accessibility(DW_ACCESS_public)
   13941              DW$935  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   13942                      .dwattr DW$935, DW_AT_name("sobj"), DW_AT_symbol_name("_sobj")
   13943                      .dwattr DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13944                      .dwattr DW$935, DW_AT_accessibility(DW_ACCESS_public)
   13945              DW$936  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13946                      .dwattr DW$936, DW_AT_name("last_clust"), DW_AT_symbol_name("_last_clust")
   13947                      .dwattr DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13948                      .dwattr DW$936, DW_AT_accessibility(DW_ACCESS_public)
   13949              DW$937  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13950                      .dwattr DW$937, DW_AT_name("free_clust"), DW_AT_symbol_name("_free_clust")
   13951                      .dwattr DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13952                      .dwattr DW$937, DW_AT_accessibility(DW_ACCESS_public)
   13953              DW$938  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13954                      .dwattr DW$938, DW_AT_name("fsi_sector"), DW_AT_symbol_name("_fsi_sector")
   13955                      .dwattr DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13956                      .dwattr DW$938, DW_AT_accessibility(DW_ACCESS_public)
   13957              DW$939  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13958                      .dwattr DW$939, DW_AT_name("n_fatent"), DW_AT_symbol_name("_n_fatent")
   13959                      .dwattr DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13960                      .dwattr DW$939, DW_AT_accessibility(DW_ACCESS_public)
   13961              DW$940  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13962                      .dwattr DW$940, DW_AT_name("fsize"), DW_AT_symbol_name("_fsize")
   13963                      .dwattr DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13964                      .dwattr DW$940, DW_AT_accessibility(DW_ACCESS_public)
   13965              DW$941  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13966                      .dwattr DW$941, DW_AT_name("fatbase"), DW_AT_symbol_name("_fatbase")
   13967                      .dwattr DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13968                      .dwattr DW$941, DW_AT_accessibility(DW_ACCESS_public)
   13969              DW$942  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13970                      .dwattr DW$942, DW_AT_name("dirbase"), DW_AT_symbol_name("_dirbase")
   13971                      .dwattr DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   13972                      .dwattr DW$942, DW_AT_accessibility(DW_ACCESS_public)
   13973              DW$943  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13974                      .dwattr DW$943, DW_AT_name("database"), DW_AT_symbol_name("_database")
   13975                      .dwattr DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   13976                      .dwattr DW$943, DW_AT_accessibility(DW_ACCESS_public)
   13977              DW$944  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13978                      .dwattr DW$944, DW_AT_name("winsect"), DW_AT_symbol_name("_winsect")
   13979                      .dwattr DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   13980                      .dwattr DW$944, DW_AT_accessibility(DW_ACCESS_public)
   13981              DW$945  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
   13982                      .dwattr DW$945, DW_AT_name("win"), DW_AT_symbol_name("_win")
   13983                      .dwattr DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   13984                      .dwattr DW$945, DW_AT_accessibility(DW_ACCESS_public)
   13985                      .dwendtag DW$T$29
   13986              
   13987              
   13988              DW$T$33 .dwtag  DW_TAG_structure_type
   13989                      .dwattr DW$T$33, DW_AT_byte_size(0x0e)
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:59 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4322                            PAGE  268

   13990              DW$946  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
   13991                      .dwattr DW$946, DW_AT_name("fs"), DW_AT_symbol_name("_fs")
   13992                      .dwattr DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13993                      .dwattr DW$946, DW_AT_accessibility(DW_ACCESS_public)
   13994              DW$947  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   13995                      .dwattr DW$947, DW_AT_name("id"), DW_AT_symbol_name("_id")
   13996                      .dwattr DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13997                      .dwattr DW$947, DW_AT_accessibility(DW_ACCESS_public)
   13998              DW$948  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   13999                      .dwattr DW$948, DW_AT_name("index"), DW_AT_symbol_name("_index")
   14000                      .dwattr DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14001                      .dwattr DW$948, DW_AT_accessibility(DW_ACCESS_public)
   14002              DW$949  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   14003                      .dwattr DW$949, DW_AT_name("sclust"), DW_AT_symbol_name("_sclust")
   14004                      .dwattr DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14005                      .dwattr DW$949, DW_AT_accessibility(DW_ACCESS_public)
   14006              DW$950  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   14007                      .dwattr DW$950, DW_AT_name("clust"), DW_AT_symbol_name("_clust")
   14008                      .dwattr DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14009                      .dwattr DW$950, DW_AT_accessibility(DW_ACCESS_public)
   14010              DW$951  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   14011                      .dwattr DW$951, DW_AT_name("sect"), DW_AT_symbol_name("_sect")
   14012                      .dwattr DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14013                      .dwattr DW$951, DW_AT_accessibility(DW_ACCESS_public)
   14014              DW$952  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
   14015                      .dwattr DW$952, DW_AT_name("dir"), DW_AT_symbol_name("_dir")
   14016                      .dwattr DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14017                      .dwattr DW$952, DW_AT_accessibility(DW_ACCESS_public)
   14018              DW$953  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
   14019                      .dwattr DW$953, DW_AT_name("fn"), DW_AT_symbol_name("_fn")
   14020                      .dwattr DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14021                      .dwattr DW$953, DW_AT_accessibility(DW_ACCESS_public)
   14022                      .dwendtag DW$T$33
   14023              
   14024              DW$T$34 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
   14025                      .dwattr DW$T$34, DW_AT_encoding(DW_ATE_signed_char)
   14026                      .dwattr DW$T$34, DW_AT_byte_size(0x01)
   14027              DW$954  .dwtag  DW_TAG_far_type
   14028                      .dwattr DW$954, DW_AT_type(*DW$T$35)
   14029              DW$T$121        .dwtag  DW_TAG_const_type
   14030                      .dwattr DW$T$121, DW_AT_type(*DW$954)
   14031              DW$955  .dwtag  DW_TAG_far_type
   14032                      .dwattr DW$955, DW_AT_type(*DW$T$34)
   14033              DW$T$111        .dwtag  DW_TAG_const_type
   14034                      .dwattr DW$T$111, DW_AT_type(*DW$955)
   14035              DW$T$162        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
   14036                      .dwattr DW$T$162, DW_AT_address_class(0x16)
   14037              DW$T$60 .dwtag  DW_TAG_typedef, DW_AT_name("FILINFO"), DW_AT_type(*DW$T$37)
   14038                      .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
   14039              DW$956  .dwtag  DW_TAG_far_type
   14040                      .dwattr DW$956, DW_AT_type(*DW$T$60)
   14041              DW$T$204        .dwtag  DW_TAG_const_type
   14042                      .dwattr DW$T$204, DW_AT_type(*DW$956)
   14043              
   14044              DW$T$38 .dwtag  DW_TAG_structure_type
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:59 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4322                            PAGE  269

   14045                      .dwattr DW$T$38, DW_AT_byte_size(0x214)
   14046              DW$957  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
   14047                      .dwattr DW$957, DW_AT_name("fs"), DW_AT_symbol_name("_fs")
   14048                      .dwattr DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14049                      .dwattr DW$957, DW_AT_accessibility(DW_ACCESS_public)
   14050              DW$958  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   14051                      .dwattr DW$958, DW_AT_name("id"), DW_AT_symbol_name("_id")
   14052                      .dwattr DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14053                      .dwattr DW$958, DW_AT_accessibility(DW_ACCESS_public)
   14054              DW$959  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   14055                      .dwattr DW$959, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
   14056                      .dwattr DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14057                      .dwattr DW$959, DW_AT_accessibility(DW_ACCESS_public)
   14058              DW$960  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   14059                      .dwattr DW$960, DW_AT_name("pad1"), DW_AT_symbol_name("_pad1")
   14060                      .dwattr DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14061                      .dwattr DW$960, DW_AT_accessibility(DW_ACCESS_public)
   14062              DW$961  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   14063                      .dwattr DW$961, DW_AT_name("fptr"), DW_AT_symbol_name("_fptr")
   14064                      .dwattr DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14065                      .dwattr DW$961, DW_AT_accessibility(DW_ACCESS_public)
   14066              DW$962  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   14067                      .dwattr DW$962, DW_AT_name("fsize"), DW_AT_symbol_name("_fsize")
   14068                      .dwattr DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   14069                      .dwattr DW$962, DW_AT_accessibility(DW_ACCESS_public)
   14070              DW$963  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   14071                      .dwattr DW$963, DW_AT_name("sclust"), DW_AT_symbol_name("_sclust")
   14072                      .dwattr DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   14073                      .dwattr DW$963, DW_AT_accessibility(DW_ACCESS_public)
   14074              DW$964  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   14075                      .dwattr DW$964, DW_AT_name("clust"), DW_AT_symbol_name("_clust")
   14076                      .dwattr DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   14077                      .dwattr DW$964, DW_AT_accessibility(DW_ACCESS_public)
   14078              DW$965  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   14079                      .dwattr DW$965, DW_AT_name("dsect"), DW_AT_symbol_name("_dsect")
   14080                      .dwattr DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   14081                      .dwattr DW$965, DW_AT_accessibility(DW_ACCESS_public)
   14082              DW$966  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   14083                      .dwattr DW$966, DW_AT_name("dir_sect"), DW_AT_symbol_name("_dir_sect")
   14084                      .dwattr DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   14085                      .dwattr DW$966, DW_AT_accessibility(DW_ACCESS_public)
   14086              DW$967  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
   14087                      .dwattr DW$967, DW_AT_name("dir_ptr"), DW_AT_symbol_name("_dir_ptr")
   14088                      .dwattr DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   14089                      .dwattr DW$967, DW_AT_accessibility(DW_ACCESS_public)
   14090              DW$968  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
   14091                      .dwattr DW$968, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
   14092                      .dwattr DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   14093                      .dwattr DW$968, DW_AT_accessibility(DW_ACCESS_public)
   14094                      .dwendtag DW$T$38
   14095              
   14096              
   14097              DW$T$54 .dwtag  DW_TAG_enumeration_type
   14098                      .dwattr DW$T$54, DW_AT_byte_size(0x01)
   14099              DW$969  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_OK"), DW_AT_const_value(0x00)
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:59 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4322                            PAGE  270

   14100              DW$970  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_DISK_ERR"), DW_AT_const_value(0x01)
   14101              DW$971  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INT_ERR"), DW_AT_const_value(0x02)
   14102              DW$972  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_READY"), DW_AT_const_value(0x03)
   14103              DW$973  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_FILE"), DW_AT_const_value(0x04)
   14104              DW$974  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_PATH"), DW_AT_const_value(0x05)
   14105              DW$975  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_NAME"), DW_AT_const_value(0x06)
   14106              DW$976  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_DENIED"), DW_AT_const_value(0x07)
   14107              DW$977  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_EXIST"), DW_AT_const_value(0x08)
   14108              DW$978  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_OBJECT"), DW_AT_const_value(0x09)
   14109              DW$979  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_WRITE_PROTECTED"), DW_AT_const_value(0x0a)
   14110              DW$980  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_DRIVE"), DW_AT_const_value(0x0b)
   14111              DW$981  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENABLED"), DW_AT_const_value(0x0c)
   14112              DW$982  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_FILESYSTEM"), DW_AT_const_value(0x0d)
   14113              DW$983  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_MKFS_ABORTED"), DW_AT_const_value(0x0e)
   14114              DW$984  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TIMEOUT"), DW_AT_const_value(0x0f)
   14115              DW$985  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_LOCKED"), DW_AT_const_value(0x10)
   14116              DW$986  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENOUGH_CORE"), DW_AT_const_value(0x11)
   14117              DW$987  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TOO_MANY_OPEN_FILES"), DW_AT_const_value(0x12)
   14118                      .dwendtag DW$T$54
   14119              
   14120              
   14121              DW$T$145        .dwtag  DW_TAG_enumeration_type
   14122                      .dwattr DW$T$145, DW_AT_byte_size(0x01)
   14123              DW$988  .dwtag  DW_TAG_enumerator, DW_AT_name("RES_OK"), DW_AT_const_value(0x00)
   14124              DW$989  .dwtag  DW_TAG_enumerator, DW_AT_name("RES_ERROR"), DW_AT_const_value(0x01)
   14125              DW$990  .dwtag  DW_TAG_enumerator, DW_AT_name("RES_WRPRT"), DW_AT_const_value(0x02)
   14126              DW$991  .dwtag  DW_TAG_enumerator, DW_AT_name("RES_NOTRDY"), DW_AT_const_value(0x03)
   14127              DW$992  .dwtag  DW_TAG_enumerator, DW_AT_name("RES_PARERR"), DW_AT_const_value(0x04)
   14128                      .dwendtag DW$T$145
   14129              
   14130              
   14131              DW$T$28 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
   14132                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
   14133                      .dwattr DW$T$28, DW_AT_byte_size(0x200)
   14134              DW$993  .dwtag  DW_TAG_subrange_type
   14135                      .dwattr DW$993, DW_AT_upper_bound(0x1ff)
   14136                      .dwendtag DW$T$28
   14137              
   14138              
   14139              DW$T$22 .dwtag  DW_TAG_structure_type
   14140                      .dwattr DW$T$22, DW_AT_name("os_event")
   14141                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
   14142              DW$994  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
   14143                      .dwattr DW$994, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
   14144                      .dwattr DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14145                      .dwattr DW$994, DW_AT_accessibility(DW_ACCESS_public)
   14146              DW$995  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
   14147                      .dwattr DW$995, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
   14148                      .dwattr DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14149                      .dwattr DW$995, DW_AT_accessibility(DW_ACCESS_public)
   14150              DW$996  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
   14151                      .dwattr DW$996, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
   14152                      .dwattr DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14153                      .dwattr DW$996, DW_AT_accessibility(DW_ACCESS_public)
   14154              DW$997  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:59 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4322                            PAGE  271

   14155                      .dwattr DW$997, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
   14156                      .dwattr DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14157                      .dwattr DW$997, DW_AT_accessibility(DW_ACCESS_public)
   14158              DW$998  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
   14159                      .dwattr DW$998, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
   14160                      .dwattr DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   14161                      .dwattr DW$998, DW_AT_accessibility(DW_ACCESS_public)
   14162                      .dwendtag DW$T$22
   14163              
   14164              
   14165              DW$T$37 .dwtag  DW_TAG_structure_type
   14166                      .dwattr DW$T$37, DW_AT_byte_size(0x12)
   14167              DW$999  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   14168                      .dwattr DW$999, DW_AT_name("fsize"), DW_AT_symbol_name("_fsize")
   14169                      .dwattr DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   14170                      .dwattr DW$999, DW_AT_accessibility(DW_ACCESS_public)
   14171              DW$1000 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   14172                      .dwattr DW$1000, DW_AT_name("fdate"), DW_AT_symbol_name("_fdate")
   14173                      .dwattr DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   14174                      .dwattr DW$1000, DW_AT_accessibility(DW_ACCESS_public)
   14175              DW$1001 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   14176                      .dwattr DW$1001, DW_AT_name("ftime"), DW_AT_symbol_name("_ftime")
   14177                      .dwattr DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   14178                      .dwattr DW$1001, DW_AT_accessibility(DW_ACCESS_public)
   14179              DW$1002 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   14180                      .dwattr DW$1002, DW_AT_name("fattrib"), DW_AT_symbol_name("_fattrib")
   14181                      .dwattr DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   14182                      .dwattr DW$1002, DW_AT_accessibility(DW_ACCESS_public)
   14183              DW$1003 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
   14184                      .dwattr DW$1003, DW_AT_name("fname"), DW_AT_symbol_name("_fname")
   14185                      .dwattr DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   14186                      .dwattr DW$1003, DW_AT_accessibility(DW_ACCESS_public)
   14187                      .dwendtag DW$T$37
   14188              
   14189              
   14190              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
   14191                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
   14192                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
   14193              DW$1004 .dwtag  DW_TAG_subrange_type
   14194                      .dwattr DW$1004, DW_AT_upper_bound(0x07)
   14195                      .dwendtag DW$T$21
   14196              
   14197              
   14198              DW$T$36 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$35)
   14199                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
   14200                      .dwattr DW$T$36, DW_AT_byte_size(0x0d)
   14201              DW$1005 .dwtag  DW_TAG_subrange_type
   14202                      .dwattr DW$1005, DW_AT_upper_bound(0x0c)
   14203                      .dwendtag DW$T$36
   14204              
   14205              
   14206                      .dwattr DW$346, DW_AT_type(*DW$T$23)
   14207                      .dwattr DW$111, DW_AT_type(*DW$T$10)
   14208                      .dwattr DW$351, DW_AT_type(*DW$T$55)
   14209                      .dwattr DW$142, DW_AT_external(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:59 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4322                            PAGE  272

   14210                      .dwattr DW$142, DW_AT_type(*DW$T$27)
   14211                      .dwattr DW$181, DW_AT_type(*DW$T$27)
   14212                      .dwattr DW$267, DW_AT_type(*DW$T$55)
   14213                      .dwattr DW$223, DW_AT_type(*DW$T$55)
   14214                      .dwattr DW$210, DW_AT_type(*DW$T$55)
   14215                      .dwattr DW$236, DW_AT_type(*DW$T$55)
   14216                      .dwattr DW$252, DW_AT_type(*DW$T$55)
   14217                      .dwattr DW$263, DW_AT_type(*DW$T$55)
   14218                      .dwattr DW$197, DW_AT_type(*DW$T$55)
   14219                      .dwattr DW$43, DW_AT_external(0x01)
   14220                      .dwattr DW$43, DW_AT_type(*DW$T$81)
   14221                      .dwattr DW$68, DW_AT_external(0x01)
   14222                      .dwattr DW$68, DW_AT_type(*DW$T$146)
   14223                      .dwattr DW$50, DW_AT_external(0x01)
   14224                      .dwattr DW$50, DW_AT_type(*DW$T$146)
   14225                      .dwattr DW$47, DW_AT_external(0x01)
   14226                      .dwattr DW$47, DW_AT_type(*DW$T$81)
   14227                      .dwattr DW$59, DW_AT_external(0x01)
   14228                      .dwattr DW$59, DW_AT_type(*DW$T$146)
   14229                      .dwattr DW$598, DW_AT_external(0x01)
   14230                      .dwattr DW$598, DW_AT_type(*DW$T$55)
   14231                      .dwattr DW$492, DW_AT_external(0x01)
   14232                      .dwattr DW$492, DW_AT_type(*DW$T$55)
   14233                      .dwattr DW$537, DW_AT_external(0x01)
   14234                      .dwattr DW$537, DW_AT_type(*DW$T$55)
   14235                      .dwattr DW$630, DW_AT_external(0x01)
   14236                      .dwattr DW$630, DW_AT_type(*DW$T$155)
   14237                      .dwattr DW$496, DW_AT_external(0x01)
   14238                      .dwattr DW$496, DW_AT_type(*DW$T$55)
   14239                      .dwattr DW$583, DW_AT_external(0x01)
   14240                      .dwattr DW$583, DW_AT_type(*DW$T$55)
   14241                      .dwattr DW$377, DW_AT_external(0x01)
   14242                      .dwattr DW$377, DW_AT_type(*DW$T$55)
   14243                      .dwattr DW$383, DW_AT_external(0x01)
   14244                      .dwattr DW$383, DW_AT_type(*DW$T$55)
   14245                      .dwattr DW$515, DW_AT_external(0x01)
