TMS320C2000 COFF Assembler PC v4.1.3 Thu May 05 10:06:00 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1122                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu May 05 10:05:57 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("ff.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("ff_rel_grant"), DW_AT_symbol_name("_ff_rel_grant")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              DW$2    .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)

   12676                      .dwattr DW$T$159, DW_AT_language(DW_LANG_C)
   12677              DW$808  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$93)
   12678              DW$809  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$105)
   12679              DW$810  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$126)
   12680                      .dwendtag DW$T$159
   12681              
   12682              
   12683              DW$T$160        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$49)
   12684                      .dwattr DW$T$160, DW_AT_language(DW_LANG_C)
   12685              DW$811  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$93)
   12686                      .dwendtag DW$T$160
   12687              
   12688              
   12689              DW$T$161        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$49)
   12690                      .dwattr DW$T$161, DW_AT_language(DW_LANG_C)
   12691              DW$812  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$93)
   12692              DW$813  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   12693              DW$814  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   12694                      .dwendtag DW$T$161
   12695              
   12696              
   12697              DW$T$164        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$49)
   12698                      .dwattr DW$T$164, DW_AT_language(DW_LANG_C)
   12699              DW$815  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$93)
   12700              DW$816  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$163)
   12701                      .dwendtag DW$T$164
   12702              
   12703              
   12704              DW$T$165        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$49)
   12705                      .dwattr DW$T$165, DW_AT_language(DW_LANG_C)
   12706              DW$817  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$93)
   12707              DW$818  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$93)
   12708                      .dwendtag DW$T$165
   12709              
TMS320C2000 COFF Assembler PC v4.1.3 Thu May 05 10:06:00 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1122                            PAGE  244

   12710              DW$T$108        .dwtag  DW_TAG_typedef, DW_AT_name("DRESULT"), DW_AT_type(*DW$T$107)
   12711                      .dwattr DW$T$108, DW_AT_language(DW_LANG_C)
   12712              
   12713              DW$T$109        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$108)
   12714                      .dwattr DW$T$109, DW_AT_language(DW_LANG_C)
   12715              DW$819  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   12716              DW$820  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
   12717              DW$821  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
   12718              DW$822  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   12719                      .dwendtag DW$T$109
   12720              
   12721              
   12722              DW$T$111        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$108)
   12723                      .dwattr DW$T$111, DW_AT_language(DW_LANG_C)
   12724              DW$823  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   12725              DW$824  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$62)
   12726              DW$825  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
   12727              DW$826  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   12728                      .dwendtag DW$T$111
   12729              
   12730              
   12731              DW$T$113        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$108)
   12732                      .dwattr DW$T$113, DW_AT_language(DW_LANG_C)
   12733              DW$827  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   12734              DW$828  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
   12735              DW$829  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
   12736                      .dwendtag DW$T$113
   12737              
   12738              DW$830  .dwtag  DW_TAG_far_type
   12739              DW$T$41 .dwtag  DW_TAG_const_type
   12740                      .dwattr DW$T$41, DW_AT_type(*DW$830)
   12741              DW$831  .dwtag  DW_TAG_far_type
   12742                      .dwattr DW$831, DW_AT_type(*DW$T$23)
   12743              DW$T$61 .dwtag  DW_TAG_const_type
   12744                      .dwattr DW$T$61, DW_AT_type(*DW$831)
   12745              DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
   12746                      .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
   12747                      .dwattr DW$T$9, DW_AT_byte_size(0x01)
   12748              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
   12749                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
   12750                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
   12751              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
   12752                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
   12753                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
   12754              DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
   12755                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
   12756              DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("FATFS"), DW_AT_type(*DW$T$29)
   12757                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
   12758              
   12759              DW$T$33 .dwtag  DW_TAG_structure_type
   12760                      .dwattr DW$T$33, DW_AT_byte_size(0x0e)
   12761              DW$832  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
   12762                      .dwattr DW$832, DW_AT_name("fs"), DW_AT_symbol_name("_fs")
   12763                      .dwattr DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12764                      .dwattr DW$832, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu May 05 10:06:00 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1122                            PAGE  245

   12765              DW$833  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   12766                      .dwattr DW$833, DW_AT_name("id"), DW_AT_symbol_name("_id")
   12767                      .dwattr DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12768                      .dwattr DW$833, DW_AT_accessibility(DW_ACCESS_public)
   12769              DW$834  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   12770                      .dwattr DW$834, DW_AT_name("index"), DW_AT_symbol_name("_index")
   12771                      .dwattr DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12772                      .dwattr DW$834, DW_AT_accessibility(DW_ACCESS_public)
   12773              DW$835  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12774                      .dwattr DW$835, DW_AT_name("sclust"), DW_AT_symbol_name("_sclust")
   12775                      .dwattr DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12776                      .dwattr DW$835, DW_AT_accessibility(DW_ACCESS_public)
   12777              DW$836  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12778                      .dwattr DW$836, DW_AT_name("clust"), DW_AT_symbol_name("_clust")
   12779                      .dwattr DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12780                      .dwattr DW$836, DW_AT_accessibility(DW_ACCESS_public)
   12781              DW$837  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12782                      .dwattr DW$837, DW_AT_name("sect"), DW_AT_symbol_name("_sect")
   12783                      .dwattr DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12784                      .dwattr DW$837, DW_AT_accessibility(DW_ACCESS_public)
   12785              DW$838  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
   12786                      .dwattr DW$838, DW_AT_name("dir"), DW_AT_symbol_name("_dir")
   12787                      .dwattr DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12788                      .dwattr DW$838, DW_AT_accessibility(DW_ACCESS_public)
   12789              DW$839  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
   12790                      .dwattr DW$839, DW_AT_name("fn"), DW_AT_symbol_name("_fn")
   12791                      .dwattr DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12792                      .dwattr DW$839, DW_AT_accessibility(DW_ACCESS_public)
   12793                      .dwendtag DW$T$33
   12794              
   12795              DW$T$34 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
   12796                      .dwattr DW$T$34, DW_AT_encoding(DW_ATE_signed_char)
   12797                      .dwattr DW$T$34, DW_AT_byte_size(0x01)
   12798              DW$840  .dwtag  DW_TAG_far_type
   12799                      .dwattr DW$840, DW_AT_type(*DW$T$35)
   12800              DW$T$92 .dwtag  DW_TAG_const_type
   12801                      .dwattr DW$T$92, DW_AT_type(*DW$840)
   12802              DW$841  .dwtag  DW_TAG_far_type
   12803                      .dwattr DW$841, DW_AT_type(*DW$T$34)
   12804              DW$T$82 .dwtag  DW_TAG_const_type
   12805                      .dwattr DW$T$82, DW_AT_type(*DW$841)
   12806              DW$T$124        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
   12807                      .dwattr DW$T$124, DW_AT_address_class(0x16)
   12808              DW$T$54 .dwtag  DW_TAG_typedef, DW_AT_name("FILINFO"), DW_AT_type(*DW$T$37)
   12809                      .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
   12810              DW$842  .dwtag  DW_TAG_far_type
   12811                      .dwattr DW$842, DW_AT_type(*DW$T$54)
   12812              DW$T$162        .dwtag  DW_TAG_const_type
   12813                      .dwattr DW$T$162, DW_AT_type(*DW$842)
   12814              DW$T$88 .dwtag  DW_TAG_typedef, DW_AT_name("FIL"), DW_AT_type(*DW$T$38)
   12815                      .dwattr DW$T$88, DW_AT_language(DW_LANG_C)
   12816              
   12817              DW$T$48 .dwtag  DW_TAG_enumeration_type
   12818                      .dwattr DW$T$48, DW_AT_byte_size(0x01)
   12819              DW$843  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_OK"), DW_AT_const_value(0x00)
TMS320C2000 COFF Assembler PC v4.1.3 Thu May 05 10:06:00 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1122                            PAGE  246

   12820              DW$844  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_DISK_ERR"), DW_AT_const_value(0x01)
   12821              DW$845  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INT_ERR"), DW_AT_const_value(0x02)
   12822              DW$846  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_READY"), DW_AT_const_value(0x03)
   12823              DW$847  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_FILE"), DW_AT_const_value(0x04)
   12824              DW$848  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_PATH"), DW_AT_const_value(0x05)
   12825              DW$849  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_NAME"), DW_AT_const_value(0x06)
   12826              DW$850  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_DENIED"), DW_AT_const_value(0x07)
   12827              DW$851  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_EXIST"), DW_AT_const_value(0x08)
   12828              DW$852  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_OBJECT"), DW_AT_const_value(0x09)
   12829              DW$853  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_WRITE_PROTECTED"), DW_AT_const_value(0x0a)
   12830              DW$854  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_DRIVE"), DW_AT_const_value(0x0b)
   12831              DW$855  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENABLED"), DW_AT_const_value(0x0c)
   12832              DW$856  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_FILESYSTEM"), DW_AT_const_value(0x0d)
   12833              DW$857  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_MKFS_ABORTED"), DW_AT_const_value(0x0e)
   12834              DW$858  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TIMEOUT"), DW_AT_const_value(0x0f)
   12835              DW$859  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_LOCKED"), DW_AT_const_value(0x10)
   12836              DW$860  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENOUGH_CORE"), DW_AT_const_value(0x11)
   12837              DW$861  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TOO_MANY_OPEN_FILES"), DW_AT_const_value(0x12)
   12838                      .dwendtag DW$T$48
   12839              
   12840              
   12841              DW$T$107        .dwtag  DW_TAG_enumeration_type
   12842                      .dwattr DW$T$107, DW_AT_byte_size(0x01)
   12843              DW$862  .dwtag  DW_TAG_enumerator, DW_AT_name("RES_OK"), DW_AT_const_value(0x00)
   12844              DW$863  .dwtag  DW_TAG_enumerator, DW_AT_name("RES_ERROR"), DW_AT_const_value(0x01)
   12845              DW$864  .dwtag  DW_TAG_enumerator, DW_AT_name("RES_WRPRT"), DW_AT_const_value(0x02)
   12846              DW$865  .dwtag  DW_TAG_enumerator, DW_AT_name("RES_NOTRDY"), DW_AT_const_value(0x03)
   12847              DW$866  .dwtag  DW_TAG_enumerator, DW_AT_name("RES_PARERR"), DW_AT_const_value(0x04)
   12848                      .dwendtag DW$T$107
   12849              
   12850              
   12851              DW$T$22 .dwtag  DW_TAG_structure_type
   12852                      .dwattr DW$T$22, DW_AT_name("os_event")
   12853                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
   12854              DW$867  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
   12855                      .dwattr DW$867, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
   12856                      .dwattr DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12857                      .dwattr DW$867, DW_AT_accessibility(DW_ACCESS_public)
   12858              DW$868  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
   12859                      .dwattr DW$868, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
   12860                      .dwattr DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12861                      .dwattr DW$868, DW_AT_accessibility(DW_ACCESS_public)
   12862              DW$869  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
   12863                      .dwattr DW$869, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
   12864                      .dwattr DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12865                      .dwattr DW$869, DW_AT_accessibility(DW_ACCESS_public)
   12866              DW$870  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
   12867                      .dwattr DW$870, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
   12868                      .dwattr DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12869                      .dwattr DW$870, DW_AT_accessibility(DW_ACCESS_public)
   12870              DW$871  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
   12871                      .dwattr DW$871, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
   12872                      .dwattr DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12873                      .dwattr DW$871, DW_AT_accessibility(DW_ACCESS_public)
   12874                      .dwendtag DW$T$22
TMS320C2000 COFF Assembler PC v4.1.3 Thu May 05 10:06:00 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1122                            PAGE  247

   12875              
   12876              
   12877              DW$T$29 .dwtag  DW_TAG_structure_type
   12878                      .dwattr DW$T$29, DW_AT_byte_size(0x21c)
   12879              DW$872  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   12880                      .dwattr DW$872, DW_AT_name("fs_type"), DW_AT_symbol_name("_fs_type")
   12881                      .dwattr DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12882                      .dwattr DW$872, DW_AT_accessibility(DW_ACCESS_public)
   12883              DW$873  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   12884                      .dwattr DW$873, DW_AT_name("drv"), DW_AT_symbol_name("_drv")
   12885                      .dwattr DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12886                      .dwattr DW$873, DW_AT_accessibility(DW_ACCESS_public)
   12887              DW$874  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   12888                      .dwattr DW$874, DW_AT_name("csize"), DW_AT_symbol_name("_csize")
   12889                      .dwattr DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12890                      .dwattr DW$874, DW_AT_accessibility(DW_ACCESS_public)
   12891              DW$875  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   12892                      .dwattr DW$875, DW_AT_name("n_fats"), DW_AT_symbol_name("_n_fats")
   12893                      .dwattr DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12894                      .dwattr DW$875, DW_AT_accessibility(DW_ACCESS_public)
   12895              DW$876  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   12896                      .dwattr DW$876, DW_AT_name("wflag"), DW_AT_symbol_name("_wflag")
   12897                      .dwattr DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12898                      .dwattr DW$876, DW_AT_accessibility(DW_ACCESS_public)
   12899              DW$877  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   12900                      .dwattr DW$877, DW_AT_name("fsi_flag"), DW_AT_symbol_name("_fsi_flag")
   12901                      .dwattr DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12902                      .dwattr DW$877, DW_AT_accessibility(DW_ACCESS_public)
   12903              DW$878  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   12904                      .dwattr DW$878, DW_AT_name("id"), DW_AT_symbol_name("_id")
   12905                      .dwattr DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12906                      .dwattr DW$878, DW_AT_accessibility(DW_ACCESS_public)
   12907              DW$879  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   12908                      .dwattr DW$879, DW_AT_name("n_rootdir"), DW_AT_symbol_name("_n_rootdir")
   12909                      .dwattr DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12910                      .dwattr DW$879, DW_AT_accessibility(DW_ACCESS_public)
   12911              DW$880  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
   12912                      .dwattr DW$880, DW_AT_name("sobj"), DW_AT_symbol_name("_sobj")
   12913                      .dwattr DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12914                      .dwattr DW$880, DW_AT_accessibility(DW_ACCESS_public)
   12915              DW$881  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12916                      .dwattr DW$881, DW_AT_name("last_clust"), DW_AT_symbol_name("_last_clust")
   12917                      .dwattr DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12918                      .dwattr DW$881, DW_AT_accessibility(DW_ACCESS_public)
   12919              DW$882  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12920                      .dwattr DW$882, DW_AT_name("free_clust"), DW_AT_symbol_name("_free_clust")
   12921                      .dwattr DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12922                      .dwattr DW$882, DW_AT_accessibility(DW_ACCESS_public)
   12923              DW$883  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12924                      .dwattr DW$883, DW_AT_name("fsi_sector"), DW_AT_symbol_name("_fsi_sector")
   12925                      .dwattr DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12926                      .dwattr DW$883, DW_AT_accessibility(DW_ACCESS_public)
   12927              DW$884  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12928                      .dwattr DW$884, DW_AT_name("n_fatent"), DW_AT_symbol_name("_n_fatent")
   12929                      .dwattr DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 COFF Assembler PC v4.1.3 Thu May 05 10:06:00 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1122                            PAGE  248

   12930                      .dwattr DW$884, DW_AT_accessibility(DW_ACCESS_public)
   12931              DW$885  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12932                      .dwattr DW$885, DW_AT_name("fsize"), DW_AT_symbol_name("_fsize")
   12933                      .dwattr DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   12934                      .dwattr DW$885, DW_AT_accessibility(DW_ACCESS_public)
   12935              DW$886  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12936                      .dwattr DW$886, DW_AT_name("fatbase"), DW_AT_symbol_name("_fatbase")
   12937                      .dwattr DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   12938                      .dwattr DW$886, DW_AT_accessibility(DW_ACCESS_public)
   12939              DW$887  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12940                      .dwattr DW$887, DW_AT_name("dirbase"), DW_AT_symbol_name("_dirbase")
   12941                      .dwattr DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12942                      .dwattr DW$887, DW_AT_accessibility(DW_ACCESS_public)
   12943              DW$888  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12944                      .dwattr DW$888, DW_AT_name("database"), DW_AT_symbol_name("_database")
   12945                      .dwattr DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12946                      .dwattr DW$888, DW_AT_accessibility(DW_ACCESS_public)
   12947              DW$889  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12948                      .dwattr DW$889, DW_AT_name("winsect"), DW_AT_symbol_name("_winsect")
   12949                      .dwattr DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   12950                      .dwattr DW$889, DW_AT_accessibility(DW_ACCESS_public)
   12951              DW$890  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
   12952                      .dwattr DW$890, DW_AT_name("win"), DW_AT_symbol_name("_win")
   12953                      .dwattr DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   12954                      .dwattr DW$890, DW_AT_accessibility(DW_ACCESS_public)
   12955                      .dwendtag DW$T$29
   12956              
   12957              
   12958              DW$T$37 .dwtag  DW_TAG_structure_type
   12959                      .dwattr DW$T$37, DW_AT_byte_size(0x12)
   12960              DW$891  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12961                      .dwattr DW$891, DW_AT_name("fsize"), DW_AT_symbol_name("_fsize")
   12962                      .dwattr DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12963                      .dwattr DW$891, DW_AT_accessibility(DW_ACCESS_public)
   12964              DW$892  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   12965                      .dwattr DW$892, DW_AT_name("fdate"), DW_AT_symbol_name("_fdate")
   12966                      .dwattr DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12967                      .dwattr DW$892, DW_AT_accessibility(DW_ACCESS_public)
   12968              DW$893  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   12969                      .dwattr DW$893, DW_AT_name("ftime"), DW_AT_symbol_name("_ftime")
   12970                      .dwattr DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12971                      .dwattr DW$893, DW_AT_accessibility(DW_ACCESS_public)
   12972              DW$894  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   12973                      .dwattr DW$894, DW_AT_name("fattrib"), DW_AT_symbol_name("_fattrib")
   12974                      .dwattr DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12975                      .dwattr DW$894, DW_AT_accessibility(DW_ACCESS_public)
   12976              DW$895  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
   12977                      .dwattr DW$895, DW_AT_name("fname"), DW_AT_symbol_name("_fname")
   12978                      .dwattr DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12979                      .dwattr DW$895, DW_AT_accessibility(DW_ACCESS_public)
   12980                      .dwendtag DW$T$37
   12981              
   12982              
   12983              DW$T$38 .dwtag  DW_TAG_structure_type
   12984                      .dwattr DW$T$38, DW_AT_byte_size(0x214)
TMS320C2000 COFF Assembler PC v4.1.3 Thu May 05 10:06:00 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1122                            PAGE  249

   12985              DW$896  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
   12986                      .dwattr DW$896, DW_AT_name("fs"), DW_AT_symbol_name("_fs")
   12987                      .dwattr DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12988                      .dwattr DW$896, DW_AT_accessibility(DW_ACCESS_public)
   12989              DW$897  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
   12990                      .dwattr DW$897, DW_AT_name("id"), DW_AT_symbol_name("_id")
   12991                      .dwattr DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12992                      .dwattr DW$897, DW_AT_accessibility(DW_ACCESS_public)
   12993              DW$898  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   12994                      .dwattr DW$898, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
   12995                      .dwattr DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12996                      .dwattr DW$898, DW_AT_accessibility(DW_ACCESS_public)
   12997              DW$899  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   12998                      .dwattr DW$899, DW_AT_name("pad1"), DW_AT_symbol_name("_pad1")
   12999                      .dwattr DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13000                      .dwattr DW$899, DW_AT_accessibility(DW_ACCESS_public)
   13001              DW$900  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13002                      .dwattr DW$900, DW_AT_name("fptr"), DW_AT_symbol_name("_fptr")
   13003                      .dwattr DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13004                      .dwattr DW$900, DW_AT_accessibility(DW_ACCESS_public)
   13005              DW$901  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13006                      .dwattr DW$901, DW_AT_name("fsize"), DW_AT_symbol_name("_fsize")
   13007                      .dwattr DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13008                      .dwattr DW$901, DW_AT_accessibility(DW_ACCESS_public)
   13009              DW$902  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13010                      .dwattr DW$902, DW_AT_name("sclust"), DW_AT_symbol_name("_sclust")
   13011                      .dwattr DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13012                      .dwattr DW$902, DW_AT_accessibility(DW_ACCESS_public)
   13013              DW$903  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13014                      .dwattr DW$903, DW_AT_name("clust"), DW_AT_symbol_name("_clust")
   13015                      .dwattr DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   13016                      .dwattr DW$903, DW_AT_accessibility(DW_ACCESS_public)
   13017              DW$904  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13018                      .dwattr DW$904, DW_AT_name("dsect"), DW_AT_symbol_name("_dsect")
   13019                      .dwattr DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   13020                      .dwattr DW$904, DW_AT_accessibility(DW_ACCESS_public)
   13021              DW$905  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   13022                      .dwattr DW$905, DW_AT_name("dir_sect"), DW_AT_symbol_name("_dir_sect")
   13023                      .dwattr DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   13024                      .dwattr DW$905, DW_AT_accessibility(DW_ACCESS_public)
   13025              DW$906  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
   13026                      .dwattr DW$906, DW_AT_name("dir_ptr"), DW_AT_symbol_name("_dir_ptr")
   13027                      .dwattr DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   13028                      .dwattr DW$906, DW_AT_accessibility(DW_ACCESS_public)
   13029              DW$907  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
   13030                      .dwattr DW$907, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
   13031                      .dwattr DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   13032                      .dwattr DW$907, DW_AT_accessibility(DW_ACCESS_public)
   13033                      .dwendtag DW$T$38
   13034              
   13035              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
   13036                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
   13037              
   13038              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
   13039                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu May 05 10:06:00 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1122                            PAGE  250

   13040                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
   13041              DW$908  .dwtag  DW_TAG_subrange_type
   13042                      .dwattr DW$908, DW_AT_upper_bound(0x07)
   13043                      .dwendtag DW$T$21
   13044              
   13045              
   13046              DW$T$28 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
   13047                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
   13048                      .dwattr DW$T$28, DW_AT_byte_size(0x200)
   13049              DW$909  .dwtag  DW_TAG_subrange_type
   13050                      .dwattr DW$909, DW_AT_upper_bound(0x1ff)
   13051                      .dwendtag DW$T$28
   13052              
   13053              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
   13054                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
   13055              
   13056              DW$T$36 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$35)
   13057                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
   13058                      .dwattr DW$T$36, DW_AT_byte_size(0x0d)
   13059              DW$910  .dwtag  DW_TAG_subrange_type
   13060                      .dwattr DW$910, DW_AT_upper_bound(0x0c)
   13061                      .dwendtag DW$T$36
   13062              
   13063              
   13064                      .dwattr DW$299, DW_AT_type(*DW$T$23)
   13065                      .dwattr DW$65, DW_AT_type(*DW$T$10)
   13066                      .dwattr DW$304, DW_AT_type(*DW$T$49)
   13067                      .dwattr DW$96, DW_AT_external(0x01)
   13068                      .dwattr DW$96, DW_AT_type(*DW$T$27)
   13069                      .dwattr DW$134, DW_AT_type(*DW$T$27)
   13070                      .dwattr DW$220, DW_AT_type(*DW$T$49)
   13071                      .dwattr DW$176, DW_AT_type(*DW$T$49)
   13072                      .dwattr DW$163, DW_AT_type(*DW$T$49)
   13073                      .dwattr DW$189, DW_AT_type(*DW$T$49)
   13074                      .dwattr DW$205, DW_AT_type(*DW$T$49)
   13075                      .dwattr DW$216, DW_AT_type(*DW$T$49)
   13076                      .dwattr DW$150, DW_AT_type(*DW$T$49)
   13077                      .dwattr DW$551, DW_AT_external(0x01)
   13078                      .dwattr DW$551, DW_AT_type(*DW$T$49)
   13079                      .dwattr DW$445, DW_AT_external(0x01)
   13080                      .dwattr DW$445, DW_AT_type(*DW$T$49)
   13081                      .dwattr DW$490, DW_AT_external(0x01)
   13082                      .dwattr DW$490, DW_AT_type(*DW$T$49)
   13083                      .dwattr DW$583, DW_AT_external(0x01)
   13084                      .dwattr DW$583, DW_AT_type(*DW$T$117)
   13085                      .dwattr DW$449, DW_AT_external(0x01)
   13086                      .dwattr DW$449, DW_AT_type(*DW$T$49)
   13087                      .dwattr DW$536, DW_AT_external(0x01)
   13088                      .dwattr DW$536, DW_AT_type(*DW$T$49)
   13089                      .dwattr DW$330, DW_AT_external(0x01)
   13090                      .dwattr DW$330, DW_AT_type(*DW$T$49)
   13091                      .dwattr DW$336, DW_AT_external(0x01)
