TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Mon May 09 17:06:00 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("sd_driver.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    2848              DW$176  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$135)
    2849                      .dwendtag DW$T$138
    2850              
    2851              
    2852              DW$T$140        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
    2853                      .dwattr DW$T$140, DW_AT_language(DW_LANG_C)
    2854              DW$177  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    2855              DW$178  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$135)
    2856                      .dwendtag DW$T$140
    2857              
    2858              DW$T$142        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$141)
    2859                      .dwattr DW$T$142, DW_AT_address_class(0x16)
    2860              
    2861              DW$T$143        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
    2862                      .dwattr DW$T$143, DW_AT_language(DW_LANG_C)
    2863              DW$179  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    2864              DW$180  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$142)
    2865                      .dwendtag DW$T$143
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   57

    2866              
    2867              
    2868              DW$T$144        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
    2869                      .dwattr DW$T$144, DW_AT_language(DW_LANG_C)
    2870              DW$181  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    2871              DW$182  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$135)
    2872              DW$183  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    2873                      .dwendtag DW$T$144
    2874              
    2875              
    2876              DW$T$145        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
    2877                      .dwattr DW$T$145, DW_AT_language(DW_LANG_C)
    2878              DW$184  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    2879              DW$185  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$142)
    2880              DW$186  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    2881                      .dwendtag DW$T$145
    2882              
    2883              
    2884              DW$T$146        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    2885                      .dwattr DW$T$146, DW_AT_language(DW_LANG_C)
    2886                      .dwattr DW$T$146, DW_AT_byte_size(0x06)
    2887              DW$187  .dwtag  DW_TAG_subrange_type
    2888                      .dwattr DW$187, DW_AT_upper_bound(0x05)
    2889                      .dwendtag DW$T$146
    2890              
    2891              
    2892              DW$T$148        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    2893                      .dwattr DW$T$148, DW_AT_language(DW_LANG_C)
    2894                      .dwattr DW$T$148, DW_AT_byte_size(0x10)
    2895              DW$188  .dwtag  DW_TAG_subrange_type
    2896                      .dwattr DW$188, DW_AT_upper_bound(0x0f)
    2897                      .dwendtag DW$T$148
    2898              
    2899              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    2900                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2901                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
    2902              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    2903                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2904                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    2905              DW$T$12 .dwtag  DW_TAG_base_type, DW_AT_name("long")
    2906                      .dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2907                      .dwattr DW$T$12, DW_AT_byte_size(0x02)
    2908              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    2909                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2910                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    2911              
    2912              DW$T$152        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$13)
    2913                      .dwattr DW$T$152, DW_AT_language(DW_LANG_C)
    2914              DW$189  .dwtag  DW_TAG_far_type
    2915                      .dwattr DW$189, DW_AT_type(*DW$T$35)
    2916              DW$T$161        .dwtag  DW_TAG_volatile_type
    2917                      .dwattr DW$T$161, DW_AT_type(*DW$189)
    2918              DW$190  .dwtag  DW_TAG_far_type
    2919                      .dwattr DW$190, DW_AT_type(*DW$T$70)
    2920              DW$T$167        .dwtag  DW_TAG_volatile_type
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   58

    2921                      .dwattr DW$T$167, DW_AT_type(*DW$190)
    2922              DW$191  .dwtag  DW_TAG_far_type
    2923                      .dwattr DW$191, DW_AT_type(*DW$T$120)
    2924              DW$T$176        .dwtag  DW_TAG_volatile_type
    2925                      .dwattr DW$T$176, DW_AT_type(*DW$191)
    2926              DW$192  .dwtag  DW_TAG_far_type
    2927                      .dwattr DW$192, DW_AT_type(*DW$T$6)
    2928              DW$T$141        .dwtag  DW_TAG_const_type
    2929                      .dwattr DW$T$141, DW_AT_type(*DW$192)
    2930              
    2931              DW$T$35 .dwtag  DW_TAG_structure_type
    2932                      .dwattr DW$T$35, DW_AT_name("SPI_REGS")
    2933                      .dwattr DW$T$35, DW_AT_byte_size(0x10)
    2934              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2935                      .dwattr DW$193, DW_AT_name("SPICCR"), DW_AT_symbol_name("_SPICCR")
    2936                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2937                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2938              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2939                      .dwattr DW$194, DW_AT_name("SPICTL"), DW_AT_symbol_name("_SPICTL")
    2940                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2941                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2942              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2943                      .dwattr DW$195, DW_AT_name("SPISTS"), DW_AT_symbol_name("_SPISTS")
    2944                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2945                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2946              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2947                      .dwattr DW$196, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    2948                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2949                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2950              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2951                      .dwattr DW$197, DW_AT_name("SPIBRR"), DW_AT_symbol_name("_SPIBRR")
    2952                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2953                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2954              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2955                      .dwattr DW$198, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    2956                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2957                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2958              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2959                      .dwattr DW$199, DW_AT_name("SPIRXEMU"), DW_AT_symbol_name("_SPIRXEMU")
    2960                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2961                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2962              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2963                      .dwattr DW$200, DW_AT_name("SPIRXBUF"), DW_AT_symbol_name("_SPIRXBUF")
    2964                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2965                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2966              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2967                      .dwattr DW$201, DW_AT_name("SPITXBUF"), DW_AT_symbol_name("_SPITXBUF")
    2968                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2969                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2970              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2971                      .dwattr DW$202, DW_AT_name("SPIDAT"), DW_AT_symbol_name("_SPIDAT")
    2972                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2973                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2974              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2975                      .dwattr DW$203, DW_AT_name("SPIFFTX"), DW_AT_symbol_name("_SPIFFTX")
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   59

    2976                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2977                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2978              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    2979                      .dwattr DW$204, DW_AT_name("SPIFFRX"), DW_AT_symbol_name("_SPIFFRX")
    2980                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2981                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2982              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2983                      .dwattr DW$205, DW_AT_name("SPIFFCT"), DW_AT_symbol_name("_SPIFFCT")
    2984                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2985                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2986              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    2987                      .dwattr DW$206, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
    2988                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2989                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2990              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    2991                      .dwattr DW$207, DW_AT_name("SPIPRI"), DW_AT_symbol_name("_SPIPRI")
    2992                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2993                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2994                      .dwendtag DW$T$35
    2995              
    2996              
    2997              DW$T$70 .dwtag  DW_TAG_structure_type
    2998                      .dwattr DW$T$70, DW_AT_name("GPIO_MUX_REGS")
    2999                      .dwattr DW$T$70, DW_AT_byte_size(0x20)
    3000              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3001                      .dwattr DW$208, DW_AT_name("GPAMUX"), DW_AT_symbol_name("_GPAMUX")
    3002                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3003                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3004              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3005                      .dwattr DW$209, DW_AT_name("GPADIR"), DW_AT_symbol_name("_GPADIR")
    3006                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3007                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3008              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    3009                      .dwattr DW$210, DW_AT_name("GPAQUAL"), DW_AT_symbol_name("_GPAQUAL")
    3010                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3011                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3012              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3013                      .dwattr DW$211, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3014                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3015                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3016              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    3017                      .dwattr DW$212, DW_AT_name("GPBMUX"), DW_AT_symbol_name("_GPBMUX")
    3018                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3019                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3020              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    3021                      .dwattr DW$213, DW_AT_name("GPBDIR"), DW_AT_symbol_name("_GPBDIR")
    3022                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3023                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3024              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    3025                      .dwattr DW$214, DW_AT_name("GPBQUAL"), DW_AT_symbol_name("_GPBQUAL")
    3026                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3027                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3028              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    3029                      .dwattr DW$215, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3030                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   60

    3031                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3032              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    3033                      .dwattr DW$216, DW_AT_name("GPDMUX"), DW_AT_symbol_name("_GPDMUX")
    3034                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3035                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3036              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    3037                      .dwattr DW$217, DW_AT_name("GPDDIR"), DW_AT_symbol_name("_GPDDIR")
    3038                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3039                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3040              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
    3041                      .dwattr DW$218, DW_AT_name("GPDQUAL"), DW_AT_symbol_name("_GPDQUAL")
    3042                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3043                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3044              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3045                      .dwattr DW$219, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
    3046                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3047                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3048              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
    3049                      .dwattr DW$220, DW_AT_name("GPEMUX"), DW_AT_symbol_name("_GPEMUX")
    3050                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3051                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3052              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    3053                      .dwattr DW$221, DW_AT_name("GPEDIR"), DW_AT_symbol_name("_GPEDIR")
    3054                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3055                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3056              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    3057                      .dwattr DW$222, DW_AT_name("GPEQUAL"), DW_AT_symbol_name("_GPEQUAL")
    3058                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3059                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3060              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3061                      .dwattr DW$223, DW_AT_name("rsvd4"), DW_AT_symbol_name("_rsvd4")
    3062                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3063                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3064              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    3065                      .dwattr DW$224, DW_AT_name("GPFMUX"), DW_AT_symbol_name("_GPFMUX")
    3066                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3067                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3068              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    3069                      .dwattr DW$225, DW_AT_name("GPFDIR"), DW_AT_symbol_name("_GPFDIR")
    3070                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3071                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3072              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    3073                      .dwattr DW$226, DW_AT_name("rsvd5"), DW_AT_symbol_name("_rsvd5")
    3074                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3075                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3076              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    3077                      .dwattr DW$227, DW_AT_name("GPGMUX"), DW_AT_symbol_name("_GPGMUX")
    3078                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3079                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3080              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    3081                      .dwattr DW$228, DW_AT_name("GPGDIR"), DW_AT_symbol_name("_GPGDIR")
    3082                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3083                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3084              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
    3085                      .dwattr DW$229, DW_AT_name("rsvd6"), DW_AT_symbol_name("_rsvd6")
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   61

    3086                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3087                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3088                      .dwendtag DW$T$70
    3089              
    3090              
    3091              DW$T$120        .dwtag  DW_TAG_structure_type
    3092                      .dwattr DW$T$120, DW_AT_name("GPIO_DATA_REGS")
    3093                      .dwattr DW$T$120, DW_AT_byte_size(0x20)
    3094              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
    3095                      .dwattr DW$230, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
    3096                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3097                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3098              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    3099                      .dwattr DW$231, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
    3100                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3101                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3102              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    3103                      .dwattr DW$232, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
    3104                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3105                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3106              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
    3107                      .dwattr DW$233, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
    3108                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3109                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3110              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    3111                      .dwattr DW$234, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
    3112                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3113                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3114              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
    3115                      .dwattr DW$235, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
    3116                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3117                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3118              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
    3119                      .dwattr DW$236, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
    3120                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3121                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3122              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
    3123                      .dwattr DW$237, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
    3124                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3125                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3126              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3127                      .dwattr DW$238, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3128                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3129                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3130              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    3131                      .dwattr DW$239, DW_AT_name("GPDDAT"), DW_AT_symbol_name("_GPDDAT")
    3132                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3133                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3134              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    3135                      .dwattr DW$240, DW_AT_name("GPDSET"), DW_AT_symbol_name("_GPDSET")
    3136                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3137                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3138              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
    3139                      .dwattr DW$241, DW_AT_name("GPDCLEAR"), DW_AT_symbol_name("_GPDCLEAR")
    3140                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   62

    3141                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3142              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
    3143                      .dwattr DW$242, DW_AT_name("GPDTOGGLE"), DW_AT_symbol_name("_GPDTOGGLE")
    3144                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3145                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3146              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$96)
    3147                      .dwattr DW$243, DW_AT_name("GPEDAT"), DW_AT_symbol_name("_GPEDAT")
    3148                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3149                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3150              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$98)
    3151                      .dwattr DW$244, DW_AT_name("GPESET"), DW_AT_symbol_name("_GPESET")
    3152                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3153                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3154              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$100)
    3155                      .dwattr DW$245, DW_AT_name("GPECLEAR"), DW_AT_symbol_name("_GPECLEAR")
    3156                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3157                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3158              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$102)
    3159                      .dwattr DW$246, DW_AT_name("GPETOGGLE"), DW_AT_symbol_name("_GPETOGGLE")
    3160                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3161                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3162              DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$104)
    3163                      .dwattr DW$247, DW_AT_name("GPFDAT"), DW_AT_symbol_name("_GPFDAT")
    3164                      .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3165                      .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3166              DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$106)
    3167                      .dwattr DW$248, DW_AT_name("GPFSET"), DW_AT_symbol_name("_GPFSET")
    3168                      .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3169                      .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3170              DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$108)
    3171                      .dwattr DW$249, DW_AT_name("GPFCLEAR"), DW_AT_symbol_name("_GPFCLEAR")
    3172                      .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3173                      .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3174              DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$110)
    3175                      .dwattr DW$250, DW_AT_name("GPFTOGGLE"), DW_AT_symbol_name("_GPFTOGGLE")
    3176                      .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3177                      .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3178              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$112)
    3179                      .dwattr DW$251, DW_AT_name("GPGDAT"), DW_AT_symbol_name("_GPGDAT")
    3180                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3181                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3182              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$114)
    3183                      .dwattr DW$252, DW_AT_name("GPGSET"), DW_AT_symbol_name("_GPGSET")
    3184                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3185                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3186              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$116)
    3187                      .dwattr DW$253, DW_AT_name("GPGCLEAR"), DW_AT_symbol_name("_GPGCLEAR")
    3188                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3189                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3190              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$118)
    3191                      .dwattr DW$254, DW_AT_name("GPGTOGGLE"), DW_AT_symbol_name("_GPGTOGGLE")
    3192                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3193                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3194              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3195                      .dwattr DW$255, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   63

    3196                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3197                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3198                      .dwendtag DW$T$120
    3199              
    3200              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$11)
    3201                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    3202              
    3203              DW$T$34 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3204                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    3205                      .dwattr DW$T$34, DW_AT_byte_size(0x02)
    3206              DW$256  .dwtag  DW_TAG_subrange_type
    3207                      .dwattr DW$256, DW_AT_upper_bound(0x01)
    3208                      .dwendtag DW$T$34
    3209              
    3210              
    3211              DW$T$68 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3212                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    3213                      .dwattr DW$T$68, DW_AT_byte_size(0x05)
    3214              DW$257  .dwtag  DW_TAG_subrange_type
    3215                      .dwattr DW$257, DW_AT_upper_bound(0x04)
    3216                      .dwendtag DW$T$68
    3217              
    3218              
    3219              DW$T$69 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3220                      .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
    3221                      .dwattr DW$T$69, DW_AT_byte_size(0x06)
    3222              DW$258  .dwtag  DW_TAG_subrange_type
    3223                      .dwattr DW$258, DW_AT_upper_bound(0x05)
    3224                      .dwendtag DW$T$69
    3225              
    3226              
    3227              DW$T$119        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3228                      .dwattr DW$T$119, DW_AT_language(DW_LANG_C)
    3229                      .dwattr DW$T$119, DW_AT_byte_size(0x04)
    3230              DW$259  .dwtag  DW_TAG_subrange_type
    3231                      .dwattr DW$259, DW_AT_upper_bound(0x03)
    3232                      .dwendtag DW$T$119
    3233              
    3234              
    3235              DW$T$21 .dwtag  DW_TAG_union_type
    3236                      .dwattr DW$T$21, DW_AT_name("SPICCR_REG")
    3237                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
    3238              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3239                      .dwattr DW$260, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3240                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3241                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3242              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    3243                      .dwattr DW$261, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3244                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3245                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3246                      .dwendtag DW$T$21
    3247              
    3248              
    3249              DW$T$23 .dwtag  DW_TAG_union_type
    3250                      .dwattr DW$T$23, DW_AT_name("SPICTL_REG")
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   64

    3251                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    3252              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3253                      .dwattr DW$262, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3254                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3255                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3256              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    3257                      .dwattr DW$263, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3258                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3259                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3260                      .dwendtag DW$T$23
    3261              
    3262              
    3263              DW$T$25 .dwtag  DW_TAG_union_type
    3264                      .dwattr DW$T$25, DW_AT_name("SPISTS_REG")
    3265                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    3266              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3267                      .dwattr DW$264, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3268                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3269                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3270              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    3271                      .dwattr DW$265, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3272                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3273                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3274                      .dwendtag DW$T$25
    3275              
    3276              
    3277              DW$T$27 .dwtag  DW_TAG_union_type
    3278                      .dwattr DW$T$27, DW_AT_name("SPIFFTX_REG")
    3279                      .dwattr DW$T$27, DW_AT_byte_size(0x01)
    3280              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3281                      .dwattr DW$266, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3282                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3283                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3284              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    3285                      .dwattr DW$267, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3286                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3287                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3288                      .dwendtag DW$T$27
    3289              
    3290              
    3291              DW$T$29 .dwtag  DW_TAG_union_type
    3292                      .dwattr DW$T$29, DW_AT_name("SPIFFRX_REG")
    3293                      .dwattr DW$T$29, DW_AT_byte_size(0x01)
    3294              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3295                      .dwattr DW$268, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3296                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3297                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3298              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    3299                      .dwattr DW$269, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3300                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3301                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3302                      .dwendtag DW$T$29
    3303              
    3304              
    3305              DW$T$31 .dwtag  DW_TAG_union_type
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   65

    3306                      .dwattr DW$T$31, DW_AT_name("SPIFFCT_REG")
    3307                      .dwattr DW$T$31, DW_AT_byte_size(0x01)
    3308              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3309                      .dwattr DW$270, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3310                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3311                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3312              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    3313                      .dwattr DW$271, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3314                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3315                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3316                      .dwendtag DW$T$31
    3317              
    3318              
    3319              DW$T$33 .dwtag  DW_TAG_union_type
    3320                      .dwattr DW$T$33, DW_AT_name("SPIPRI_REG")
    3321                      .dwattr DW$T$33, DW_AT_byte_size(0x01)
    3322              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3323                      .dwattr DW$272, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3324                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3325                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3326              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    3327                      .dwattr DW$273, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3328                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3329                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3330                      .dwendtag DW$T$33
    3331              
    3332              
    3333              DW$T$37 .dwtag  DW_TAG_union_type
    3334                      .dwattr DW$T$37, DW_AT_name("GPAMUX_REG")
    3335                      .dwattr DW$T$37, DW_AT_byte_size(0x01)
    3336              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3337                      .dwattr DW$274, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3338                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3339                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3340              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    3341                      .dwattr DW$275, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3342                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3343                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3344                      .dwendtag DW$T$37
    3345              
    3346              
    3347              DW$T$39 .dwtag  DW_TAG_union_type
    3348                      .dwattr DW$T$39, DW_AT_name("GPADIR_REG")
    3349                      .dwattr DW$T$39, DW_AT_byte_size(0x01)
    3350              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3351                      .dwattr DW$276, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3352                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3353                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3354              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3355                      .dwattr DW$277, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3356                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3357                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3358                      .dwendtag DW$T$39
    3359              
    3360              
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   66

    3361              DW$T$41 .dwtag  DW_TAG_union_type
    3362                      .dwattr DW$T$41, DW_AT_name("GPAQUAL_REG")
    3363                      .dwattr DW$T$41, DW_AT_byte_size(0x01)
    3364              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3365                      .dwattr DW$278, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3366                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3367                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3368              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    3369                      .dwattr DW$279, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3370                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3371                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3372                      .dwendtag DW$T$41
    3373              
    3374              
    3375              DW$T$43 .dwtag  DW_TAG_union_type
    3376                      .dwattr DW$T$43, DW_AT_name("GPBMUX_REG")
    3377                      .dwattr DW$T$43, DW_AT_byte_size(0x01)
    3378              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3379                      .dwattr DW$280, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3380                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3381                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3382              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3383                      .dwattr DW$281, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3384                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3385                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3386                      .dwendtag DW$T$43
    3387              
    3388              
    3389              DW$T$45 .dwtag  DW_TAG_union_type
    3390                      .dwattr DW$T$45, DW_AT_name("GPBDIR_REG")
    3391                      .dwattr DW$T$45, DW_AT_byte_size(0x01)
    3392              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3393                      .dwattr DW$282, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3394                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3395                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3396              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    3397                      .dwattr DW$283, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3398                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3399                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3400                      .dwendtag DW$T$45
    3401              
    3402              
    3403              DW$T$47 .dwtag  DW_TAG_union_type
    3404                      .dwattr DW$T$47, DW_AT_name("GPBQUAL_REG")
    3405                      .dwattr DW$T$47, DW_AT_byte_size(0x01)
    3406              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3407                      .dwattr DW$284, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3408                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3409                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3410              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    3411                      .dwattr DW$285, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3412                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3413                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3414                      .dwendtag DW$T$47
    3415              
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   67

    3416              
    3417              DW$T$49 .dwtag  DW_TAG_union_type
    3418                      .dwattr DW$T$49, DW_AT_name("GPDMUX_REG")
    3419                      .dwattr DW$T$49, DW_AT_byte_size(0x01)
    3420              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3421                      .dwattr DW$286, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3422                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3423                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3424              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    3425                      .dwattr DW$287, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3426                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3427                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3428                      .dwendtag DW$T$49
    3429              
    3430              
    3431              DW$T$51 .dwtag  DW_TAG_union_type
    3432                      .dwattr DW$T$51, DW_AT_name("GPDDIR_REG")
    3433                      .dwattr DW$T$51, DW_AT_byte_size(0x01)
    3434              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3435                      .dwattr DW$288, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3436                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3437                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3438              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    3439                      .dwattr DW$289, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3440                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3441                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3442                      .dwendtag DW$T$51
    3443              
    3444              
    3445              DW$T$53 .dwtag  DW_TAG_union_type
    3446                      .dwattr DW$T$53, DW_AT_name("GPDQUAL_REG")
    3447                      .dwattr DW$T$53, DW_AT_byte_size(0x01)
    3448              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3449                      .dwattr DW$290, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3450                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3451                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3452              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    3453                      .dwattr DW$291, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3454                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3455                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3456                      .dwendtag DW$T$53
    3457              
    3458              
    3459              DW$T$55 .dwtag  DW_TAG_union_type
    3460                      .dwattr DW$T$55, DW_AT_name("GPEMUX_REG")
    3461                      .dwattr DW$T$55, DW_AT_byte_size(0x01)
    3462              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3463                      .dwattr DW$292, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3464                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3465                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3466              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    3467                      .dwattr DW$293, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3468                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3469                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3470                      .dwendtag DW$T$55
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   68

    3471              
    3472              
    3473              DW$T$57 .dwtag  DW_TAG_union_type
    3474                      .dwattr DW$T$57, DW_AT_name("GPEDIR_REG")
    3475                      .dwattr DW$T$57, DW_AT_byte_size(0x01)
    3476              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3477                      .dwattr DW$294, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3478                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3479                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3480              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    3481                      .dwattr DW$295, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3482                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3483                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3484                      .dwendtag DW$T$57
    3485              
    3486              
    3487              DW$T$59 .dwtag  DW_TAG_union_type
    3488                      .dwattr DW$T$59, DW_AT_name("GPEQUAL_REG")
    3489                      .dwattr DW$T$59, DW_AT_byte_size(0x01)
    3490              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3491                      .dwattr DW$296, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3492                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3493                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3494              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3495                      .dwattr DW$297, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3496                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3497                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3498                      .dwendtag DW$T$59
    3499              
    3500              
    3501              DW$T$61 .dwtag  DW_TAG_union_type
    3502                      .dwattr DW$T$61, DW_AT_name("GPFMUX_REG")
    3503                      .dwattr DW$T$61, DW_AT_byte_size(0x01)
    3504              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3505                      .dwattr DW$298, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3506                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3507                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3508              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    3509                      .dwattr DW$299, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3510                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3511                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3512                      .dwendtag DW$T$61
    3513              
    3514              
    3515              DW$T$63 .dwtag  DW_TAG_union_type
    3516                      .dwattr DW$T$63, DW_AT_name("GPFDIR_REG")
    3517                      .dwattr DW$T$63, DW_AT_byte_size(0x01)
    3518              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3519                      .dwattr DW$300, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3520                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3521                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3522              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    3523                      .dwattr DW$301, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3524                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3525                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   69

    3526                      .dwendtag DW$T$63
    3527              
    3528              
    3529              DW$T$65 .dwtag  DW_TAG_union_type
    3530                      .dwattr DW$T$65, DW_AT_name("GPGMUX_REG")
    3531                      .dwattr DW$T$65, DW_AT_byte_size(0x01)
    3532              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3533                      .dwattr DW$302, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3534                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3535                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3536              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    3537                      .dwattr DW$303, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3538                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3539                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3540                      .dwendtag DW$T$65
    3541              
    3542              
    3543              DW$T$67 .dwtag  DW_TAG_union_type
    3544                      .dwattr DW$T$67, DW_AT_name("GPGDIR_REG")
    3545                      .dwattr DW$T$67, DW_AT_byte_size(0x01)
    3546              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3547                      .dwattr DW$304, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3548                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3549                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3550              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    3551                      .dwattr DW$305, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3552                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3553                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3554                      .dwendtag DW$T$67
    3555              
    3556              
    3557              DW$T$72 .dwtag  DW_TAG_union_type
    3558                      .dwattr DW$T$72, DW_AT_name("GPADAT_REG")
    3559                      .dwattr DW$T$72, DW_AT_byte_size(0x01)
    3560              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3561                      .dwattr DW$306, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3562                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3563                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3564              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
    3565                      .dwattr DW$307, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3566                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3567                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3568                      .dwendtag DW$T$72
    3569              
    3570              
    3571              DW$T$74 .dwtag  DW_TAG_union_type
    3572                      .dwattr DW$T$74, DW_AT_name("GPASET_REG")
    3573                      .dwattr DW$T$74, DW_AT_byte_size(0x01)
    3574              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3575                      .dwattr DW$308, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3576                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3577                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3578              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
    3579                      .dwattr DW$309, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3580                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   70

    3581                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3582                      .dwendtag DW$T$74
    3583              
    3584              
    3585              DW$T$76 .dwtag  DW_TAG_union_type
    3586                      .dwattr DW$T$76, DW_AT_name("GPACLEAR_REG")
    3587                      .dwattr DW$T$76, DW_AT_byte_size(0x01)
    3588              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3589                      .dwattr DW$310, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3590                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3591                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3592              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$75)
    3593                      .dwattr DW$311, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3594                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3595                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3596                      .dwendtag DW$T$76
    3597              
    3598              
    3599              DW$T$78 .dwtag  DW_TAG_union_type
    3600                      .dwattr DW$T$78, DW_AT_name("GPATOGGLE_REG")
    3601                      .dwattr DW$T$78, DW_AT_byte_size(0x01)
    3602              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3603                      .dwattr DW$312, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3604                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3605                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3606              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
    3607                      .dwattr DW$313, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3608                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3609                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3610                      .dwendtag DW$T$78
    3611              
    3612              
    3613              DW$T$80 .dwtag  DW_TAG_union_type
    3614                      .dwattr DW$T$80, DW_AT_name("GPBDAT_REG")
    3615                      .dwattr DW$T$80, DW_AT_byte_size(0x01)
    3616              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3617                      .dwattr DW$314, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3618                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3619                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3620              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    3621                      .dwattr DW$315, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3622                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3623                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3624                      .dwendtag DW$T$80
    3625              
    3626              
    3627              DW$T$82 .dwtag  DW_TAG_union_type
    3628                      .dwattr DW$T$82, DW_AT_name("GPBSET_REG")
    3629                      .dwattr DW$T$82, DW_AT_byte_size(0x01)
    3630              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3631                      .dwattr DW$316, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3632                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3633                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3634              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$81)
    3635                      .dwattr DW$317, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   71

    3636                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3637                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3638                      .dwendtag DW$T$82
    3639              
    3640              
    3641              DW$T$84 .dwtag  DW_TAG_union_type
    3642                      .dwattr DW$T$84, DW_AT_name("GPBCLEAR_REG")
    3643                      .dwattr DW$T$84, DW_AT_byte_size(0x01)
    3644              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3645                      .dwattr DW$318, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3646                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3647                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3648              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$83)
    3649                      .dwattr DW$319, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3650                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3651                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3652                      .dwendtag DW$T$84
    3653              
    3654              
    3655              DW$T$86 .dwtag  DW_TAG_union_type
    3656                      .dwattr DW$T$86, DW_AT_name("GPBTOGGLE_REG")
    3657                      .dwattr DW$T$86, DW_AT_byte_size(0x01)
    3658              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3659                      .dwattr DW$320, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3660                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3661                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3662              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$85)
    3663                      .dwattr DW$321, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3664                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3665                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3666                      .dwendtag DW$T$86
    3667              
    3668              
    3669              DW$T$88 .dwtag  DW_TAG_union_type
    3670                      .dwattr DW$T$88, DW_AT_name("GPDDAT_REG")
    3671                      .dwattr DW$T$88, DW_AT_byte_size(0x01)
    3672              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3673                      .dwattr DW$322, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3674                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3675                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3676              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$87)
    3677                      .dwattr DW$323, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3678                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3679                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3680                      .dwendtag DW$T$88
    3681              
    3682              
    3683              DW$T$90 .dwtag  DW_TAG_union_type
    3684                      .dwattr DW$T$90, DW_AT_name("GPDSET_REG")
    3685                      .dwattr DW$T$90, DW_AT_byte_size(0x01)
    3686              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3687                      .dwattr DW$324, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3688                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3689                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3690              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   72

    3691                      .dwattr DW$325, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3692                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3693                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3694                      .dwendtag DW$T$90
    3695              
    3696              
    3697              DW$T$92 .dwtag  DW_TAG_union_type
    3698                      .dwattr DW$T$92, DW_AT_name("GPDCLEAR_REG")
    3699                      .dwattr DW$T$92, DW_AT_byte_size(0x01)
    3700              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3701                      .dwattr DW$326, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3702                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3703                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3704              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$91)
    3705                      .dwattr DW$327, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3706                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3707                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3708                      .dwendtag DW$T$92
    3709              
    3710              
    3711              DW$T$94 .dwtag  DW_TAG_union_type
    3712                      .dwattr DW$T$94, DW_AT_name("GPDTOGGLE_REG")
    3713                      .dwattr DW$T$94, DW_AT_byte_size(0x01)
    3714              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3715                      .dwattr DW$328, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3716                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3717                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3718              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$93)
    3719                      .dwattr DW$329, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3720                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3721                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3722                      .dwendtag DW$T$94
    3723              
    3724              
    3725              DW$T$96 .dwtag  DW_TAG_union_type
    3726                      .dwattr DW$T$96, DW_AT_name("GPEDAT_REG")
    3727                      .dwattr DW$T$96, DW_AT_byte_size(0x01)
    3728              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3729                      .dwattr DW$330, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3730                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3731                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3732              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    3733                      .dwattr DW$331, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3734                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3735                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3736                      .dwendtag DW$T$96
    3737              
    3738              
    3739              DW$T$98 .dwtag  DW_TAG_union_type
    3740                      .dwattr DW$T$98, DW_AT_name("GPESET_REG")
    3741                      .dwattr DW$T$98, DW_AT_byte_size(0x01)
    3742              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3743                      .dwattr DW$332, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3744                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3745                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   73

    3746              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    3747                      .dwattr DW$333, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3748                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3749                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3750                      .dwendtag DW$T$98
    3751              
    3752              
    3753              DW$T$100        .dwtag  DW_TAG_union_type
    3754                      .dwattr DW$T$100, DW_AT_name("GPECLEAR_REG")
    3755                      .dwattr DW$T$100, DW_AT_byte_size(0x01)
    3756              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3757                      .dwattr DW$334, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3758                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3759                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3760              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3761                      .dwattr DW$335, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3762                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3763                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3764                      .dwendtag DW$T$100
    3765              
    3766              
    3767              DW$T$102        .dwtag  DW_TAG_union_type
    3768                      .dwattr DW$T$102, DW_AT_name("GPETOGGLE_REG")
    3769                      .dwattr DW$T$102, DW_AT_byte_size(0x01)
    3770              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3771                      .dwattr DW$336, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3772                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3773                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3774              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
    3775                      .dwattr DW$337, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3776                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3777                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3778                      .dwendtag DW$T$102
    3779              
    3780              
    3781              DW$T$104        .dwtag  DW_TAG_union_type
    3782                      .dwattr DW$T$104, DW_AT_name("GPFDAT_REG")
    3783                      .dwattr DW$T$104, DW_AT_byte_size(0x01)
    3784              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3785                      .dwattr DW$338, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3786                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3787                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3788              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
    3789                      .dwattr DW$339, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3790                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3791                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3792                      .dwendtag DW$T$104
    3793              
    3794              
    3795              DW$T$106        .dwtag  DW_TAG_union_type
    3796                      .dwattr DW$T$106, DW_AT_name("GPFSET_REG")
    3797                      .dwattr DW$T$106, DW_AT_byte_size(0x01)
    3798              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3799                      .dwattr DW$340, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3800                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   74

    3801                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3802              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$105)
    3803                      .dwattr DW$341, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3804                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3805                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3806                      .dwendtag DW$T$106
    3807              
    3808              
    3809              DW$T$108        .dwtag  DW_TAG_union_type
    3810                      .dwattr DW$T$108, DW_AT_name("GPFCLEAR_REG")
    3811                      .dwattr DW$T$108, DW_AT_byte_size(0x01)
    3812              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3813                      .dwattr DW$342, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3814                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3815                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3816              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3817                      .dwattr DW$343, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3818                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3819                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3820                      .dwendtag DW$T$108
    3821              
    3822              
    3823              DW$T$110        .dwtag  DW_TAG_union_type
    3824                      .dwattr DW$T$110, DW_AT_name("GPFTOGGLE_REG")
    3825                      .dwattr DW$T$110, DW_AT_byte_size(0x01)
    3826              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3827                      .dwattr DW$344, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3828                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3829                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3830              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$109)
    3831                      .dwattr DW$345, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3832                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3833                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3834                      .dwendtag DW$T$110
    3835              
    3836              
    3837              DW$T$112        .dwtag  DW_TAG_union_type
    3838                      .dwattr DW$T$112, DW_AT_name("GPGDAT_REG")
    3839                      .dwattr DW$T$112, DW_AT_byte_size(0x01)
    3840              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3841                      .dwattr DW$346, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3842                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3843                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3844              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$111)
    3845                      .dwattr DW$347, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3846                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3847                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3848                      .dwendtag DW$T$112
    3849              
    3850              
    3851              DW$T$114        .dwtag  DW_TAG_union_type
    3852                      .dwattr DW$T$114, DW_AT_name("GPGSET_REG")
    3853                      .dwattr DW$T$114, DW_AT_byte_size(0x01)
    3854              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3855                      .dwattr DW$348, DW_AT_name("all"), DW_AT_symbol_name("_all")
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   75

    3856                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3857                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3858              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$113)
    3859                      .dwattr DW$349, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3860                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3861                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3862                      .dwendtag DW$T$114
    3863              
    3864              
    3865              DW$T$116        .dwtag  DW_TAG_union_type
    3866                      .dwattr DW$T$116, DW_AT_name("GPGCLEAR_REG")
    3867                      .dwattr DW$T$116, DW_AT_byte_size(0x01)
    3868              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3869                      .dwattr DW$350, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3870                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3871                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3872              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$115)
    3873                      .dwattr DW$351, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3874                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3875                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3876                      .dwendtag DW$T$116
    3877              
    3878              
    3879              DW$T$118        .dwtag  DW_TAG_union_type
    3880                      .dwattr DW$T$118, DW_AT_name("GPGTOGGLE_REG")
    3881                      .dwattr DW$T$118, DW_AT_byte_size(0x01)
    3882              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3883                      .dwattr DW$352, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3884                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3885                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3886              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3887                      .dwattr DW$353, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3888                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3889                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3890                      .dwendtag DW$T$118
    3891              
    3892              
    3893              DW$T$20 .dwtag  DW_TAG_structure_type
    3894                      .dwattr DW$T$20, DW_AT_name("SPICCR_BITS")
    3895                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    3896              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3897                      .dwattr DW$354, DW_AT_name("SPICHAR"), DW_AT_symbol_name("_SPICHAR")
    3898                      .dwattr DW$354, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    3899                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3900                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3901              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3902                      .dwattr DW$355, DW_AT_name("SPILBK"), DW_AT_symbol_name("_SPILBK")
    3903                      .dwattr DW$355, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3904                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3905                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3906              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3907                      .dwattr DW$356, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3908                      .dwattr DW$356, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3909                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3910                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   76

    3911              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3912                      .dwattr DW$357, DW_AT_name("CLKPOLARITY"), DW_AT_symbol_name("_CLKPOLARITY")
    3913                      .dwattr DW$357, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3914                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3915                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3916              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3917                      .dwattr DW$358, DW_AT_name("SPISWRESET"), DW_AT_symbol_name("_SPISWRESET")
    3918                      .dwattr DW$358, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3919                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3920                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3921              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3922                      .dwattr DW$359, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3923                      .dwattr DW$359, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    3924                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3925                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3926                      .dwendtag DW$T$20
    3927              
    3928              
    3929              DW$T$22 .dwtag  DW_TAG_structure_type
    3930                      .dwattr DW$T$22, DW_AT_name("SPICTL_BITS")
    3931                      .dwattr DW$T$22, DW_AT_byte_size(0x01)
    3932              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3933                      .dwattr DW$360, DW_AT_name("SPIINTENA"), DW_AT_symbol_name("_SPIINTENA")
    3934                      .dwattr DW$360, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3935                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3936                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3937              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3938                      .dwattr DW$361, DW_AT_name("TALK"), DW_AT_symbol_name("_TALK")
    3939                      .dwattr DW$361, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3940                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3941                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3942              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3943                      .dwattr DW$362, DW_AT_name("MASTER_SLAVE"), DW_AT_symbol_name("_MASTER_SLAVE")
    3944                      .dwattr DW$362, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3945                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3946                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3947              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3948                      .dwattr DW$363, DW_AT_name("CLK_PHASE"), DW_AT_symbol_name("_CLK_PHASE")
    3949                      .dwattr DW$363, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3950                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3951                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3952              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3953                      .dwattr DW$364, DW_AT_name("OVERRUNINTENA"), DW_AT_symbol_name("_OVERRUNINTENA")
    3954                      .dwattr DW$364, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3955                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3956                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3957              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3958                      .dwattr DW$365, DW_AT_name("rsvd"), DW_AT_symbol_name("_rsvd")
    3959                      .dwattr DW$365, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0b)
    3960                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3961                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3962                      .dwendtag DW$T$22
    3963              
    3964              
    3965              DW$T$24 .dwtag  DW_TAG_structure_type
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   77

    3966                      .dwattr DW$T$24, DW_AT_name("SPISTS_BITS")
    3967                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
    3968              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3969                      .dwattr DW$366, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3970                      .dwattr DW$366, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    3971                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3972                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3973              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3974                      .dwattr DW$367, DW_AT_name("BUFFULL_FLAG"), DW_AT_symbol_name("_BUFFULL_FLAG")
    3975                      .dwattr DW$367, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3976                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3977                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3978              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3979                      .dwattr DW$368, DW_AT_name("INT_FLAG"), DW_AT_symbol_name("_INT_FLAG")
    3980                      .dwattr DW$368, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3981                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3982                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3983              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3984                      .dwattr DW$369, DW_AT_name("OVERRUN_FLAG"), DW_AT_symbol_name("_OVERRUN_FLAG")
    3985                      .dwattr DW$369, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3986                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3987                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3988              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3989                      .dwattr DW$370, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3990                      .dwattr DW$370, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    3991                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3992                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3993                      .dwendtag DW$T$24
    3994              
    3995              
    3996              DW$T$26 .dwtag  DW_TAG_structure_type
    3997                      .dwattr DW$T$26, DW_AT_name("SPIFFTX_BITS")
    3998                      .dwattr DW$T$26, DW_AT_byte_size(0x01)
    3999              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4000                      .dwattr DW$371, DW_AT_name("TXFFIL"), DW_AT_symbol_name("_TXFFIL")
    4001                      .dwattr DW$371, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    4002                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4003                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4004              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4005                      .dwattr DW$372, DW_AT_name("TXFFIENA"), DW_AT_symbol_name("_TXFFIENA")
    4006                      .dwattr DW$372, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4007                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4008                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4009              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4010                      .dwattr DW$373, DW_AT_name("TXFFINTCLR"), DW_AT_symbol_name("_TXFFINTCLR")
    4011                      .dwattr DW$373, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4012                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4013                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4014              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4015                      .dwattr DW$374, DW_AT_name("TXFFINT"), DW_AT_symbol_name("_TXFFINT")
    4016                      .dwattr DW$374, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4017                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4018                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4019              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4020                      .dwattr DW$375, DW_AT_name("TXFFST"), DW_AT_symbol_name("_TXFFST")
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   78

    4021                      .dwattr DW$375, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    4022                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4023                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4024              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4025                      .dwattr DW$376, DW_AT_name("TXFIFO"), DW_AT_symbol_name("_TXFIFO")
    4026                      .dwattr DW$376, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4027                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4028                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4029              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4030                      .dwattr DW$377, DW_AT_name("SPIFFENA"), DW_AT_symbol_name("_SPIFFENA")
    4031                      .dwattr DW$377, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4032                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4033                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4034              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4035                      .dwattr DW$378, DW_AT_name("SPIRST"), DW_AT_symbol_name("_SPIRST")
    4036                      .dwattr DW$378, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4037                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4038                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4039                      .dwendtag DW$T$26
    4040              
    4041              
    4042              DW$T$28 .dwtag  DW_TAG_structure_type
    4043                      .dwattr DW$T$28, DW_AT_name("SPIFFRX_BITS")
    4044                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
    4045              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4046                      .dwattr DW$379, DW_AT_name("RXFFIL"), DW_AT_symbol_name("_RXFFIL")
    4047                      .dwattr DW$379, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    4048                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4049                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4050              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4051                      .dwattr DW$380, DW_AT_name("RXFFIENA"), DW_AT_symbol_name("_RXFFIENA")
    4052                      .dwattr DW$380, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4053                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4054                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4055              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4056                      .dwattr DW$381, DW_AT_name("RXFFINTCLR"), DW_AT_symbol_name("_RXFFINTCLR")
    4057                      .dwattr DW$381, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4058                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4059                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4060              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4061                      .dwattr DW$382, DW_AT_name("RXFFINT"), DW_AT_symbol_name("_RXFFINT")
    4062                      .dwattr DW$382, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4063                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4064                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4065              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4066                      .dwattr DW$383, DW_AT_name("RXFFST"), DW_AT_symbol_name("_RXFFST")
    4067                      .dwattr DW$383, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    4068                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4069                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4070              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4071                      .dwattr DW$384, DW_AT_name("RXFIFORESET"), DW_AT_symbol_name("_RXFIFORESET")
    4072                      .dwattr DW$384, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4073                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4074                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4075              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:06:01 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9962                            PAGE   79

    4076                      .dwattr DW$385, DW_AT_name("RXFFOVFCLR"), DW_AT_symbol_name("_RXFFOVFCLR")
    4077                      .dwattr DW$385, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4078                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4079                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4080              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4081                      .dwattr DW$386, DW_AT_name("RXFFOVF"), DW_AT_symbol_name("_RXFFOVF")
    4082                      .dwattr DW$386, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4083                      .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4084                      .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4085                      .dwendtag DW$T$28
    4086              
    4087              
    4088              DW$T$30 .dwtag  DW_TAG_structure_type
    4089                      .dwattr DW$T$30, DW_AT_name("SPIFFCT_BITS")
    4090                      .dwattr DW$T$30, DW_AT_byte_size(0x01)
    4091              DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4092                      .dwattr DW$387, DW_AT_name("TXDLY"), DW_AT_symbol_name("_TXDLY")
    4093                      .dwattr DW$387, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    4094                      .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4095                      .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4096              DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4097                      .dwattr DW$388, DW_AT_name("rsvd"), DW_AT_symbol_name("_rsvd")
    4098                      .dwattr DW$388, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4099                      .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
