TMS320C2000 COFF Assembler PC v4.1.3 Tue Oct 18 11:23:44 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2202                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Tue Oct 18 11:23:44 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_USBmod_interface.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

     767              DW$82   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$42)
     768                      .dwendtag DW$T$54
     769              
     770              
     771              DW$T$56 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$53)
     772                      .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
     773              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     774                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     775                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     776              
     777              DW$T$57 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     778                      .dwattr DW$T$57, DW_AT_language(DW_LANG_C)
     779              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     780                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     781                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Oct 18 11:23:44 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2202                            PAGE   20

     782              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
     783                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     784              DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
     785                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
     786              
     787              DW$T$59 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$28)
     788                      .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
     789                      .dwattr DW$T$59, DW_AT_byte_size(0x04)
     790              DW$83   .dwtag  DW_TAG_subrange_type
     791                      .dwattr DW$83, DW_AT_upper_bound(0x01)
     792                      .dwendtag DW$T$59
     793              
     794              
     795              DW$T$60 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$28)
     796                      .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
     797                      .dwattr DW$T$60, DW_AT_byte_size(0x18)
     798              DW$84   .dwtag  DW_TAG_subrange_type
     799                      .dwattr DW$84, DW_AT_upper_bound(0x05)
     800              DW$85   .dwtag  DW_TAG_subrange_type
     801                      .dwattr DW$85, DW_AT_upper_bound(0x01)
     802                      .dwendtag DW$T$60
     803              
     804              DW$T$42 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
     805                      .dwattr DW$T$42, DW_AT_address_class(0x16)
     806              DW$T$39 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
     807                      .dwattr DW$T$39, DW_AT_address_class(0x16)
     808              
     809              DW$T$70 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$39)
     810                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
     811              
     812              DW$T$72 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$39)
     813                      .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
     814              DW$86   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     815              DW$87   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     816              DW$88   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     817              DW$89   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     818              DW$90   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     819              DW$91   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$39)
     820                      .dwendtag DW$T$72
     821              
     822              
     823              DW$T$74 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$39)
     824                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
     825              DW$92   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     826              DW$93   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     827              DW$94   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     828              DW$95   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     829              DW$96   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$42)
     830              DW$97   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     831              DW$98   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$39)
     832                      .dwendtag DW$T$74
     833              
     834              DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     835                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
     836                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Oct 18 11:23:44 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2202                            PAGE   21

     837              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
     838                      .dwattr DW$T$28, DW_AT_address_class(0x16)
     839              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$32)
     840                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     841              DW$99   .dwtag  DW_TAG_far_type
     842                      .dwattr DW$99, DW_AT_type(*DW$T$25)
     843              DW$T$27 .dwtag  DW_TAG_const_type
     844                      .dwattr DW$T$27, DW_AT_type(*DW$99)
     845              
     846              DW$T$32 .dwtag  DW_TAG_structure_type
     847                      .dwattr DW$T$32, DW_AT_name("hwin")
     848                      .dwattr DW$T$32, DW_AT_byte_size(0x42)
     849              DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     850                      .dwattr DW$100, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
     851                      .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     852                      .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
     853              DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     854                      .dwattr DW$101, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
     855                      .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     856                      .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
     857              DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     858                      .dwattr DW$102, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
     859                      .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     860                      .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
     861              DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     862                      .dwattr DW$103, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
     863                      .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     864                      .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
     865              DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     866                      .dwattr DW$104, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
     867                      .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     868                      .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
     869              DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     870                      .dwattr DW$105, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
     871                      .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     872                      .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
     873              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     874                      .dwattr DW$106, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
     875                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     876                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
     877              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     878                      .dwattr DW$107, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
     879                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     880                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
     881              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     882                      .dwattr DW$108, DW_AT_name("type"), DW_AT_symbol_name("_type")
     883                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     884                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
     885              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     886                      .dwattr DW$109, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
     887                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     888                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
     889              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     890                      .dwattr DW$110, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
     891                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 COFF Assembler PC v4.1.3 Tue Oct 18 11:23:44 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2202                            PAGE   22

     892                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
     893              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     894                      .dwattr DW$111, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
     895                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     896                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
     897              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     898                      .dwattr DW$112, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
     899                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     900                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
     901              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     902                      .dwattr DW$113, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
     903                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     904                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
     905              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     906                      .dwattr DW$114, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
     907                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     908                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
     909              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     910                      .dwattr DW$115, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
     911                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     912                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
     913              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     914                      .dwattr DW$116, DW_AT_name("button_icon"), DW_AT_symbol_name("_button_icon")
     915                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     916                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
     917              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     918                      .dwattr DW$117, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
     919                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     920                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
     921              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     922                      .dwattr DW$118, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
     923                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
     924                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
     925              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     926                      .dwattr DW$119, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
     927                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     928                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
     929              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
     930                      .dwattr DW$120, DW_AT_name("drop_list_is_start"), DW_AT_symbol_name("_drop_list_is_start")
     931                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     932                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
     933              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
     934                      .dwattr DW$121, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
     935                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     936                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
     937              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
     938                      .dwattr DW$122, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
     939                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     940                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
     941              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
     942                      .dwattr DW$123, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
     943                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
     944                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
     945              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     946                      .dwattr DW$124, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Oct 18 11:23:44 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2202                            PAGE   23

     947                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     948                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
     949                      .dwendtag DW$T$32
     950              
     951              DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
     952                      .dwattr DW$T$22, DW_AT_address_class(0x16)
     953              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
     954                      .dwattr DW$T$30, DW_AT_address_class(0x16)
     955              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
     956                      .dwattr DW$T$24, DW_AT_address_class(0x16)
     957              
     958              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
     959                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
     960                      .dwattr DW$T$26, DW_AT_byte_size(0x1e)
     961              DW$125  .dwtag  DW_TAG_subrange_type
     962                      .dwattr DW$125, DW_AT_upper_bound(0x1d)
     963                      .dwendtag DW$T$26
     964              
     965              DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
     966                      .dwattr DW$T$31, DW_AT_address_class(0x16)
     967              
     968              DW$T$29 .dwtag  DW_TAG_subroutine_type
     969                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
     970              DW$126  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     971                      .dwendtag DW$T$29
     972              
     973              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$21)
     974                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     975              DW$T$3  .dwtag  DW_TAG_pointer_type
     976                      .dwattr DW$T$3, DW_AT_address_class(0x16)
     977              
     978              DW$T$21 .dwtag  DW_TAG_structure_type
     979                      .dwattr DW$T$21, DW_AT_name("edit_mem")
     980                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
     981              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     982                      .dwattr DW$127, DW_AT_name("x"), DW_AT_symbol_name("_x")
     983                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     984                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
     985              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     986                      .dwattr DW$128, DW_AT_name("y"), DW_AT_symbol_name("_y")
     987                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     988                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
     989              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     990                      .dwattr DW$129, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
     991                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     992                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
     993              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     994                      .dwattr DW$130, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
     995                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     996                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
     997              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     998                      .dwattr DW$131, DW_AT_name("id"), DW_AT_symbol_name("_id")
     999                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1000                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1001              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Oct 18 11:23:44 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2202                            PAGE   24

    1002                      .dwattr DW$132, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    1003                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1004                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1005              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1006                      .dwattr DW$133, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    1007                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1008                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1009                      .dwendtag DW$T$21
    1010              
    1011              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
    1012                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    1013              
    1014                      .dwattr DW$55, DW_AT_external(0x01)
    1015                      .dwattr DW$55, DW_AT_type(*DW$T$53)
    1016                      .dwattr DW$49, DW_AT_external(0x01)
    1017                      .dwattr DW$54, DW_AT_external(0x01)
    1018                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1019              
    1020              ;***************************************************************
    1021              ;* DWARF CIE ENTRIES                                           *
    1022              ;***************************************************************
    1023              
    1024              DW$CIE  .dwcie 1, 40
    1025                      .dwcfa  0x0c, 20, 0
    1026                      .dwcfa  0x07, 0
    1027                      .dwcfa  0x07, 1
    1028                      .dwcfa  0x07, 2
    1029                      .dwcfa  0x07, 3
    1030                      .dwcfa  0x07, 4
    1031                      .dwcfa  0x07, 5
    1032                      .dwcfa  0x08, 6
    1033                      .dwcfa  0x08, 7
    1034                      .dwcfa  0x08, 8
    1035                      .dwcfa  0x08, 9
    1036                      .dwcfa  0x08, 10
    1037                      .dwcfa  0x08, 11
    1038                      .dwcfa  0x07, 12
    1039                      .dwcfa  0x07, 13
    1040                      .dwcfa  0x07, 14
    1041                      .dwcfa  0x07, 15
    1042                      .dwcfa  0x07, 16
    1043                      .dwcfa  0x07, 17
    1044                      .dwcfa  0x07, 18
    1045                      .dwcfa  0x07, 19
    1046                      .dwcfa  0x07, 20
    1047                      .dwcfa  0x07, 21
    1048                      .dwcfa  0x07, 22
    1049                      .dwcfa  0x07, 23
    1050                      .dwcfa  0x07, 24
    1051                      .dwcfa  0x07, 25
    1052                      .dwcfa  0x07, 26
    1053                      .dwcfa  0x08, 27
    1054                      .dwcfa  0x07, 28
    1055                      .dwcfa  0x07, 29
    1056                      .dwcfa  0x07, 30
TMS320C2000 COFF Assembler PC v4.1.3 Tue Oct 18 11:23:44 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2202                            PAGE   25

    1057                      .dwcfa  0x07, 31
    1058                      .dwcfa  0x07, 32
    1059                      .dwcfa  0x07, 33
    1060                      .dwcfa  0x07, 34
    1061                      .dwcfa  0x07, 35
    1062                      .dwcfa  0x07, 36
    1063                      .dwcfa  0x07, 37
    1064                      .dwcfa  0x07, 38
    1065                      .dwcfa  0x07, 39
    1066                      .dwcfa  0x07, 40
    1067              
    1068              ;***************************************************************
    1069              ;* DWARF REGISTER MAP                                          *
    1070              ;***************************************************************
    1071              
    1072              DW$134  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    1073                      .dwattr DW$134, DW_AT_location[DW_OP_reg0]
    1074              DW$135  .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
    1075                      .dwattr DW$135, DW_AT_location[DW_OP_reg1]
    1076              DW$136  .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
