TMS320C2000 COFF Assembler PC v4.1.3 Thu Oct 20 16:55:55 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0442                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Oct 20 16:55:55 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_USBmod_fun.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

     509                      .dwendtag DW$T$24
     510              
     511              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
     512                      .dwattr DW$T$25, DW_AT_address_class(0x16)
     513              
     514              DW$T$26 .dwtag  DW_TAG_subroutine_type
     515                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
     516              DW$53   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     517                      .dwendtag DW$T$26
     518              
     519              
     520              DW$T$30 .dwtag  DW_TAG_subroutine_type
     521                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     522              DW$54   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
     523                      .dwendtag DW$T$30
     524              
     525              
     526              DW$T$32 .dwtag  DW_TAG_subroutine_type
     527                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
     528              
     529              DW$T$34 .dwtag  DW_TAG_subroutine_type
     530                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     531              DW$55   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     532                      .dwendtag DW$T$34
     533              
     534              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     535                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     536                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
     537              DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
     538                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
     539              
     540              DW$T$37 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$36)
     541                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
     542              DW$56   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
     543                      .dwendtag DW$T$37
     544              
     545              
     546              DW$T$39 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     547                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     548              DW$57   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
     549              DW$58   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     550                      .dwendtag DW$T$39
     551              
     552              
     553              DW$T$41 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     554                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
     555              DW$59   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     556              DW$60   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
     557                      .dwendtag DW$T$41
     558              
     559              
     560              DW$T$43 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Oct 20 16:55:55 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0442                            PAGE   12

     561                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
     562              DW$61   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     563                      .dwendtag DW$T$43
     564              
     565              DW$T$45 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
     566                      .dwattr DW$T$45, DW_AT_address_class(0x16)
     567              
     568              DW$T$46 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     569                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
     570              DW$62   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$45)
     571              DW$63   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     572                      .dwendtag DW$T$46
     573              
     574              DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$6)
     575                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
     576              
     577              DW$T$49 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$48)
     578                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
     579              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     580                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     581                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     582              
     583              DW$T$51 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     584                      .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
     585              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
     586                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     587              DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
     588                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
     589              DW$T$53 .dwtag  DW_TAG_typedef, DW_AT_name("module_id_t"), DW_AT_type(*DW$T$20)
     590                      .dwattr DW$T$53, DW_AT_language(DW_LANG_C)
     591              DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
     592                      .dwattr DW$T$29, DW_AT_address_class(0x16)
     593              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     594                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     595                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     596              
     597              DW$T$20 .dwtag  DW_TAG_structure_type
     598                      .dwattr DW$T$20, DW_AT_byte_size(0x11)
     599              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     600                      .dwattr DW$64, DW_AT_name("DL_measure_mod_id"), DW_AT_symbol_name("_DL_measure_mod_id")
     601                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     603              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     604                      .dwattr DW$65, DW_AT_name("Sys_setup_mod_id"), DW_AT_symbol_name("_Sys_setup_mod_id")
     605                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     606                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     607              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     608                      .dwattr DW$66, DW_AT_name("USB_mod_id"), DW_AT_symbol_name("_USB_mod_id")
     609                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     610                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     611              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     612                      .dwattr DW$67, DW_AT_name("RM_mod_id"), DW_AT_symbol_name("_RM_mod_id")
     613                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     614                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     615              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Oct 20 16:55:55 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0442                            PAGE   13

     616                      .dwattr DW$68, DW_AT_name("PC_mod_id"), DW_AT_symbol_name("_PC_mod_id")
     617                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     618                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     619              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     620                      .dwattr DW$69, DW_AT_name("Help_mod_id"), DW_AT_symbol_name("_Help_mod_id")
     621                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     622                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     623              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     624                      .dwattr DW$70, DW_AT_name("HZ_input_mod_id"), DW_AT_symbol_name("_HZ_input_mod_id")
     625                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     626                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     627              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     628                      .dwattr DW$71, DW_AT_name("Err_correct_mod_id"), DW_AT_symbol_name("_Err_correct_mod_id")
     629                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     630                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     631              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     632                      .dwattr DW$72, DW_AT_name("Wave_mod_id"), DW_AT_symbol_name("_Wave_mod_id")
     633                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     634                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     635              DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     636                      .dwattr DW$73, DW_AT_name("USER_mod_id"), DW_AT_symbol_name("_USER_mod_id")
     637                      .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     638                      .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     639              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     640                      .dwattr DW$74, DW_AT_name("COMR_mod_id"), DW_AT_symbol_name("_COMR_mod_id")
     641                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     642                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     643              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     644                      .dwattr DW$75, DW_AT_name("WIR_mod_id"), DW_AT_symbol_name("_WIR_mod_id")
     645                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     646                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     647              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     648                      .dwattr DW$76, DW_AT_name("BB_mod_id"), DW_AT_symbol_name("_BB_mod_id")
     649                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     650                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     651              DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     652                      .dwattr DW$77, DW_AT_name("test_mod_id"), DW_AT_symbol_name("_test_mod_id")
     653                      .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     654                      .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     655              DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     656                      .dwattr DW$78, DW_AT_name("SZGL_mod_id"), DW_AT_symbol_name("_SZGL_mod_id")
     657                      .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     658                      .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     659              DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     660                      .dwattr DW$79, DW_AT_name("Iout_mod_id"), DW_AT_symbol_name("_Iout_mod_id")
     661                      .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     662                      .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     663              DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     664                      .dwattr DW$80, DW_AT_name("start_mod_id"), DW_AT_symbol_name("_start_mod_id")
     665                      .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     666                      .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
     667                      .dwendtag DW$T$20
     668              
     669              DW$T$28 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     670                      .dwattr DW$T$28, DW_AT_encoding(DW_ATE_signed_char)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Oct 20 16:55:55 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0442                            PAGE   14

     671                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
     672              
     673                      .dwattr DW$49, DW_AT_external(0x01)
     674                      .dwattr DW$50, DW_AT_external(0x01)
     675                      .dwattr DW$27, DW_AT_external(0x01)
     676                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     677              
     678              ;***************************************************************
     679              ;* DWARF CIE ENTRIES                                           *
     680              ;***************************************************************
     681              
     682              DW$CIE  .dwcie 1, 40
     683                      .dwcfa  0x0c, 20, 0
     684                      .dwcfa  0x07, 0
     685                      .dwcfa  0x07, 1
     686                      .dwcfa  0x07, 2
     687                      .dwcfa  0x07, 3
     688                      .dwcfa  0x07, 4
     689                      .dwcfa  0x07, 5
     690                      .dwcfa  0x08, 6
     691                      .dwcfa  0x08, 7
     692                      .dwcfa  0x08, 8
     693                      .dwcfa  0x08, 9
     694                      .dwcfa  0x08, 10
     695                      .dwcfa  0x08, 11
     696                      .dwcfa  0x07, 12
     697                      .dwcfa  0x07, 13
     698                      .dwcfa  0x07, 14
     699                      .dwcfa  0x07, 15
     700                      .dwcfa  0x07, 16
     701                      .dwcfa  0x07, 17
     702                      .dwcfa  0x07, 18
     703                      .dwcfa  0x07, 19
     704                      .dwcfa  0x07, 20
     705                      .dwcfa  0x07, 21
     706                      .dwcfa  0x07, 22
     707                      .dwcfa  0x07, 23
     708                      .dwcfa  0x07, 24
     709                      .dwcfa  0x07, 25
     710                      .dwcfa  0x07, 26
     711                      .dwcfa  0x08, 27
     712                      .dwcfa  0x07, 28
     713                      .dwcfa  0x07, 29
     714                      .dwcfa  0x07, 30
     715                      .dwcfa  0x07, 31
     716                      .dwcfa  0x07, 32
     717                      .dwcfa  0x07, 33
     718                      .dwcfa  0x07, 34
     719                      .dwcfa  0x07, 35
     720                      .dwcfa  0x07, 36
     721                      .dwcfa  0x07, 37
     722                      .dwcfa  0x07, 38
     723                      .dwcfa  0x07, 39
     724                      .dwcfa  0x07, 40
     725              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Oct 20 16:55:55 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0442                            PAGE   15

     726              ;***************************************************************
     727              ;* DWARF REGISTER MAP                                          *
     728              ;***************************************************************
     729              
     730              DW$81   .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
     731                      .dwattr DW$81, DW_AT_location[DW_OP_reg0]
     732              DW$82   .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
