TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 22 14:29:47 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7682                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sat Oct 22 14:29:47 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_USBmod_hzlib_updata.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    1780                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    1781              DW$T$12 .dwtag  DW_TAG_base_type, DW_AT_name("long")
    1782                      .dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1783                      .dwattr DW$T$12, DW_AT_byte_size(0x02)
    1784              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    1785                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1786                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    1787              DW$T$73 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$13)
    1788                      .dwattr DW$T$73, DW_AT_address_class(0x16)
    1789              
    1790              DW$T$76 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$28)
    1791                      .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
    1792                      .dwattr DW$T$76, DW_AT_byte_size(0x04)
    1793              DW$169  .dwtag  DW_TAG_subrange_type
    1794                      .dwattr DW$169, DW_AT_upper_bound(0x01)
    1795                      .dwendtag DW$T$76
    1796              
    1797              
    1798              DW$T$77 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$27)
    1799                      .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
    1800                      .dwattr DW$T$77, DW_AT_byte_size(0x0b)
    1801              DW$170  .dwtag  DW_TAG_subrange_type
    1802                      .dwattr DW$170, DW_AT_upper_bound(0x0a)
    1803                      .dwendtag DW$T$77
    1804              
    1805              DW$T$43 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 22 14:29:47 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7682                            PAGE   43

    1806                      .dwattr DW$T$43, DW_AT_address_class(0x16)
    1807              
    1808              DW$T$80 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    1809                      .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    1810                      .dwattr DW$T$80, DW_AT_byte_size(0x0b)
    1811              DW$171  .dwtag  DW_TAG_subrange_type
    1812                      .dwattr DW$171, DW_AT_upper_bound(0x0a)
    1813                      .dwendtag DW$T$80
    1814              
    1815              DW$T$49 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$48)
    1816                      .dwattr DW$T$49, DW_AT_address_class(0x16)
    1817              
    1818              DW$T$86 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$49)
    1819                      .dwattr DW$T$86, DW_AT_language(DW_LANG_C)
    1820              
    1821              DW$T$88 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$49)
    1822                      .dwattr DW$T$88, DW_AT_language(DW_LANG_C)
    1823              DW$172  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1824              DW$173  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1825              DW$174  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1826              DW$175  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1827              DW$176  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1828              DW$177  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$49)
    1829                      .dwendtag DW$T$88
    1830              
    1831              
    1832              DW$T$90 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$49)
    1833                      .dwattr DW$T$90, DW_AT_language(DW_LANG_C)
    1834              DW$178  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1835              DW$179  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1836              DW$180  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1837              DW$181  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1838              DW$182  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$43)
    1839              DW$183  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1840              DW$184  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$49)
    1841                      .dwendtag DW$T$90
    1842              
    1843              DW$T$92 .dwtag  DW_TAG_typedef, DW_AT_name("MB_member_t"), DW_AT_type(*DW$T$35)
    1844                      .dwattr DW$T$92, DW_AT_language(DW_LANG_C)
    1845              DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$6)
    1846                      .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    1847              DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1848                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
    1849                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    1850              DW$185  .dwtag  DW_TAG_far_type
    1851                      .dwattr DW$185, DW_AT_type(*DW$T$25)
    1852              DW$T$27 .dwtag  DW_TAG_const_type
    1853                      .dwattr DW$T$27, DW_AT_type(*DW$185)
    1854              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
    1855                      .dwattr DW$T$28, DW_AT_address_class(0x16)
    1856              DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$32)
    1857                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
    1858              
    1859              DW$T$35 .dwtag  DW_TAG_structure_type
    1860                      .dwattr DW$T$35, DW_AT_byte_size(0x13)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 22 14:29:47 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7682                            PAGE   44

    1861              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    1862                      .dwattr DW$186, DW_AT_name("offset"), DW_AT_symbol_name("_offset")
    1863                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1864                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1865              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    1866                      .dwattr DW$187, DW_AT_name("addr"), DW_AT_symbol_name("_addr")
    1867                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1868                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1869              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    1870                      .dwattr DW$188, DW_AT_name("size"), DW_AT_symbol_name("_size")
    1871                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1872                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1873                      .dwendtag DW$T$35
    1874              
    1875              
    1876              DW$T$33 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    1877                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    1878                      .dwattr DW$T$33, DW_AT_byte_size(0x05)
    1879              DW$189  .dwtag  DW_TAG_subrange_type
    1880                      .dwattr DW$189, DW_AT_upper_bound(0x04)
    1881                      .dwendtag DW$T$33
    1882              
    1883              
    1884              DW$T$34 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    1885                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    1886                      .dwattr DW$T$34, DW_AT_byte_size(0x09)
    1887              DW$190  .dwtag  DW_TAG_subrange_type
    1888                      .dwattr DW$190, DW_AT_upper_bound(0x08)
    1889                      .dwendtag DW$T$34
    1890              
    1891              
    1892              DW$T$32 .dwtag  DW_TAG_structure_type
    1893                      .dwattr DW$T$32, DW_AT_name("hwin")
    1894                      .dwattr DW$T$32, DW_AT_byte_size(0x42)
    1895              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1896                      .dwattr DW$191, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    1897                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1899              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1900                      .dwattr DW$192, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    1901                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1902                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1903              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1904                      .dwattr DW$193, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    1905                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1906                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1907              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1908                      .dwattr DW$194, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    1909                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1910                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1911              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1912                      .dwattr DW$195, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    1913                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1914                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1915              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 22 14:29:47 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7682                            PAGE   45

    1916                      .dwattr DW$196, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    1917                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1918                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1919              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1920                      .dwattr DW$197, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    1921                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1922                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1923              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1924                      .dwattr DW$198, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    1925                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1926                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1927              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1928                      .dwattr DW$199, DW_AT_name("type"), DW_AT_symbol_name("_type")
    1929                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1930                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1931              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1932                      .dwattr DW$200, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    1933                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1934                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1935              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1936                      .dwattr DW$201, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    1937                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1938                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1939              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1940                      .dwattr DW$202, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
    1941                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1942                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1943              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1944                      .dwattr DW$203, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    1945                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1946                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1947              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1948                      .dwattr DW$204, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    1949                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1950                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1951              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1952                      .dwattr DW$205, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    1953                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1954                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1955              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1956                      .dwattr DW$206, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
    1957                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1958                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1959              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1960                      .dwattr DW$207, DW_AT_name("button_icon"), DW_AT_symbol_name("_button_icon")
    1961                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1962                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1963              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1964                      .dwattr DW$208, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
    1965                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1966                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1967              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1968                      .dwattr DW$209, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
    1969                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1970                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 22 14:29:47 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7682                            PAGE   46

    1971              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1972                      .dwattr DW$210, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
    1973                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1974                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1975              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1976                      .dwattr DW$211, DW_AT_name("drop_list_is_start"), DW_AT_symbol_name("_drop_list_is_start")
    1977                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1978                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1979              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    1980                      .dwattr DW$212, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    1981                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1982                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1983              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1984                      .dwattr DW$213, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
    1985                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1986                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1987              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1988                      .dwattr DW$214, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    1989                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    1990                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1991              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1992                      .dwattr DW$215, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
    1993                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1994                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1995                      .dwendtag DW$T$32
    1996              
    1997              DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    1998                      .dwattr DW$T$22, DW_AT_address_class(0x16)
    1999              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    2000                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    2001              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    2002                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    2003              
    2004              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    2005                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    2006                      .dwattr DW$T$26, DW_AT_byte_size(0x1e)
    2007              DW$216  .dwtag  DW_TAG_subrange_type
    2008                      .dwattr DW$216, DW_AT_upper_bound(0x1d)
    2009                      .dwendtag DW$T$26
    2010              
    2011              DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
    2012                      .dwattr DW$T$31, DW_AT_address_class(0x16)
    2013              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$21)
    2014                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    2015              
    2016              DW$T$21 .dwtag  DW_TAG_structure_type
    2017                      .dwattr DW$T$21, DW_AT_name("edit_mem")
    2018                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    2019              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2020                      .dwattr DW$217, DW_AT_name("x"), DW_AT_symbol_name("_x")
    2021                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2023              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2024                      .dwattr DW$218, DW_AT_name("y"), DW_AT_symbol_name("_y")
    2025                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 22 14:29:47 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7682                            PAGE   47

    2026                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2027              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2028                      .dwattr DW$219, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    2029                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2030                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2031              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2032                      .dwattr DW$220, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    2033                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2034                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2035              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2036                      .dwattr DW$221, DW_AT_name("id"), DW_AT_symbol_name("_id")
    2037                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2038                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2039              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2040                      .dwattr DW$222, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    2041                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2042                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2043              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    2044                      .dwattr DW$223, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    2045                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2046                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2047                      .dwendtag DW$T$21
    2048              
    2049              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
    2050                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    2051              
    2052                      .dwattr DW$116, DW_AT_external(0x01)
    2053                      .dwattr DW$94, DW_AT_type(*DW$T$65)
    2054                      .dwattr DW$127, DW_AT_external(0x01)
    2055                      .dwattr DW$126, DW_AT_external(0x01)
    2056                      .dwattr DW$135, DW_AT_external(0x01)
    2057                      .dwattr DW$131, DW_AT_external(0x01)
    2058                      .dwattr DW$128, DW_AT_external(0x01)
    2059                      .dwattr DW$133, DW_AT_external(0x01)
    2060                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    2061              
    2062              ;***************************************************************
    2063              ;* DWARF CIE ENTRIES                                           *
    2064              ;***************************************************************
    2065              
    2066              DW$CIE  .dwcie 1, 40
    2067                      .dwcfa  0x0c, 20, 0
    2068                      .dwcfa  0x07, 0
    2069                      .dwcfa  0x07, 1
    2070                      .dwcfa  0x07, 2
    2071                      .dwcfa  0x07, 3
    2072                      .dwcfa  0x07, 4
    2073                      .dwcfa  0x07, 5
    2074                      .dwcfa  0x08, 6
    2075                      .dwcfa  0x08, 7
    2076                      .dwcfa  0x08, 8
    2077                      .dwcfa  0x08, 9
    2078                      .dwcfa  0x08, 10
    2079                      .dwcfa  0x08, 11
    2080                      .dwcfa  0x07, 12
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 22 14:29:47 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7682                            PAGE   48

    2081                      .dwcfa  0x07, 13
    2082                      .dwcfa  0x07, 14
    2083                      .dwcfa  0x07, 15
    2084                      .dwcfa  0x07, 16
    2085                      .dwcfa  0x07, 17
    2086                      .dwcfa  0x07, 18
    2087                      .dwcfa  0x07, 19
    2088                      .dwcfa  0x07, 20
    2089                      .dwcfa  0x07, 21
    2090                      .dwcfa  0x07, 22
    2091                      .dwcfa  0x07, 23
    2092                      .dwcfa  0x07, 24
    2093                      .dwcfa  0x07, 25
    2094                      .dwcfa  0x07, 26
    2095                      .dwcfa  0x08, 27
    2096                      .dwcfa  0x07, 28
    2097                      .dwcfa  0x07, 29
    2098                      .dwcfa  0x07, 30
    2099                      .dwcfa  0x07, 31
    2100                      .dwcfa  0x07, 32
    2101                      .dwcfa  0x07, 33
    2102                      .dwcfa  0x07, 34
    2103                      .dwcfa  0x07, 35
    2104                      .dwcfa  0x07, 36
    2105                      .dwcfa  0x07, 37
    2106                      .dwcfa  0x07, 38
    2107                      .dwcfa  0x07, 39
    2108                      .dwcfa  0x07, 40
    2109              
    2110              ;***************************************************************
    2111              ;* DWARF REGISTER MAP                                          *
    2112              ;***************************************************************
    2113              
    2114              DW$224  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    2115                      .dwattr DW$224, DW_AT_location[DW_OP_reg0]
