TMS320C2000 COFF Assembler PC v4.1.3 Sat Nov 20 11:03:25 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI5722                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sat Nov 20 11:03:25 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_USBmod_fun.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    1432              DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
    1433                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    1434              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    1435                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1436                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    1437              DW$T$42 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$41)
    1438                      .dwattr DW$T$42, DW_AT_address_class(0x16)
    1439              
    1440              DW$T$93 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$42)
    1441                      .dwattr DW$T$93, DW_AT_language(DW_LANG_C)
    1442              
    1443              DW$T$95 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$42)
    1444                      .dwattr DW$T$95, DW_AT_language(DW_LANG_C)
    1445              DW$189  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1446              DW$190  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1447              DW$191  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
    1448              DW$192  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
    1449              DW$193  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
    1450                      .dwendtag DW$T$95
    1451              
    1452              
    1453              DW$T$97 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$42)
    1454                      .dwattr DW$T$97, DW_AT_language(DW_LANG_C)
    1455              DW$194  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1456              DW$195  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1457              DW$196  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
    1458              DW$197  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
    1459              DW$198  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
    1460              DW$199  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$42)
    1461                      .dwendtag DW$T$97
    1462              
    1463              DW$T$45 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1464                      .dwattr DW$T$45, DW_AT_encoding(DW_ATE_signed_char)
    1465                      .dwattr DW$T$45, DW_AT_byte_size(0x01)
    1466              DW$T$46 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$45)
    1467                      .dwattr DW$T$46, DW_AT_address_class(0x16)
    1468              
    1469              DW$T$85 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$46)
    1470                      .dwattr DW$T$85, DW_AT_language(DW_LANG_C)
    1471              DW$200  .dwtag  DW_TAG_subrange_type
    1472                      .dwendtag DW$T$85
    1473              
    1474              
    1475              DW$T$87 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$45)
    1476                      .dwattr DW$T$87, DW_AT_language(DW_LANG_C)
    1477              DW$201  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
    1478                      .dwendtag DW$T$87
    1479              
TMS320C2000 COFF Assembler PC v4.1.3 Sat Nov 20 11:03:25 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI5722                            PAGE   30

    1480              
    1481              DW$T$89 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$45)
    1482                      .dwattr DW$T$89, DW_AT_language(DW_LANG_C)
    1483                      .dwattr DW$T$89, DW_AT_byte_size(0x02)
    1484              DW$202  .dwtag  DW_TAG_subrange_type
    1485                      .dwattr DW$202, DW_AT_upper_bound(0x01)
    1486                      .dwendtag DW$T$89
    1487              
    1488              
    1489              DW$T$92 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$91)
    1490                      .dwattr DW$T$92, DW_AT_language(DW_LANG_C)
    1491                      .dwattr DW$T$92, DW_AT_byte_size(0x02)
    1492              DW$203  .dwtag  DW_TAG_subrange_type
    1493                      .dwattr DW$203, DW_AT_upper_bound(0x01)
    1494                      .dwendtag DW$T$92
    1495              
    1496              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1497                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1498                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1499              DW$204  .dwtag  DW_TAG_far_type
    1500                      .dwattr DW$204, DW_AT_type(*DW$T$36)
    1501              DW$T$68 .dwtag  DW_TAG_const_type
    1502                      .dwattr DW$T$68, DW_AT_type(*DW$204)
    1503              
    1504              DW$T$60 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
    1505                      .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
    1506              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1507                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1508                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1509              DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$28)
    1510                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    1511              DW$205  .dwtag  DW_TAG_far_type
    1512                      .dwattr DW$205, DW_AT_type(*DW$T$45)
    1513              DW$T$91 .dwtag  DW_TAG_const_type
    1514                      .dwattr DW$T$91, DW_AT_type(*DW$205)
    1515              
    1516              DW$T$28 .dwtag  DW_TAG_structure_type
    1517                      .dwattr DW$T$28, DW_AT_name("hwin")
    1518                      .dwattr DW$T$28, DW_AT_byte_size(0x1c)
    1519              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1520                      .dwattr DW$206, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    1521                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1523              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1524                      .dwattr DW$207, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    1525                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1526                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1527              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1528                      .dwattr DW$208, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    1529                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1530                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1531              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1532                      .dwattr DW$209, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    1533                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1534                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Nov 20 11:03:25 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI5722                            PAGE   31

    1535              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1536                      .dwattr DW$210, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    1537                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1538                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1539              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1540                      .dwattr DW$211, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    1541                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1542                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1543              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1544                      .dwattr DW$212, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    1545                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1546                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1547              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1548                      .dwattr DW$213, DW_AT_name("type"), DW_AT_symbol_name("_type")
    1549                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1550                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1551              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1552                      .dwattr DW$214, DW_AT_name("listend_hwin"), DW_AT_symbol_name("_listend_hwin")
    1553                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1554                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1555              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1556                      .dwattr DW$215, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    1557                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1558                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1559              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1560                      .dwattr DW$216, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    1561                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1562                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1563              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1564                      .dwattr DW$217, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
    1565                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1566                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1567              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1568                      .dwattr DW$218, DW_AT_name("nline"), DW_AT_symbol_name("_nline")
    1569                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1570                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1571              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1572                      .dwattr DW$219, DW_AT_name("nrow"), DW_AT_symbol_name("_nrow")
    1573                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1574                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1575              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1576                      .dwattr DW$220, DW_AT_name("grid_wide"), DW_AT_symbol_name("_grid_wide")
    1577                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1578                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1579              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1580                      .dwattr DW$221, DW_AT_name("grid_high"), DW_AT_symbol_name("_grid_high")
    1581                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1582                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1583              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1584                      .dwattr DW$222, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    1585                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1586                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1587              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1588                      .dwattr DW$223, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    1589                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 COFF Assembler PC v4.1.3 Sat Nov 20 11:03:25 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI5722                            PAGE   32

    1590                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1591              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1592                      .dwattr DW$224, DW_AT_name("button_id"), DW_AT_symbol_name("_button_id")
    1593                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1594                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1595              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1596                      .dwattr DW$225, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
    1597                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1598                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1599                      .dwendtag DW$T$28
    1600              
    1601              DW$T$23 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
    1602                      .dwattr DW$T$23, DW_AT_address_class(0x16)
    1603              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    1604                      .dwattr DW$T$25, DW_AT_address_class(0x16)
    1605              DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$22)
    1606                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
    1607              
    1608              DW$T$22 .dwtag  DW_TAG_structure_type
    1609                      .dwattr DW$T$22, DW_AT_name("edit_mem")
    1610                      .dwattr DW$T$22, DW_AT_byte_size(0x08)
    1611              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1612                      .dwattr DW$226, DW_AT_name("x"), DW_AT_symbol_name("_x")
    1613                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1615              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1616                      .dwattr DW$227, DW_AT_name("y"), DW_AT_symbol_name("_y")
    1617                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1618                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1619              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1620                      .dwattr DW$228, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    1621                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1622                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1623              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1624                      .dwattr DW$229, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    1625                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1626                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1627              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1628                      .dwattr DW$230, DW_AT_name("id"), DW_AT_symbol_name("_id")
    1629                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1630                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1631              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1632                      .dwattr DW$231, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    1633                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1634                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1635                      .dwendtag DW$T$22
    1636              
    1637              DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
    1638                      .dwattr DW$T$21, DW_AT_address_class(0x16)
    1639              
    1640                      .dwattr DW$105, DW_AT_external(0x01)
    1641                      .dwattr DW$144, DW_AT_external(0x01)
    1642                      .dwattr DW$145, DW_AT_external(0x01)
    1643                      .dwattr DW$128, DW_AT_external(0x01)
    1644                      .dwattr DW$119, DW_AT_external(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Nov 20 11:03:25 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI5722                            PAGE   33

    1645                      .dwattr DW$119, DW_AT_type(*DW$T$20)
    1646                      .dwattr DW$123, DW_AT_external(0x01)
    1647                      .dwattr DW$103, DW_AT_external(0x01)
    1648                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1649              
    1650              ;***************************************************************
    1651              ;* DWARF CIE ENTRIES                                           *
    1652              ;***************************************************************
    1653              
    1654              DW$CIE  .dwcie 1, 40
    1655                      .dwcfa  0x0c, 20, 0
    1656                      .dwcfa  0x07, 0
    1657                      .dwcfa  0x07, 1
    1658                      .dwcfa  0x07, 2
    1659                      .dwcfa  0x07, 3
    1660                      .dwcfa  0x07, 4
    1661                      .dwcfa  0x07, 5
    1662                      .dwcfa  0x08, 6
    1663                      .dwcfa  0x08, 7
    1664                      .dwcfa  0x08, 8
    1665                      .dwcfa  0x08, 9
    1666                      .dwcfa  0x08, 10
    1667                      .dwcfa  0x08, 11
    1668                      .dwcfa  0x07, 12
    1669                      .dwcfa  0x07, 13
    1670                      .dwcfa  0x07, 14
    1671                      .dwcfa  0x07, 15
    1672                      .dwcfa  0x07, 16
    1673                      .dwcfa  0x07, 17
    1674                      .dwcfa  0x07, 18
    1675                      .dwcfa  0x07, 19
    1676                      .dwcfa  0x07, 20
    1677                      .dwcfa  0x07, 21
    1678                      .dwcfa  0x07, 22
    1679                      .dwcfa  0x07, 23
    1680                      .dwcfa  0x07, 24
    1681                      .dwcfa  0x07, 25
    1682                      .dwcfa  0x07, 26
    1683                      .dwcfa  0x08, 27
    1684                      .dwcfa  0x07, 28
    1685                      .dwcfa  0x07, 29
    1686                      .dwcfa  0x07, 30
    1687                      .dwcfa  0x07, 31
    1688                      .dwcfa  0x07, 32
    1689                      .dwcfa  0x07, 33
    1690                      .dwcfa  0x07, 34
    1691                      .dwcfa  0x07, 35
    1692                      .dwcfa  0x07, 36
    1693                      .dwcfa  0x07, 37
    1694                      .dwcfa  0x07, 38
    1695                      .dwcfa  0x07, 39
    1696                      .dwcfa  0x07, 40
    1697              
    1698              ;***************************************************************
    1699              ;* DWARF REGISTER MAP                                          *
TMS320C2000 COFF Assembler PC v4.1.3 Sat Nov 20 11:03:25 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI5722                            PAGE   34

    1700              ;***************************************************************
