TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 30 11:17:56 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2963                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sat Oct 30 11:17:56 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_USBmod_interface.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

     332              ;* UNDEFINED EXTERNAL REFERENCES                               *
     333              ;***************************************************************
     334                      .global _GUI_string_display_At
     335                      .global _GUI_string_display
     336                      .global _DL_PleaseWaitTip
     337                      .global _GUI_set_Bgcolor
     338                      .global _GUI_set_Fgcolor
     339                      .global _GUI_window_hwin_release
     340                      .global _GUI_window_hwin_req
     341                      .global _GUI_xy_set
     342                      .global _g_language
     343              
     344              ;***************************************************************
     345              ;* TYPE INFORMATION                                            *
     346              ;***************************************************************
     347              
     348              DW$T$27 .dwtag  DW_TAG_subroutine_type
     349                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     350              DW$31   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     351                      .dwendtag DW$T$27
     352              
     353              
     354              DW$T$31 .dwtag  DW_TAG_subroutine_type
     355                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     356              DW$32   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
     357                      .dwendtag DW$T$31
     358              
     359              
     360              DW$T$33 .dwtag  DW_TAG_subroutine_type
     361                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
     362              DW$33   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     363              DW$34   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     364                      .dwendtag DW$T$33
     365              
     366              
     367              DW$T$37 .dwtag  DW_TAG_subroutine_type
     368                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
     369              DW$35   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
     370                      .dwendtag DW$T$37
     371              
     372              
     373              DW$T$39 .dwtag  DW_TAG_subroutine_type
     374                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     375              DW$36   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     376              DW$37   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     377              DW$38   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
     378                      .dwendtag DW$T$39
     379              
     380              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t"), DW_AT_type(*DW$T$11)
     381                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     382              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$19)
     383                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     384              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
     385                      .dwattr DW$T$30, DW_AT_address_class(0x16)
     386              DW$T$35 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 30 11:17:56 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2963                            PAGE   13

     387                      .dwattr DW$T$35, DW_AT_encoding(DW_ATE_signed_char)
     388                      .dwattr DW$T$35, DW_AT_byte_size(0x01)
     389              DW$T$36 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
     390                      .dwattr DW$T$36, DW_AT_address_class(0x16)
     391              
     392              DW$T$41 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$36)
     393                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
     394              DW$39   .dwtag  DW_TAG_subrange_type
     395                      .dwendtag DW$T$41
     396              
     397              
     398              DW$T$42 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$36)
     399                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     400                      .dwattr DW$T$42, DW_AT_byte_size(0x04)
     401              DW$40   .dwtag  DW_TAG_subrange_type
     402                      .dwattr DW$40, DW_AT_upper_bound(0x01)
     403                      .dwendtag DW$T$42
     404              
     405              
     406              DW$T$43 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$36)
     407                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
     408                      .dwattr DW$T$43, DW_AT_byte_size(0x18)
     409              DW$41   .dwtag  DW_TAG_subrange_type
     410                      .dwattr DW$41, DW_AT_upper_bound(0x05)
     411              DW$42   .dwtag  DW_TAG_subrange_type
     412                      .dwattr DW$42, DW_AT_upper_bound(0x01)
     413                      .dwendtag DW$T$43
     414              
     415              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     416                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     417                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     418              DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$26)
     419                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
     420              
     421              DW$T$26 .dwtag  DW_TAG_structure_type
     422                      .dwattr DW$T$26, DW_AT_name("hwin")
     423                      .dwattr DW$T$26, DW_AT_byte_size(0x1a)
     424              DW$43   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     425                      .dwattr DW$43, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
     426                      .dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     427                      .dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
     428              DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     429                      .dwattr DW$44, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
     430                      .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     431                      .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
     432              DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     433                      .dwattr DW$45, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
     434                      .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     435                      .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
     436              DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     437                      .dwattr DW$46, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
     438                      .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     439                      .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
     440              DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     441                      .dwattr DW$47, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 30 11:17:56 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2963                            PAGE   14

     442                      .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     443                      .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     444              DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     445                      .dwattr DW$48, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
     446                      .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     447                      .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     448              DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     449                      .dwattr DW$49, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
     450                      .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     451                      .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     452              DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     453                      .dwattr DW$50, DW_AT_name("type"), DW_AT_symbol_name("_type")
     454                      .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     455                      .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     456              DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     457                      .dwattr DW$51, DW_AT_name("listend_hwin"), DW_AT_symbol_name("_listend_hwin")
     458                      .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     459                      .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
     460              DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     461                      .dwattr DW$52, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
     462                      .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     463                      .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     464              DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     465                      .dwattr DW$53, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
     466                      .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     467                      .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
     468              DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     469                      .dwattr DW$54, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
     470                      .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     471                      .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     472              DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     473                      .dwattr DW$55, DW_AT_name("nline"), DW_AT_symbol_name("_nline")
     474                      .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     475                      .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     476              DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     477                      .dwattr DW$56, DW_AT_name("nrow"), DW_AT_symbol_name("_nrow")
     478                      .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     479                      .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     480              DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     481                      .dwattr DW$57, DW_AT_name("grid_wide"), DW_AT_symbol_name("_grid_wide")
     482                      .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     483                      .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     484              DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     485                      .dwattr DW$58, DW_AT_name("grid_high"), DW_AT_symbol_name("_grid_high")
     486                      .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     487                      .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     488              DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     489                      .dwattr DW$59, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
     490                      .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     491                      .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     492              DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     493                      .dwattr DW$60, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
     494                      .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     495                      .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     496              DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 30 11:17:56 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2963                            PAGE   15

     497                      .dwattr DW$61, DW_AT_name("button_id"), DW_AT_symbol_name("_button_id")
     498                      .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     499                      .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     500                      .dwendtag DW$T$26
     501              
     502              DW$T$23 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
     503                      .dwattr DW$T$23, DW_AT_address_class(0x16)
     504              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
     505                      .dwattr DW$T$25, DW_AT_address_class(0x16)
     506              DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$22)
     507                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
     508              
     509              DW$T$22 .dwtag  DW_TAG_structure_type
     510                      .dwattr DW$T$22, DW_AT_name("edit_mem")
     511                      .dwattr DW$T$22, DW_AT_byte_size(0x08)
     512              DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     513                      .dwattr DW$62, DW_AT_name("x"), DW_AT_symbol_name("_x")
     514                      .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     515                      .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     516              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     517                      .dwattr DW$63, DW_AT_name("y"), DW_AT_symbol_name("_y")
     518                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     519                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     520              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     521                      .dwattr DW$64, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
     522                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     523                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     524              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     525                      .dwattr DW$65, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
     526                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     527                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     528              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     529                      .dwattr DW$66, DW_AT_name("id"), DW_AT_symbol_name("_id")
     530                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     531                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     532              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     533                      .dwattr DW$67, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
     534                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     535                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     536                      .dwendtag DW$T$22
     537              
     538              DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
     539                      .dwattr DW$T$21, DW_AT_address_class(0x16)
     540              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     541                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     542                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     543              
     544                      .dwattr DW$22, DW_AT_external(0x01)
     545                      .dwattr DW$28, DW_AT_external(0x01)
     546                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     547              
     548              ;***************************************************************
     549              ;* DWARF CIE ENTRIES                                           *
     550              ;***************************************************************
     551              
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 30 11:17:56 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2963                            PAGE   16

     552              DW$CIE  .dwcie 1, 40
     553                      .dwcfa  0x0c, 20, 0
     554                      .dwcfa  0x07, 0
     555                      .dwcfa  0x07, 1
     556                      .dwcfa  0x07, 2
     557                      .dwcfa  0x07, 3
     558                      .dwcfa  0x07, 4
     559                      .dwcfa  0x07, 5
     560                      .dwcfa  0x08, 6
     561                      .dwcfa  0x08, 7
     562                      .dwcfa  0x08, 8
     563                      .dwcfa  0x08, 9
     564                      .dwcfa  0x08, 10
     565                      .dwcfa  0x08, 11
     566                      .dwcfa  0x07, 12
     567                      .dwcfa  0x07, 13
     568                      .dwcfa  0x07, 14
     569                      .dwcfa  0x07, 15
     570                      .dwcfa  0x07, 16
     571                      .dwcfa  0x07, 17
     572                      .dwcfa  0x07, 18
     573                      .dwcfa  0x07, 19
     574                      .dwcfa  0x07, 20
     575                      .dwcfa  0x07, 21
     576                      .dwcfa  0x07, 22
     577                      .dwcfa  0x07, 23
     578                      .dwcfa  0x07, 24
     579                      .dwcfa  0x07, 25
     580                      .dwcfa  0x07, 26
     581                      .dwcfa  0x08, 27
     582                      .dwcfa  0x07, 28
     583                      .dwcfa  0x07, 29
     584                      .dwcfa  0x07, 30
     585                      .dwcfa  0x07, 31
     586                      .dwcfa  0x07, 32
     587                      .dwcfa  0x07, 33
     588                      .dwcfa  0x07, 34
     589                      .dwcfa  0x07, 35
     590                      .dwcfa  0x07, 36
     591                      .dwcfa  0x07, 37
     592                      .dwcfa  0x07, 38
     593                      .dwcfa  0x07, 39
     594                      .dwcfa  0x07, 40
     595              
     596              ;***************************************************************
     597              ;* DWARF REGISTER MAP                                          *
     598              ;***************************************************************
     599              
     600              DW$68   .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
     601                      .dwattr DW$68, DW_AT_location[DW_OP_reg0]
     602              DW$69   .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
     603                      .dwattr DW$69, DW_AT_location[DW_OP_reg1]
