TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:07 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8204                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sat Oct 09 16:16:06 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("ucshell.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    1826                      .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    1827              DW$156  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$64)
    1828                      .dwendtag DW$T$65
    1829              
    1830              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
    1831                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    1832              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$33)
    1833                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    1834              
    1835              DW$T$67 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$34)
    1836                      .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
    1837              DW$157  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$60)
    1838                      .dwendtag DW$T$67
    1839              
    1840              
    1841              DW$T$69 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$34)
    1842                      .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
    1843              DW$158  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$60)
    1844              DW$159  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
    1845                      .dwendtag DW$T$69
    1846              
    1847              DW$T$72 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$33)
    1848                      .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
    1849              
    1850              DW$T$73 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$72)
    1851                      .dwattr DW$T$73, DW_AT_language(DW_LANG_C)
    1852              DW$160  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1853              DW$161  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1854              DW$162  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
    1855                      .dwendtag DW$T$73
    1856              
    1857              
    1858              DW$T$75 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$72)
    1859                      .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
    1860              DW$163  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
    1861                      .dwendtag DW$T$75
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:07 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8204                            PAGE   50

    1862              
    1863              
    1864              DW$T$77 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$72)
    1865                      .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
    1866              DW$164  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
    1867              DW$165  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    1868              DW$166  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
    1869                      .dwendtag DW$T$77
    1870              
    1871              DW$T$39 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
    1872                      .dwattr DW$T$39, DW_AT_address_class(0x16)
    1873              DW$T$53 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$39)
    1874                      .dwattr DW$T$53, DW_AT_address_class(0x16)
    1875              DW$T$23 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1876                      .dwattr DW$T$23, DW_AT_encoding(DW_ATE_signed_char)
    1877                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    1878              DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    1879                      .dwattr DW$T$27, DW_AT_address_class(0x16)
    1880              DW$T$64 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
    1881                      .dwattr DW$T$64, DW_AT_address_class(0x16)
    1882              DW$T$43 .dwtag  DW_TAG_typedef, DW_AT_name("log_param"), DW_AT_type(*DW$T$26)
    1883                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
    1884              DW$T$44 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$43)
    1885                      .dwattr DW$T$44, DW_AT_address_class(0x16)
    1886              
    1887              DW$T$82 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$81)
    1888                      .dwattr DW$T$82, DW_AT_language(DW_LANG_C)
    1889                      .dwattr DW$T$82, DW_AT_byte_size(0x3c)
    1890              DW$167  .dwtag  DW_TAG_subrange_type
    1891                      .dwattr DW$167, DW_AT_upper_bound(0x09)
    1892                      .dwendtag DW$T$82
    1893              
    1894              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1895                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1896                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1897              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1898                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1899                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1900              DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t"), DW_AT_type(*DW$T$11)
    1901                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    1902              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("a_lock_t"), DW_AT_type(*DW$T$37)
    1903                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    1904              DW$168  .dwtag  DW_TAG_far_type
    1905                      .dwattr DW$168, DW_AT_type(*DW$T$23)
    1906              DW$T$63 .dwtag  DW_TAG_const_type
    1907                      .dwattr DW$T$63, DW_AT_type(*DW$168)
    1908              
    1909              DW$T$26 .dwtag  DW_TAG_structure_type
    1910                      .dwattr DW$T$26, DW_AT_byte_size(0x28)
    1911              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1912                      .dwattr DW$169, DW_AT_name("pram_buf"), DW_AT_symbol_name("_pram_buf")
    1913                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1914                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1915              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1916                      .dwattr DW$170, DW_AT_name("cur_off"), DW_AT_symbol_name("_cur_off")
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:07 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8204                            PAGE   51

    1917                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1918                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1919              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1920                      .dwattr DW$171, DW_AT_name("parm_0"), DW_AT_symbol_name("_parm_0")
    1921                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1922                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1923              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1924                      .dwattr DW$172, DW_AT_name("parm_1"), DW_AT_symbol_name("_parm_1")
    1925                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1926                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1927              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1928                      .dwattr DW$173, DW_AT_name("parm_2"), DW_AT_symbol_name("_parm_2")
    1929                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1930                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1931              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1932                      .dwattr DW$174, DW_AT_name("parm_3"), DW_AT_symbol_name("_parm_3")
    1933                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1934                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1935              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1936                      .dwattr DW$175, DW_AT_name("parm_4"), DW_AT_symbol_name("_parm_4")
    1937                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1938                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1939              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1940                      .dwattr DW$176, DW_AT_name("parm_5"), DW_AT_symbol_name("_parm_5")
    1941                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1942                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1943              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1944                      .dwattr DW$177, DW_AT_name("end_pram"), DW_AT_symbol_name("_end_pram")
    1945                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1946                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1947                      .dwendtag DW$T$26
    1948              
    1949              DW$178  .dwtag  DW_TAG_far_type
    1950                      .dwattr DW$178, DW_AT_type(*DW$T$80)
    1951              DW$T$81 .dwtag  DW_TAG_const_type
    1952                      .dwattr DW$T$81, DW_AT_type(*DW$178)
    1953              DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    1954                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    1955              
    1956              DW$T$24 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    1957                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
    1958                      .dwattr DW$T$24, DW_AT_byte_size(0x18)
    1959              DW$179  .dwtag  DW_TAG_subrange_type
    1960                      .dwattr DW$179, DW_AT_upper_bound(0x17)
    1961                      .dwendtag DW$T$24
    1962              
    1963              DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("ucshell_cmd_manege_t"), DW_AT_type(*DW$T$30)
    1964                      .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    1965              
    1966              DW$T$22 .dwtag  DW_TAG_structure_type
    1967                      .dwattr DW$T$22, DW_AT_name("os_event")
    1968                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    1969              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1970                      .dwattr DW$180, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    1971                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:07 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8204                            PAGE   52

    1972                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1973              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1974                      .dwattr DW$181, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    1975                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1976                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1977              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1978                      .dwattr DW$182, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    1979                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1980                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1981              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1982                      .dwattr DW$183, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    1983                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1984                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1985              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1986                      .dwattr DW$184, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    1987                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1988                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1989                      .dwendtag DW$T$22
    1990              
    1991              
    1992              DW$T$30 .dwtag  DW_TAG_structure_type
    1993                      .dwattr DW$T$30, DW_AT_byte_size(0x06)
    1994              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1995                      .dwattr DW$185, DW_AT_name("cmd"), DW_AT_symbol_name("_cmd")
    1996                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1997                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1998              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1999                      .dwattr DW$186, DW_AT_name("cmd_run_fun"), DW_AT_symbol_name("_cmd_run_fun")
    2000                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2001                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2002              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2003                      .dwattr DW$187, DW_AT_name("cmd_explain"), DW_AT_symbol_name("_cmd_explain")
    2004                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2005                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2006                      .dwendtag DW$T$30
    2007              
    2008              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
    2009                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    2010              
    2011              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    2012                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    2013                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    2014              DW$188  .dwtag  DW_TAG_subrange_type
    2015                      .dwattr DW$188, DW_AT_upper_bound(0x07)
    2016                      .dwendtag DW$T$21
    2017              
    2018              
    2019                      .dwattr DW$81, DW_AT_external(0x01)
    2020                      .dwattr DW$68, DW_AT_external(0x01)
    2021                      .dwattr DW$95, DW_AT_external(0x01)
    2022                      .dwattr DW$84, DW_AT_external(0x01)
    2023                      .dwattr DW$101, DW_AT_external(0x01)
    2024                      .dwattr DW$78, DW_AT_external(0x01)
    2025                      .dwattr DW$138, DW_AT_external(0x01)
    2026                      .dwattr DW$139, DW_AT_external(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:07 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8204                            PAGE   53

    2027                      .dwattr DW$102, DW_AT_external(0x01)
    2028                      .dwattr DW$102, DW_AT_type(*DW$T$34)
    2029                      .dwattr DW$115, DW_AT_external(0x01)
    2030                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    2031              
    2032              ;***************************************************************
    2033              ;* DWARF CIE ENTRIES                                           *
    2034              ;***************************************************************
    2035              
    2036              DW$CIE  .dwcie 1, 40
    2037                      .dwcfa  0x0c, 20, 0
    2038                      .dwcfa  0x07, 0
    2039                      .dwcfa  0x07, 1
    2040                      .dwcfa  0x07, 2
    2041                      .dwcfa  0x07, 3
    2042                      .dwcfa  0x07, 4
    2043                      .dwcfa  0x07, 5
    2044                      .dwcfa  0x08, 6
    2045                      .dwcfa  0x08, 7
    2046                      .dwcfa  0x08, 8
    2047                      .dwcfa  0x08, 9
    2048                      .dwcfa  0x08, 10
    2049                      .dwcfa  0x08, 11
    2050                      .dwcfa  0x07, 12
    2051                      .dwcfa  0x07, 13
    2052                      .dwcfa  0x07, 14
    2053                      .dwcfa  0x07, 15
    2054                      .dwcfa  0x07, 16
    2055                      .dwcfa  0x07, 17
    2056                      .dwcfa  0x07, 18
    2057                      .dwcfa  0x07, 19
    2058                      .dwcfa  0x07, 20
    2059                      .dwcfa  0x07, 21
    2060                      .dwcfa  0x07, 22
    2061                      .dwcfa  0x07, 23
    2062                      .dwcfa  0x07, 24
    2063                      .dwcfa  0x07, 25
    2064                      .dwcfa  0x07, 26
    2065                      .dwcfa  0x08, 27
    2066                      .dwcfa  0x07, 28
    2067                      .dwcfa  0x07, 29
    2068                      .dwcfa  0x07, 30
    2069                      .dwcfa  0x07, 31
    2070                      .dwcfa  0x07, 32
    2071                      .dwcfa  0x07, 33
    2072                      .dwcfa  0x07, 34
    2073                      .dwcfa  0x07, 35
    2074                      .dwcfa  0x07, 36
