TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:08 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2722                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sat Oct 09 16:16:07 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("ucshell_ps.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    1694              DW$114  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
    1695              DW$115  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$53)
    1696                      .dwendtag DW$T$68
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:08 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2722                            PAGE   45

    1697              
    1698              
    1699              DW$T$70 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    1700                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    1701                      .dwattr DW$T$70, DW_AT_byte_size(0x26)
    1702              DW$116  .dwtag  DW_TAG_subrange_type
    1703                      .dwattr DW$116, DW_AT_upper_bound(0x25)
    1704                      .dwendtag DW$T$70
    1705              
    1706              DW$T$62 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
    1707                      .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
    1708              
    1709              DW$T$65 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$62)
    1710                      .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    1711              DW$117  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$62)
    1712              DW$118  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$64)
    1713                      .dwendtag DW$T$65
    1714              
    1715              DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$29)
    1716                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    1717              DW$T$50 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
    1718                      .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
    1719              DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t"), DW_AT_type(*DW$T$13)
    1720                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    1721              DW$T$63 .dwtag  DW_TAG_typedef, DW_AT_name("OS_STK_DATA"), DW_AT_type(*DW$T$20)
    1722                      .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    1723              DW$T$64 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
    1724                      .dwattr DW$T$64, DW_AT_address_class(0x16)
    1725              DW$T$21 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1726                      .dwattr DW$T$21, DW_AT_encoding(DW_ATE_signed_char)
    1727                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
    1728              DW$T$53 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
    1729                      .dwattr DW$T$53, DW_AT_address_class(0x16)
    1730              
    1731              DW$T$74 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$21)
    1732                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    1733                      .dwattr DW$T$74, DW_AT_byte_size(0x19)
    1734              DW$119  .dwtag  DW_TAG_subrange_type
    1735                      .dwattr DW$119, DW_AT_upper_bound(0x18)
    1736                      .dwendtag DW$T$74
    1737              
    1738              DW$T$54 .dwtag  DW_TAG_typedef, DW_AT_name("log_param"), DW_AT_type(*DW$T$24)
    1739                      .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    1740              DW$T$55 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$54)
    1741                      .dwattr DW$T$55, DW_AT_address_class(0x16)
    1742              DW$T$59 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$58)
    1743                      .dwattr DW$T$59, DW_AT_address_class(0x16)
    1744              
    1745              DW$T$76 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$59)
    1746                      .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
    1747              DW$120  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
    1748              DW$121  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
    1749              DW$122  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
    1750              DW$123  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1751                      .dwendtag DW$T$76
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:08 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2722                            PAGE   46

    1752              
    1753              DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("os_dirver_maneger_t"), DW_AT_type(*DW$T$49)
    1754                      .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    1755              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    1756                      .dwattr DW$T$26, DW_AT_address_class(0x16)
    1757              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1758                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1759                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1760              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1761                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1762                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1763              DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t"), DW_AT_type(*DW$T$11)
    1764                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    1765              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    1766                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1767                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    1768              
    1769              DW$T$20 .dwtag  DW_TAG_structure_type
    1770                      .dwattr DW$T$20, DW_AT_name("os_stk_data")
    1771                      .dwattr DW$T$20, DW_AT_byte_size(0x04)
    1772              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1773                      .dwattr DW$124, DW_AT_name("OSFree"), DW_AT_symbol_name("_OSFree")
    1774                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1775                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1776              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1777                      .dwattr DW$125, DW_AT_name("OSUsed"), DW_AT_symbol_name("_OSUsed")
    1778                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1779                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1780                      .dwendtag DW$T$20
    1781              
    1782              
    1783              DW$T$24 .dwtag  DW_TAG_structure_type
    1784                      .dwattr DW$T$24, DW_AT_byte_size(0x28)
    1785              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1786                      .dwattr DW$126, DW_AT_name("pram_buf"), DW_AT_symbol_name("_pram_buf")
    1787                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1788                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1789              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1790                      .dwattr DW$127, DW_AT_name("cur_off"), DW_AT_symbol_name("_cur_off")
    1791                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1792                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1793              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1794                      .dwattr DW$128, DW_AT_name("parm_0"), DW_AT_symbol_name("_parm_0")
    1795                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1796                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1797              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1798                      .dwattr DW$129, DW_AT_name("parm_1"), DW_AT_symbol_name("_parm_1")
    1799                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1800                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1801              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1802                      .dwattr DW$130, DW_AT_name("parm_2"), DW_AT_symbol_name("_parm_2")
    1803                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1804                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1805              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1806                      .dwattr DW$131, DW_AT_name("parm_3"), DW_AT_symbol_name("_parm_3")
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:08 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2722                            PAGE   47

    1807                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1808                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1809              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1810                      .dwattr DW$132, DW_AT_name("parm_4"), DW_AT_symbol_name("_parm_4")
    1811                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1812                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1813              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1814                      .dwattr DW$133, DW_AT_name("parm_5"), DW_AT_symbol_name("_parm_5")
    1815                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1816                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1817              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1818                      .dwattr DW$134, DW_AT_name("end_pram"), DW_AT_symbol_name("_end_pram")
    1819                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1820                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1821                      .dwendtag DW$T$24
    1822              
    1823              DW$T$58 .dwtag  DW_TAG_typedef, DW_AT_name("tmr_member_t"), DW_AT_type(*DW$T$31)
    1824                      .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
    1825              
    1826              DW$T$49 .dwtag  DW_TAG_structure_type
    1827                      .dwattr DW$T$49, DW_AT_byte_size(0x2be)
    1828              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1829                      .dwattr DW$135, DW_AT_name("real_size"), DW_AT_symbol_name("_real_size")
    1830                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1831                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1832              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    1833                      .dwattr DW$136, DW_AT_name("os_driver_member"), DW_AT_symbol_name("_os_driver_member")
    1834                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1835                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1836                      .dwendtag DW$T$49
    1837              
    1838              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT32U"), DW_AT_type(*DW$T$13)
    1839                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    1840              
    1841              DW$T$22 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$21)
    1842                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    1843                      .dwattr DW$T$22, DW_AT_byte_size(0x18)
    1844              DW$137  .dwtag  DW_TAG_subrange_type
    1845                      .dwattr DW$137, DW_AT_upper_bound(0x17)
    1846                      .dwendtag DW$T$22
    1847              
    1848              
    1849              DW$T$31 .dwtag  DW_TAG_structure_type
    1850                      .dwattr DW$T$31, DW_AT_byte_size(0x0a)
    1851              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1852                      .dwattr DW$138, DW_AT_name("function"), DW_AT_symbol_name("_function")
    1853                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1854                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1855              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1856                      .dwattr DW$139, DW_AT_name("expires"), DW_AT_symbol_name("_expires")
    1857                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1858                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1859              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1860                      .dwattr DW$140, DW_AT_name("tmr_state"), DW_AT_symbol_name("_tmr_state")
    1861                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:08 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2722                            PAGE   48

    1862                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1863              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1864                      .dwattr DW$141, DW_AT_name("type"), DW_AT_symbol_name("_type")
    1865                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1866                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1867              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1868                      .dwattr DW$142, DW_AT_name("auto_load_expires"), DW_AT_symbol_name("_auto_load_expires")
    1869                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1870                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1871              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1872                      .dwattr DW$143, DW_AT_name("p_arg"), DW_AT_symbol_name("_p_arg")
    1873                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1874                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1875                      .dwendtag DW$T$31
    1876              
    1877              
    1878              DW$T$48 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$47)
    1879                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
    1880                      .dwattr DW$T$48, DW_AT_byte_size(0x2bc)
    1881              DW$144  .dwtag  DW_TAG_subrange_type
    1882                      .dwattr DW$144, DW_AT_upper_bound(0x18)
    1883                      .dwendtag DW$T$48
    1884              
    1885              DW$T$47 .dwtag  DW_TAG_typedef, DW_AT_name("os_dirver_member_t"), DW_AT_type(*DW$T$46)
    1886                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
    1887              
    1888              DW$T$46 .dwtag  DW_TAG_structure_type
    1889                      .dwattr DW$T$46, DW_AT_byte_size(0x1c)
    1890              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    1891                      .dwattr DW$145, DW_AT_name("id"), DW_AT_symbol_name("_id")
    1892                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1893                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1894              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    1895                      .dwattr DW$146, DW_AT_name("os_driver_read"), DW_AT_symbol_name("_os_driver_read")
    1896                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1897                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1898              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    1899                      .dwattr DW$147, DW_AT_name("os_driver_write"), DW_AT_symbol_name("_os_driver_write")
    1900                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1901                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1902              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    1903                      .dwattr DW$148, DW_AT_name("os_driver_ioctl"), DW_AT_symbol_name("_os_driver_ioctl")
    1904                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1905                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1906              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    1907                      .dwattr DW$149, DW_AT_name("os_driver_init"), DW_AT_symbol_name("_os_driver_init")
    1908                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1909                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1910              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    1911                      .dwattr DW$150, DW_AT_name("os_driver_uninstall"), DW_AT_symbol_name("_os_driver_uninstall")
    1912                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1913                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1914              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    1915                      .dwattr DW$151, DW_AT_name("os_driver_name"), DW_AT_symbol_name("_os_driver_name")
    1916                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:08 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2722                            PAGE   49

    1917                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1918                      .dwendtag DW$T$46
    1919              
    1920              DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_ioctl_t"), DW_AT_type(*DW$T$39)
    1921                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
    1922              DW$T$43 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_init_t"), DW_AT_type(*DW$T$42)
    1923                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
    1924              DW$T$44 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_uninstall_t"), DW_AT_type(*DW$T$42)
    1925                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
    1926              DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("dev_id_t"), DW_AT_type(*DW$T$23)
    1927                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    1928              DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_read_t"), DW_AT_type(*DW$T$35)
    1929                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
    1930              DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_write_t"), DW_AT_type(*DW$T$35)
    1931                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    1932              
    1933              DW$T$45 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$21)
    1934                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    1935                      .dwattr DW$T$45, DW_AT_byte_size(0x0f)
    1936              DW$152  .dwtag  DW_TAG_subrange_type
    1937                      .dwattr DW$152, DW_AT_upper_bound(0x0e)
    1938                      .dwendtag DW$T$45
    1939              
    1940              DW$T$39 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
    1941                      .dwattr DW$T$39, DW_AT_address_class(0x16)
    1942              DW$T$42 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$41)
    1943                      .dwattr DW$T$42, DW_AT_address_class(0x16)
    1944              DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
    1945                      .dwattr DW$T$35, DW_AT_address_class(0x16)
    1946              
    1947              DW$T$38 .dwtag  DW_TAG_subroutine_type
    1948                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    1949              DW$153  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
    1950              DW$154  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1951                      .dwendtag DW$T$38
    1952              
    1953              
    1954              DW$T$34 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$30)
    1955                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    1956              DW$155  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
    1957              DW$156  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
    1958              DW$157  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1959                      .dwendtag DW$T$34
    1960              
    1961              DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    1962                      .dwattr DW$T$33, DW_AT_address_class(0x16)
    1963              
    1964                      .dwattr DW$95, DW_AT_external(0x01)
    1965                      .dwattr DW$98, DW_AT_external(0x01)
    1966                      .dwattr DW$101, DW_AT_external(0x01)
    1967                      .dwattr DW$104, DW_AT_external(0x01)
    1968                      .dwattr DW$83, DW_AT_external(0x01)
    1969                      .dwattr DW$86, DW_AT_external(0x01)
    1970                      .dwattr DW$89, DW_AT_external(0x01)
    1971                      .dwattr DW$92, DW_AT_external(0x01)
