/*********************************************************************************************
*            珠海科荟电器有限公司
*            http://www.zhkh.com
* 模块名称:控件管理
* 创建时间:2010-9-18
* 所属公司 :科荟
* 文件名称:Gui_widget.c
* 创建人 :揭成
* 功能描述:GUI 件管理，针对应用的需要编写的控件共包含
*                        1，网格控件
*                        2，编辑框控件
*                        3，消息对话框控件
*                        4，按键控件
*                        5，窗口控件
*                        6，文本框控件
*                        7, 进度条控件
*                        8, 下拉菜单控件
*                        9,  复选框
*                        10, 并选框
*                        11, DIALOG
*----------------------------------------------------------------
修改记录:增加按键控件

修改日期:10-9-29

修改人:  揭成
********************************************************************
修改记录:增加窗口控件

修改日期:10-10-20

修改人:  揭成
********************************************************************
修改记录:增加文本框控件

修改日期:10-11-20

修改人:  揭成
********************************************************************
修改记录:为按键增加ontouch 属性

修改日期:10-11-24

修 改 人:揭成
********************************************************************
修改记录:增加进度条控件

修改日期:10-11-30

修 改 人:揭成
********************************************************************
修改记录:增加下拉菜单控件

修改日期:10-12-13日

修改人:  揭成
********************************************************************
修改记录:增加复选框

修改日期:12-01-13日

修改人:  揭成
********************************************************************
修改记录:增加并选框

修改日期:12-01-13日

修改人:  揭成
********************************************************************
修改记录:增加滑动条
修改日期:13-04-20日

修改人:  揭成
********************************************************************
修改记录:增加滑动块
修改日期:13-09-16日

修改人:  揭成
********************************************************************/
#include "WIDGET\GUI_widgetCOM.c"
#include "WIDGET\GUI_widget_3D_window.c"
#include "WIDGET\GUI_widget_button.c"
#include "WIDGET\GUI_widget_checkbox.c"
#include "WIDGET\GUI_widget_dialogBox.c"
#include "WIDGET\Gui_widget_droplist.c"
#include "WIDGET\GUI_widget_edit.c"
#include "WIDGET\Gui_widget_MsgBox.c"
#include "WIDGET\Gui_widget_progress_bar.c"
#include "WIDGET\GUI_widget_radio.c"
#include "WIDGET\GUI_widget_listview.c"
#include "WIDGET\Gui_widget_txtbox.c"
#include "WIDGET\GUI_widget_keypad.c"
#include "WIDGET\GUI_widget_handPen.c"
#include "WIDGET\Gui_widget_scrollbar.c"
#include "WIDGET\Gui_widget_slider.c"
