TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:04 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7562                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Wed Jul 14 17:06:04 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("os_core.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("OSTaskIdleHook"), DW_AT_symbol_name("_OSTaskIdleHook")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              

C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7562                            PAGE   58

    3036                      .dwattr DW$T$64, DW_AT_language(DW_LANG_C)
    3037              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
    3038                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    3039              
    3040              DW$T$66 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$20)
    3041                      .dwattr DW$T$66, DW_AT_language(DW_LANG_C)
    3042              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    3043                      .dwattr DW$T$25, DW_AT_address_class(0x16)
    3044              
    3045              DW$T$65 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$24)
    3046                      .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    3047                      .dwattr DW$T$65, DW_AT_byte_size(0x100)
    3048              DW$207  .dwtag  DW_TAG_subrange_type
    3049                      .dwattr DW$207, DW_AT_upper_bound(0xff)
    3050                      .dwendtag DW$T$65
    3051              
    3052              DW$T$59 .dwtag  DW_TAG_typedef, DW_AT_name("INT32U"), DW_AT_type(*DW$T$13)
    3053                      .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
    3054              DW$208  .dwtag  DW_TAG_far_type
    3055                      .dwattr DW$208, DW_AT_type(*DW$T$59)
    3056              DW$T$67 .dwtag  DW_TAG_volatile_type
    3057                      .dwattr DW$T$67, DW_AT_type(*DW$208)
    3058              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
    3059                      .dwattr DW$T$28, DW_AT_address_class(0x16)
    3060              
    3061              DW$T$68 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$27)
    3062                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    3063                      .dwattr DW$T$68, DW_AT_byte_size(0x258)
    3064              DW$209  .dwtag  DW_TAG_subrange_type
    3065                      .dwattr DW$209, DW_AT_upper_bound(0x13)
    3066                      .dwendtag DW$T$68
    3067              
    3068              DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
    3069                      .dwattr DW$T$38, DW_AT_address_class(0x16)
    3070              
    3071              DW$T$69 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$38)
    3072                      .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
    3073                      .dwattr DW$T$69, DW_AT_byte_size(0x80)
    3074              DW$210  .dwtag  DW_TAG_subrange_type
    3075                      .dwattr DW$210, DW_AT_upper_bound(0x3f)
    3076                      .dwendtag DW$T$69
    3077              
    3078              
    3079              DW$T$71 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$37)
    3080                      .dwattr DW$T$71, DW_AT_language(DW_LANG_C)
    3081                      .dwattr DW$T$71, DW_AT_byte_size(0x1a4)
    3082              DW$211  .dwtag  DW_TAG_subrange_type
    3083                      .dwattr DW$211, DW_AT_upper_bound(0x14)
    3084                      .dwendtag DW$T$71
    3085              
    3086              DW$T$73 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$72)
    3087                      .dwattr DW$T$73, DW_AT_address_class(0x16)
    3088              
    3089              DW$T$74 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$72)
    3090                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:04 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7562                            PAGE   59

    3091                      .dwattr DW$T$74, DW_AT_byte_size(0x3c)
    3092              DW$212  .dwtag  DW_TAG_subrange_type
    3093                      .dwattr DW$212, DW_AT_upper_bound(0x04)
    3094                      .dwendtag DW$T$74
    3095              
    3096              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    3097                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3098                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    3099              DW$213  .dwtag  DW_TAG_far_type
    3100                      .dwattr DW$213, DW_AT_type(*DW$T$19)
    3101              DW$T$61 .dwtag  DW_TAG_const_type
    3102                      .dwattr DW$T$61, DW_AT_type(*DW$213)
    3103              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    3104                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3105                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    3106              DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("OS_STK"), DW_AT_type(*DW$T$11)
    3107                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
    3108              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    3109                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3110                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    3111              DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$23)
    3112                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    3113              DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("OS_TCB"), DW_AT_type(*DW$T$29)
    3114                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    3115              DW$T$72 .dwtag  DW_TAG_typedef, DW_AT_name("OS_Q"), DW_AT_type(*DW$T$32)
    3116                      .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
    3117              
    3118              DW$T$23 .dwtag  DW_TAG_structure_type
    3119                      .dwattr DW$T$23, DW_AT_name("os_event")
    3120                      .dwattr DW$T$23, DW_AT_byte_size(0x1e)
    3121              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3122                      .dwattr DW$214, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    3123                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3124                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3125              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    3126                      .dwattr DW$215, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    3127                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3128                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3129              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    3130                      .dwattr DW$216, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    3131                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3132                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3133              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3134                      .dwattr DW$217, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    3135                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3136                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3137              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    3138                      .dwattr DW$218, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    3139                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3140                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3141              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    3142                      .dwattr DW$219, DW_AT_name("OSEventName"), DW_AT_symbol_name("_OSEventName")
    3143                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3144                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3145                      .dwendtag DW$T$23
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:04 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7562                            PAGE   60

    3146              
    3147              
    3148              DW$T$29 .dwtag  DW_TAG_structure_type
    3149                      .dwattr DW$T$29, DW_AT_name("os_tcb")
    3150                      .dwattr DW$T$29, DW_AT_byte_size(0x14)
    3151              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    3152                      .dwattr DW$220, DW_AT_name("OSTCBStkPtr"), DW_AT_symbol_name("_OSTCBStkPtr")
    3153                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3154                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3155              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    3156                      .dwattr DW$221, DW_AT_name("OSTCBNext"), DW_AT_symbol_name("_OSTCBNext")
    3157                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3158                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3159              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    3160                      .dwattr DW$222, DW_AT_name("OSTCBPrev"), DW_AT_symbol_name("_OSTCBPrev")
    3161                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3162                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3163              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    3164                      .dwattr DW$223, DW_AT_name("OSTCBEventPtr"), DW_AT_symbol_name("_OSTCBEventPtr")
    3165                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3166                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3167              DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    3168                      .dwattr DW$224, DW_AT_name("OSTCBMsg"), DW_AT_symbol_name("_OSTCBMsg")
    3169                      .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3170                      .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3171              DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    3172                      .dwattr DW$225, DW_AT_name("OSTCBDly"), DW_AT_symbol_name("_OSTCBDly")
    3173                      .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3174                      .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3175              DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3176                      .dwattr DW$226, DW_AT_name("OSTCBStat"), DW_AT_symbol_name("_OSTCBStat")
    3177                      .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3178                      .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3179              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3180                      .dwattr DW$227, DW_AT_name("OSTCBStatPend"), DW_AT_symbol_name("_OSTCBStatPend")
    3181                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3182                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3183              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3184                      .dwattr DW$228, DW_AT_name("OSTCBPrio"), DW_AT_symbol_name("_OSTCBPrio")
    3185                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3186                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3187              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3188                      .dwattr DW$229, DW_AT_name("OSTCBX"), DW_AT_symbol_name("_OSTCBX")
    3189                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3190                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3191              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3192                      .dwattr DW$230, DW_AT_name("OSTCBY"), DW_AT_symbol_name("_OSTCBY")
    3193                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3194                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3195              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3196                      .dwattr DW$231, DW_AT_name("OSTCBBitX"), DW_AT_symbol_name("_OSTCBBitX")
    3197                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3198                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3199              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3200                      .dwattr DW$232, DW_AT_name("OSTCBBitY"), DW_AT_symbol_name("_OSTCBBitY")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:04 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7562                            PAGE   61

    3201                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3202                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3203              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3204                      .dwattr DW$233, DW_AT_name("OSTCBDelReq"), DW_AT_symbol_name("_OSTCBDelReq")
    3205                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3206                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3207                      .dwendtag DW$T$29
    3208              
    3209              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    3210                      .dwattr DW$T$26, DW_AT_address_class(0x16)
    3211              
    3212              DW$T$32 .dwtag  DW_TAG_structure_type
    3213                      .dwattr DW$T$32, DW_AT_name("os_q")
    3214                      .dwattr DW$T$32, DW_AT_byte_size(0x0c)
    3215              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    3216                      .dwattr DW$234, DW_AT_name("OSQPtr"), DW_AT_symbol_name("_OSQPtr")
    3217                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3218                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3219              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3220                      .dwattr DW$235, DW_AT_name("OSQStart"), DW_AT_symbol_name("_OSQStart")
    3221                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3222                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3223              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3224                      .dwattr DW$236, DW_AT_name("OSQEnd"), DW_AT_symbol_name("_OSQEnd")
    3225                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3226                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3227              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3228                      .dwattr DW$237, DW_AT_name("OSQIn"), DW_AT_symbol_name("_OSQIn")
    3229                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3230                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3231              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3232                      .dwattr DW$238, DW_AT_name("OSQOut"), DW_AT_symbol_name("_OSQOut")
    3233                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3234                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3235              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    3236                      .dwattr DW$239, DW_AT_name("OSQSize"), DW_AT_symbol_name("_OSQSize")
    3237                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3238                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3239              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    3240                      .dwattr DW$240, DW_AT_name("OSQEntries"), DW_AT_symbol_name("_OSQEntries")
    3241                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3242                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3243                      .dwendtag DW$T$32
    3244              
    3245              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    3246                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    3247              DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$3)
    3248                      .dwattr DW$T$31, DW_AT_address_class(0x16)
    3249              
    3250              DW$T$22 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3251                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    3252                      .dwattr DW$T$22, DW_AT_byte_size(0x10)
    3253              DW$241  .dwtag  DW_TAG_subrange_type
    3254                      .dwattr DW$241, DW_AT_upper_bound(0x0f)
    3255                      .dwendtag DW$T$22
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:04 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7562                            PAGE   62

    3256              
    3257              
    3258                      .dwattr DW$38, DW_AT_external(0x01)
    3259                      .dwattr DW$38, DW_AT_type(*DW$T$19)
    3260                      .dwattr DW$45, DW_AT_external(0x01)
    3261                      .dwattr DW$52, DW_AT_external(0x01)
    3262                      .dwattr DW$53, DW_AT_external(0x01)
    3263                      .dwattr DW$54, DW_AT_external(0x01)
    3264                      .dwattr DW$55, DW_AT_external(0x01)
    3265                      .dwattr DW$56, DW_AT_external(0x01)
    3266                      .dwattr DW$68, DW_AT_external(0x01)
    3267                      .dwattr DW$68, DW_AT_type(*DW$T$20)
    3268                      .dwattr DW$69, DW_AT_external(0x01)
    3269                      .dwattr DW$70, DW_AT_external(0x01)
    3270                      .dwattr DW$70, DW_AT_type(*DW$T$19)
    3271                      .dwattr DW$87, DW_AT_external(0x01)
    3272                      .dwattr DW$83, DW_AT_external(0x01)
    3273                      .dwattr DW$93, DW_AT_external(0x01)
    3274                      .dwattr DW$119, DW_AT_external(0x01)
    3275                      .dwattr DW$126, DW_AT_external(0x01)
    3276                      .dwattr DW$135, DW_AT_external(0x01)
    3277                      .dwattr DW$138, DW_AT_external(0x01)
    3278                      .dwattr DW$138, DW_AT_type(*DW$T$19)
    3279                      .dwattr DW$147, DW_AT_external(0x01)
    3280                      .dwattr DW$147, DW_AT_type(*DW$T$19)
    3281                      .dwattr DW$159, DW_AT_external(0x01)
    3282                      .dwattr DW$159, DW_AT_type(*DW$T$19)
    3283                      .dwattr DW$154, DW_AT_external(0x01)
    3284                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    3285              
    3286              ;***************************************************************
    3287              ;* DWARF CIE ENTRIES                                           *
    3288              ;***************************************************************
    3289              
    3290              DW$CIE  .dwcie 1, 40
    3291                      .dwcfa  0x0c, 20, 0
    3292                      .dwcfa  0x07, 0
    3293                      .dwcfa  0x07, 1
    3294                      .dwcfa  0x07, 2
    3295                      .dwcfa  0x07, 3
    3296                      .dwcfa  0x07, 4
    3297                      .dwcfa  0x07, 5
    3298                      .dwcfa  0x08, 6
    3299                      .dwcfa  0x08, 7
    3300                      .dwcfa  0x08, 8
    3301                      .dwcfa  0x08, 9
    3302                      .dwcfa  0x08, 10
    3303                      .dwcfa  0x08, 11
    3304                      .dwcfa  0x07, 12
