TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:10 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2002                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Wed Jul 14 17:06:10 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("os_q.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("OS_MemClr"), DW_AT_symbol_name("_OS_MemClr")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              DW$2    .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)

     888              DW$58   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     889                      .dwendtag DW$T$35
     890              
     891              
     892              DW$T$39 .dwtag  DW_TAG_subroutine_type
     893                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     894              DW$59   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
     895              DW$60   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     896                      .dwendtag DW$T$39
     897              
     898              
     899              DW$T$41 .dwtag  DW_TAG_subroutine_type
     900                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
     901              DW$61   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
     902              DW$62   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
     903                      .dwendtag DW$T$41
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:10 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2002                            PAGE   18

     904              
     905              
     906              DW$T$43 .dwtag  DW_TAG_subroutine_type
     907                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
     908              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
     909                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     910              DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
     911                      .dwattr DW$T$33, DW_AT_address_class(0x16)
     912              
     913              DW$T$46 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     914                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
     915              DW$63   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     916              DW$64   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     917              DW$65   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     918              DW$66   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     919                      .dwendtag DW$T$46
     920              
     921              
     922              DW$T$48 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     923                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
     924              DW$67   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     925                      .dwendtag DW$T$48
     926              
     927              
     928              DW$T$49 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     929                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
     930              DW$68   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     931              DW$69   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     932                      .dwendtag DW$T$49
     933              
     934              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
     935                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     936              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
     937                      .dwattr DW$T$28, DW_AT_address_class(0x16)
     938              
     939              DW$T$50 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$28)
     940                      .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
     941              DW$70   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
     942              DW$71   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
     943                      .dwendtag DW$T$50
     944              
     945              DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
     946                      .dwattr DW$T$38, DW_AT_address_class(0x16)
     947              DW$T$52 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$51)
     948                      .dwattr DW$T$52, DW_AT_address_class(0x16)
     949              
     950              DW$T$53 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$51)
     951                      .dwattr DW$T$53, DW_AT_language(DW_LANG_C)
     952                      .dwattr DW$T$53, DW_AT_byte_size(0x3c)
     953              DW$72   .dwtag  DW_TAG_subrange_type
     954                      .dwattr DW$72, DW_AT_upper_bound(0x04)
     955                      .dwendtag DW$T$53
     956              
     957              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     958                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:10 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2002                            PAGE   19

     959                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
     960              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     961                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     962                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     963              DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$23)
     964                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     965              DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("OS_TCB"), DW_AT_type(*DW$T$29)
     966                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
     967              DW$T$51 .dwtag  DW_TAG_typedef, DW_AT_name("OS_Q"), DW_AT_type(*DW$T$32)
     968                      .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
     969              
     970              DW$T$23 .dwtag  DW_TAG_structure_type
     971                      .dwattr DW$T$23, DW_AT_name("os_event")
     972                      .dwattr DW$T$23, DW_AT_byte_size(0x1e)
     973              DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     974                      .dwattr DW$73, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
     975                      .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976                      .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     977              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     978                      .dwattr DW$74, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
     979                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     980                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     981              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     982                      .dwattr DW$75, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
     983                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     984                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     985              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     986                      .dwattr DW$76, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
     987                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     988                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     989              DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     990                      .dwattr DW$77, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
     991                      .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     992                      .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     993              DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     994                      .dwattr DW$78, DW_AT_name("OSEventName"), DW_AT_symbol_name("_OSEventName")
     995                      .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     996                      .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     997                      .dwendtag DW$T$23
     998              
     999              
    1000              DW$T$29 .dwtag  DW_TAG_structure_type
    1001                      .dwattr DW$T$29, DW_AT_name("os_tcb")
    1002                      .dwattr DW$T$29, DW_AT_byte_size(0x14)
    1003              DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1004                      .dwattr DW$79, DW_AT_name("OSTCBStkPtr"), DW_AT_symbol_name("_OSTCBStkPtr")
    1005                      .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                      .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1007              DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1008                      .dwattr DW$80, DW_AT_name("OSTCBNext"), DW_AT_symbol_name("_OSTCBNext")
    1009                      .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1010                      .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1011              DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1012                      .dwattr DW$81, DW_AT_name("OSTCBPrev"), DW_AT_symbol_name("_OSTCBPrev")
    1013                      .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:10 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2002                            PAGE   20

    1014                      .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1015              DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1016                      .dwattr DW$82, DW_AT_name("OSTCBEventPtr"), DW_AT_symbol_name("_OSTCBEventPtr")
    1017                      .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1018                      .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1019              DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1020                      .dwattr DW$83, DW_AT_name("OSTCBMsg"), DW_AT_symbol_name("_OSTCBMsg")
    1021                      .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1022                      .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1023              DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1024                      .dwattr DW$84, DW_AT_name("OSTCBDly"), DW_AT_symbol_name("_OSTCBDly")
    1025                      .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1026                      .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1027              DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1028                      .dwattr DW$85, DW_AT_name("OSTCBStat"), DW_AT_symbol_name("_OSTCBStat")
    1029                      .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1030                      .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1031              DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1032                      .dwattr DW$86, DW_AT_name("OSTCBStatPend"), DW_AT_symbol_name("_OSTCBStatPend")
    1033                      .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1034                      .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1035              DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1036                      .dwattr DW$87, DW_AT_name("OSTCBPrio"), DW_AT_symbol_name("_OSTCBPrio")
    1037                      .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1038                      .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1039              DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1040                      .dwattr DW$88, DW_AT_name("OSTCBX"), DW_AT_symbol_name("_OSTCBX")
    1041                      .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1042                      .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1043              DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1044                      .dwattr DW$89, DW_AT_name("OSTCBY"), DW_AT_symbol_name("_OSTCBY")
    1045                      .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1046                      .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1047              DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1048                      .dwattr DW$90, DW_AT_name("OSTCBBitX"), DW_AT_symbol_name("_OSTCBBitX")
    1049                      .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1050                      .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1051              DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1052                      .dwattr DW$91, DW_AT_name("OSTCBBitY"), DW_AT_symbol_name("_OSTCBBitY")
    1053                      .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1054                      .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1055              DW$92   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1056                      .dwattr DW$92, DW_AT_name("OSTCBDelReq"), DW_AT_symbol_name("_OSTCBDelReq")
    1057                      .dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1058                      .dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1059                      .dwendtag DW$T$29
    1060              
    1061              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    1062                      .dwattr DW$T$26, DW_AT_address_class(0x16)
    1063              
    1064              DW$T$32 .dwtag  DW_TAG_structure_type
    1065                      .dwattr DW$T$32, DW_AT_name("os_q")
    1066                      .dwattr DW$T$32, DW_AT_byte_size(0x0c)
    1067              DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1068                      .dwattr DW$93, DW_AT_name("OSQPtr"), DW_AT_symbol_name("_OSQPtr")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:10 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2002                            PAGE   21

    1069                      .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                      .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1071              DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    1072                      .dwattr DW$94, DW_AT_name("OSQStart"), DW_AT_symbol_name("_OSQStart")
    1073                      .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1074                      .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1075              DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    1076                      .dwattr DW$95, DW_AT_name("OSQEnd"), DW_AT_symbol_name("_OSQEnd")
    1077                      .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1078                      .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1079              DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    1080                      .dwattr DW$96, DW_AT_name("OSQIn"), DW_AT_symbol_name("_OSQIn")
    1081                      .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1082                      .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1083              DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    1084                      .dwattr DW$97, DW_AT_name("OSQOut"), DW_AT_symbol_name("_OSQOut")
    1085                      .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1086                      .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1087              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1088                      .dwattr DW$98, DW_AT_name("OSQSize"), DW_AT_symbol_name("_OSQSize")
    1089                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1090                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1091              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1092                      .dwattr DW$99, DW_AT_name("OSQEntries"), DW_AT_symbol_name("_OSQEntries")
    1093                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1094                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1095                      .dwendtag DW$T$32
    1096              
    1097              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    1098                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    1099              
    1100              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    1101                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    1102                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    1103              DW$100  .dwtag  DW_TAG_subrange_type
    1104                      .dwattr DW$100, DW_AT_upper_bound(0x07)
    1105                      .dwendtag DW$T$21
    1106              
    1107              
    1108              DW$T$22 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    1109                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    1110                      .dwattr DW$T$22, DW_AT_byte_size(0x10)
    1111              DW$101  .dwtag  DW_TAG_subrange_type
    1112                      .dwattr DW$101, DW_AT_upper_bound(0x0f)
    1113                      .dwendtag DW$T$22
    1114              
    1115              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    1116                      .dwattr DW$T$25, DW_AT_address_class(0x16)
    1117              DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("OS_STK"), DW_AT_type(*DW$T$11)
    1118                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
    1119              
    1120                      .dwattr DW$23, DW_AT_external(0x01)
    1121                      .dwattr DW$23, DW_AT_type(*DW$T$28)
    1122                      .dwattr DW$30, DW_AT_external(0x01)
    1123                      .dwattr DW$30, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:10 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2002                            PAGE   22

    1124                      .dwattr DW$34, DW_AT_external(0x01)
    1125                      .dwattr DW$34, DW_AT_type(*DW$T$3)
    1126                      .dwattr DW$43, DW_AT_external(0x01)
    1127                      .dwattr DW$43, DW_AT_type(*DW$T$19)
    1128                      .dwattr DW$49, DW_AT_external(0x01)
    1129                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1130              
    1131              ;***************************************************************
    1132              ;* DWARF CIE ENTRIES                                           *
    1133              ;***************************************************************
    1134              
    1135              DW$CIE  .dwcie 1, 40
    1136                      .dwcfa  0x0c, 20, 0
    1137                      .dwcfa  0x07, 0
    1138                      .dwcfa  0x07, 1
    1139                      .dwcfa  0x07, 2
    1140                      .dwcfa  0x07, 3
    1141                      .dwcfa  0x07, 4
    1142                      .dwcfa  0x07, 5
    1143                      .dwcfa  0x08, 6
    1144                      .dwcfa  0x08, 7
    1145                      .dwcfa  0x08, 8
    1146                      .dwcfa  0x08, 9
    1147                      .dwcfa  0x08, 10
    1148                      .dwcfa  0x08, 11
    1149                      .dwcfa  0x07, 12
    1150                      .dwcfa  0x07, 13
    1151                      .dwcfa  0x07, 14
    1152                      .dwcfa  0x07, 15
    1153                      .dwcfa  0x07, 16
    1154                      .dwcfa  0x07, 17
    1155                      .dwcfa  0x07, 18
    1156                      .dwcfa  0x07, 19
    1157                      .dwcfa  0x07, 20
    1158                      .dwcfa  0x07, 21
    1159                      .dwcfa  0x07, 22
    1160                      .dwcfa  0x07, 23
