TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2802                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Wed Jul 14 17:06:11 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("os_sem.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("OS_Sched"), DW_AT_symbol_name("_OS_Sched")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              

     488              ;***************************************************************
     489              ;* UNDEFINED EXTERNAL REFERENCES                               *
     490              ;***************************************************************
     491                      .global _OS_Sched
     492                      .global _OS_EventWaitListInit
     493                      .global _OS_EventTaskWait
     494                      .global _OS_EventTaskRemove
     495                      .global _OSIntNesting
     496                      .global _OSLockNesting
     497                      .global _OS_EventTaskRdy
     498                      .global _OSTCBCur
     499                      .global _OSEventFreeList
     500              
     501              ;***************************************************************
     502              ;* TYPE INFORMATION                                            *
     503              ;***************************************************************
     504              DW$T$3  .dwtag  DW_TAG_pointer_type
     505                      .dwattr DW$T$3, DW_AT_address_class(0x16)
     506              
     507              DW$T$30 .dwtag  DW_TAG_subroutine_type
     508                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     509              DW$32   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     510                      .dwendtag DW$T$30
     511              
     512              
     513              DW$T$34 .dwtag  DW_TAG_subroutine_type
     514                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     515              DW$33   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
     516              DW$34   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     517                      .dwendtag DW$T$34
     518              
     519              
     520              DW$T$36 .dwtag  DW_TAG_subroutine_type
     521                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
     522              
     523              DW$T$39 .dwtag  DW_TAG_subroutine_type
     524                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     525              DW$35   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     526              DW$36   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
     527              DW$37   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
     528                      .dwendtag DW$T$39
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2802                            PAGE   11

     529              
     530              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
     531                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     532              DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
     533                      .dwattr DW$T$38, DW_AT_address_class(0x16)
     534              
     535              DW$T$41 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     536                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
     537              DW$38   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     538              DW$39   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     539              DW$40   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     540              DW$41   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     541                      .dwendtag DW$T$41
     542              
     543              
     544              DW$T$43 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     545                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
     546              DW$42   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     547                      .dwendtag DW$T$43
     548              
     549              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
     550                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     551              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
     552                      .dwattr DW$T$28, DW_AT_address_class(0x16)
     553              
     554              DW$T$44 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$28)
     555                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
     556              DW$43   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
     557                      .dwendtag DW$T$44
     558              
     559              DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
     560                      .dwattr DW$T$33, DW_AT_address_class(0x16)
     561              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     562                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     563                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
     564              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     565                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     566                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     567              DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$23)
     568                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     569              DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("OS_TCB"), DW_AT_type(*DW$T$29)
     570                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
     571              
     572              DW$T$23 .dwtag  DW_TAG_structure_type
     573                      .dwattr DW$T$23, DW_AT_name("os_event")
     574                      .dwattr DW$T$23, DW_AT_byte_size(0x1e)
     575              DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     576                      .dwattr DW$44, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
     577                      .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     578                      .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
     579              DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     580                      .dwattr DW$45, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
     581                      .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     582                      .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
     583              DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2802                            PAGE   12

     584                      .dwattr DW$46, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
     585                      .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     586                      .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
     587              DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     588                      .dwattr DW$47, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
     589                      .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     590                      .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     591              DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     592                      .dwattr DW$48, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
     593                      .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     594                      .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     595              DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     596                      .dwattr DW$49, DW_AT_name("OSEventName"), DW_AT_symbol_name("_OSEventName")
     597                      .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     598                      .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     599                      .dwendtag DW$T$23
     600              
     601              
     602              DW$T$29 .dwtag  DW_TAG_structure_type
     603                      .dwattr DW$T$29, DW_AT_name("os_tcb")
     604                      .dwattr DW$T$29, DW_AT_byte_size(0x14)
     605              DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     606                      .dwattr DW$50, DW_AT_name("OSTCBStkPtr"), DW_AT_symbol_name("_OSTCBStkPtr")
     607                      .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     608                      .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     609              DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     610                      .dwattr DW$51, DW_AT_name("OSTCBNext"), DW_AT_symbol_name("_OSTCBNext")
     611                      .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     612                      .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
     613              DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     614                      .dwattr DW$52, DW_AT_name("OSTCBPrev"), DW_AT_symbol_name("_OSTCBPrev")
     615                      .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     616                      .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     617              DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     618                      .dwattr DW$53, DW_AT_name("OSTCBEventPtr"), DW_AT_symbol_name("_OSTCBEventPtr")
     619                      .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     620                      .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
     621              DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     622                      .dwattr DW$54, DW_AT_name("OSTCBMsg"), DW_AT_symbol_name("_OSTCBMsg")
     623                      .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     624                      .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     625              DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     626                      .dwattr DW$55, DW_AT_name("OSTCBDly"), DW_AT_symbol_name("_OSTCBDly")
     627                      .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     628                      .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     629              DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     630                      .dwattr DW$56, DW_AT_name("OSTCBStat"), DW_AT_symbol_name("_OSTCBStat")
     631                      .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     632                      .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     633              DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     634                      .dwattr DW$57, DW_AT_name("OSTCBStatPend"), DW_AT_symbol_name("_OSTCBStatPend")
     635                      .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     636                      .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     637              DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     638                      .dwattr DW$58, DW_AT_name("OSTCBPrio"), DW_AT_symbol_name("_OSTCBPrio")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2802                            PAGE   13

     639                      .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     640                      .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     641              DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     642                      .dwattr DW$59, DW_AT_name("OSTCBX"), DW_AT_symbol_name("_OSTCBX")
     643                      .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     644                      .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     645              DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     646                      .dwattr DW$60, DW_AT_name("OSTCBY"), DW_AT_symbol_name("_OSTCBY")
     647                      .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     648                      .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     649              DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     650                      .dwattr DW$61, DW_AT_name("OSTCBBitX"), DW_AT_symbol_name("_OSTCBBitX")
     651                      .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     652                      .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     653              DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     654                      .dwattr DW$62, DW_AT_name("OSTCBBitY"), DW_AT_symbol_name("_OSTCBBitY")
     655                      .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     656                      .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     657              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     658                      .dwattr DW$63, DW_AT_name("OSTCBDelReq"), DW_AT_symbol_name("_OSTCBDelReq")
     659                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     660                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     661                      .dwendtag DW$T$29
     662              
     663              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
     664                      .dwattr DW$T$26, DW_AT_address_class(0x16)
     665              
     666              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
     667                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
     668                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
     669              DW$64   .dwtag  DW_TAG_subrange_type
     670                      .dwattr DW$64, DW_AT_upper_bound(0x07)
     671                      .dwendtag DW$T$21
     672              
     673              
     674              DW$T$22 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
     675                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
     676                      .dwattr DW$T$22, DW_AT_byte_size(0x10)
     677              DW$65   .dwtag  DW_TAG_subrange_type
     678                      .dwattr DW$65, DW_AT_upper_bound(0x0f)
     679                      .dwendtag DW$T$22
     680              
     681              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
     682                      .dwattr DW$T$25, DW_AT_address_class(0x16)
     683              DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("OS_STK"), DW_AT_type(*DW$T$11)
     684                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
     685              
     686                      .dwattr DW$18, DW_AT_external(0x01)
     687                      .dwattr DW$18, DW_AT_type(*DW$T$28)
     688                      .dwattr DW$22, DW_AT_external(0x01)
     689                      .dwattr DW$29, DW_AT_external(0x01)
     690                      .dwattr DW$29, DW_AT_type(*DW$T$19)
     691                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     692              
     693              ;***************************************************************
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2802                            PAGE   14

     694              ;* DWARF CIE ENTRIES                                           *
     695              ;***************************************************************
     696              
     697              DW$CIE  .dwcie 1, 40
     698                      .dwcfa  0x0c, 20, 0
     699                      .dwcfa  0x07, 0
     700                      .dwcfa  0x07, 1
     701                      .dwcfa  0x07, 2
     702                      .dwcfa  0x07, 3
     703                      .dwcfa  0x07, 4
     704                      .dwcfa  0x07, 5
     705                      .dwcfa  0x08, 6
     706                      .dwcfa  0x08, 7
     707                      .dwcfa  0x08, 8
     708                      .dwcfa  0x08, 9
     709                      .dwcfa  0x08, 10
     710                      .dwcfa  0x08, 11
     711                      .dwcfa  0x07, 12
     712                      .dwcfa  0x07, 13
     713                      .dwcfa  0x07, 14
     714                      .dwcfa  0x07, 15
     715                      .dwcfa  0x07, 16
     716                      .dwcfa  0x07, 17
     717                      .dwcfa  0x07, 18
     718                      .dwcfa  0x07, 19
     719                      .dwcfa  0x07, 20
     720                      .dwcfa  0x07, 21
     721                      .dwcfa  0x07, 22
     722                      .dwcfa  0x07, 23
     723                      .dwcfa  0x07, 24
     724                      .dwcfa  0x07, 25
     725                      .dwcfa  0x07, 26
     726                      .dwcfa  0x08, 27
     727                      .dwcfa  0x07, 28
     728                      .dwcfa  0x07, 29
