TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:12 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2122                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Wed Jul 14 17:06:12 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("os_task.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("OS_Sched"), DW_AT_symbol_name("_OS_Sched")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              

     710                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
     711              DW$54   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     712              DW$55   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
     713              DW$56   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
     714              DW$57   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
     715              DW$58   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
     716              DW$59   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     717              DW$60   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
     718                      .dwendtag DW$T$41
     719              
     720              
     721              DW$T$43 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     722                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
     723              DW$61   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$39)
     724              DW$62   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     725              DW$63   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
     726              DW$64   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     727                      .dwendtag DW$T$43
     728              
     729              
     730              DW$T$44 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     731                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
     732              DW$65   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     733                      .dwendtag DW$T$44
     734              
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:12 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2122                            PAGE   15

     735              DW$T$46 .dwtag  DW_TAG_typedef, DW_AT_name("BOOLEAN"), DW_AT_type(*DW$T$6)
     736                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
     737              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
     738                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     739              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
     740                      .dwattr DW$T$25, DW_AT_address_class(0x16)
     741              
     742              DW$T$47 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$25)
     743                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
     744              DW$66   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$39)
     745              DW$67   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     746              DW$68   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
     747              DW$69   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
     748                      .dwendtag DW$T$47
     749              
     750              DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("INT32U"), DW_AT_type(*DW$T$13)
     751                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     752              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
     753                      .dwattr DW$T$28, DW_AT_address_class(0x16)
     754              DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
     755                      .dwattr DW$T$33, DW_AT_address_class(0x16)
     756              
     757              DW$T$49 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$33)
     758                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
     759                      .dwattr DW$T$49, DW_AT_byte_size(0x80)
     760              DW$70   .dwtag  DW_TAG_subrange_type
     761                      .dwattr DW$70, DW_AT_upper_bound(0x3f)
     762                      .dwendtag DW$T$49
     763              
     764              
     765              DW$T$38 .dwtag  DW_TAG_subroutine_type
     766                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     767              DW$71   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     768                      .dwendtag DW$T$38
     769              
     770              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     771                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     772                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
     773              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     774                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     775                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     776              DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("OS_STK"), DW_AT_type(*DW$T$11)
     777                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
     778              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
     779                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     780                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
     781              DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$23)
     782                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     783              DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("OS_TCB"), DW_AT_type(*DW$T$29)
     784                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
     785              
     786              DW$T$23 .dwtag  DW_TAG_structure_type
     787                      .dwattr DW$T$23, DW_AT_name("os_event")
     788                      .dwattr DW$T$23, DW_AT_byte_size(0x1e)
     789              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:12 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2122                            PAGE   16

     790                      .dwattr DW$72, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
     791                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     792                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     793              DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     794                      .dwattr DW$73, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
     795                      .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     796                      .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     797              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     798                      .dwattr DW$74, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
     799                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     800                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     801              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     802                      .dwattr DW$75, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
     803                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     804                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     805              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     806                      .dwattr DW$76, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
     807                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     808                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     809              DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     810                      .dwattr DW$77, DW_AT_name("OSEventName"), DW_AT_symbol_name("_OSEventName")
     811                      .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     812                      .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     813                      .dwendtag DW$T$23
     814              
     815              
     816              DW$T$29 .dwtag  DW_TAG_structure_type
     817                      .dwattr DW$T$29, DW_AT_name("os_tcb")
     818                      .dwattr DW$T$29, DW_AT_byte_size(0x14)
     819              DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     820                      .dwattr DW$78, DW_AT_name("OSTCBStkPtr"), DW_AT_symbol_name("_OSTCBStkPtr")
     821                      .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     822                      .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     823              DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     824                      .dwattr DW$79, DW_AT_name("OSTCBNext"), DW_AT_symbol_name("_OSTCBNext")
     825                      .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     826                      .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     827              DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     828                      .dwattr DW$80, DW_AT_name("OSTCBPrev"), DW_AT_symbol_name("_OSTCBPrev")
     829                      .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     830                      .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
     831              DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     832                      .dwattr DW$81, DW_AT_name("OSTCBEventPtr"), DW_AT_symbol_name("_OSTCBEventPtr")
     833                      .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     834                      .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
     835              DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     836                      .dwattr DW$82, DW_AT_name("OSTCBMsg"), DW_AT_symbol_name("_OSTCBMsg")
     837                      .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     838                      .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
     839              DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     840                      .dwattr DW$83, DW_AT_name("OSTCBDly"), DW_AT_symbol_name("_OSTCBDly")
     841                      .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     842                      .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
     843              DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     844                      .dwattr DW$84, DW_AT_name("OSTCBStat"), DW_AT_symbol_name("_OSTCBStat")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:12 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2122                            PAGE   17

     845                      .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     846                      .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
     847              DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     848                      .dwattr DW$85, DW_AT_name("OSTCBStatPend"), DW_AT_symbol_name("_OSTCBStatPend")
     849                      .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     850                      .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
     851              DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     852                      .dwattr DW$86, DW_AT_name("OSTCBPrio"), DW_AT_symbol_name("_OSTCBPrio")
     853                      .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     854                      .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
     855              DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     856                      .dwattr DW$87, DW_AT_name("OSTCBX"), DW_AT_symbol_name("_OSTCBX")
     857                      .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     858                      .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
     859              DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     860                      .dwattr DW$88, DW_AT_name("OSTCBY"), DW_AT_symbol_name("_OSTCBY")
     861                      .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     862                      .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
     863              DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     864                      .dwattr DW$89, DW_AT_name("OSTCBBitX"), DW_AT_symbol_name("_OSTCBBitX")
     865                      .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     866                      .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
     867              DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     868                      .dwattr DW$90, DW_AT_name("OSTCBBitY"), DW_AT_symbol_name("_OSTCBBitY")
     869                      .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     870                      .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
     871              DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     872                      .dwattr DW$91, DW_AT_name("OSTCBDelReq"), DW_AT_symbol_name("_OSTCBDelReq")
     873                      .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     874                      .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
     875                      .dwendtag DW$T$29
     876              
     877              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
     878                      .dwattr DW$T$26, DW_AT_address_class(0x16)
     879              
     880              DW$T$22 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
     881                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
     882                      .dwattr DW$T$22, DW_AT_byte_size(0x10)
     883              DW$92   .dwtag  DW_TAG_subrange_type
     884                      .dwattr DW$92, DW_AT_upper_bound(0x0f)
     885                      .dwendtag DW$T$22
     886              
     887              
     888                      .dwattr DW$31, DW_AT_external(0x01)
     889                      .dwattr DW$31, DW_AT_type(*DW$T$19)
     890                      .dwattr DW$41, DW_AT_external(0x01)
     891                      .dwattr DW$41, DW_AT_type(*DW$T$19)
     892                      .dwattr DW$45, DW_AT_external(0x01)
     893                      .dwattr DW$45, DW_AT_type(*DW$T$19)
     894                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     895              
     896              ;***************************************************************
     897              ;* DWARF CIE ENTRIES                                           *
     898              ;***************************************************************
     899              
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jul 14 17:06:12 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2122                            PAGE   18

     900              DW$CIE  .dwcie 1, 40
     901                      .dwcfa  0x0c, 20, 0
     902                      .dwcfa  0x07, 0
     903                      .dwcfa  0x07, 1
     904                      .dwcfa  0x07, 2
     905                      .dwcfa  0x07, 3
     906                      .dwcfa  0x07, 4
     907                      .dwcfa  0x07, 5
     908                      .dwcfa  0x08, 6
     909                      .dwcfa  0x08, 7
     910                      .dwcfa  0x08, 8
     911                      .dwcfa  0x08, 9
     912                      .dwcfa  0x08, 10
     913                      .dwcfa  0x08, 11
     914                      .dwcfa  0x07, 12
     915                      .dwcfa  0x07, 13
     916                      .dwcfa  0x07, 14
     917                      .dwcfa  0x07, 15
     918                      .dwcfa  0x07, 16
     919                      .dwcfa  0x07, 17
     920                      .dwcfa  0x07, 18
     921                      .dwcfa  0x07, 19
     922                      .dwcfa  0x07, 20
     923                      .dwcfa  0x07, 21
     924                      .dwcfa  0x07, 22
     925                      .dwcfa  0x07, 23
     926                      .dwcfa  0x07, 24
     927                      .dwcfa  0x07, 25
     928                      .dwcfa  0x07, 26
     929                      .dwcfa  0x08, 27
     930                      .dwcfa  0x07, 28
     931                      .dwcfa  0x07, 29
     932                      .dwcfa  0x07, 30
     933                      .dwcfa  0x07, 31
     934                      .dwcfa  0x07, 32
     935                      .dwcfa  0x07, 33
     936                      .dwcfa  0x07, 34
     937                      .dwcfa  0x07, 35
     938                      .dwcfa  0x07, 36
     939                      .dwcfa  0x07, 37
     940                      .dwcfa  0x07, 38
     941                      .dwcfa  0x07, 39
     942                      .dwcfa  0x07, 40
     943              
     944              ;***************************************************************
