TMS320C2000 COFF Assembler PC v4.1.3 Thu Jul 15 08:50:48 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6202                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Jul 15 08:50:47 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("uCOS_II.C")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("OSTaskIdleHook"), DW_AT_symbol_name("_OSTaskIdleHook")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              

    4933                      .dwattr DW$292, DW_AT_upper_bound(0xff)
    4934                      .dwendtag DW$T$76
    4935              
    4936              DW$T$62 .dwtag  DW_TAG_typedef, DW_AT_name("INT32U"), DW_AT_type(*DW$T$13)
    4937                      .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
    4938              DW$293  .dwtag  DW_TAG_far_type
    4939                      .dwattr DW$293, DW_AT_type(*DW$T$62)
    4940              DW$T$78 .dwtag  DW_TAG_volatile_type
    4941                      .dwattr DW$T$78, DW_AT_type(*DW$293)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Jul 15 08:50:48 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6202                            PAGE   94

    4942              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
    4943                      .dwattr DW$T$28, DW_AT_address_class(0x16)
    4944              
    4945              DW$T$79 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$28)
    4946                      .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
    4947              DW$294  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
    4948              DW$295  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
    4949                      .dwendtag DW$T$79
    4950              
    4951              
    4952              DW$T$80 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$28)
    4953                      .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    4954              DW$296  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
    4955                      .dwendtag DW$T$80
    4956              
    4957              
    4958              DW$T$81 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$27)
    4959                      .dwattr DW$T$81, DW_AT_language(DW_LANG_C)
    4960                      .dwattr DW$T$81, DW_AT_byte_size(0x258)
    4961              DW$297  .dwtag  DW_TAG_subrange_type
    4962                      .dwattr DW$297, DW_AT_upper_bound(0x13)
    4963                      .dwendtag DW$T$81
    4964              
    4965              DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
    4966                      .dwattr DW$T$38, DW_AT_address_class(0x16)
    4967              
    4968              DW$T$82 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$38)
    4969                      .dwattr DW$T$82, DW_AT_language(DW_LANG_C)
    4970                      .dwattr DW$T$82, DW_AT_byte_size(0x80)
    4971              DW$298  .dwtag  DW_TAG_subrange_type
    4972                      .dwattr DW$298, DW_AT_upper_bound(0x3f)
    4973                      .dwendtag DW$T$82
    4974              
    4975              
    4976              DW$T$84 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$37)
    4977                      .dwattr DW$T$84, DW_AT_language(DW_LANG_C)
    4978                      .dwattr DW$T$84, DW_AT_byte_size(0x1a4)
    4979              DW$299  .dwtag  DW_TAG_subrange_type
    4980                      .dwattr DW$299, DW_AT_upper_bound(0x14)
    4981                      .dwendtag DW$T$84
    4982              
    4983              DW$T$86 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$85)
    4984                      .dwattr DW$T$86, DW_AT_address_class(0x16)
    4985              
    4986              DW$T$87 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$85)
    4987                      .dwattr DW$T$87, DW_AT_language(DW_LANG_C)
    4988                      .dwattr DW$T$87, DW_AT_byte_size(0x3c)
    4989              DW$300  .dwtag  DW_TAG_subrange_type
    4990                      .dwattr DW$300, DW_AT_upper_bound(0x04)
    4991                      .dwendtag DW$T$87
    4992              
    4993              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    4994                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4995                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    4996              DW$301  .dwtag  DW_TAG_far_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Jul 15 08:50:48 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6202                            PAGE   95

    4997                      .dwattr DW$301, DW_AT_type(*DW$T$19)
    4998              DW$T$70 .dwtag  DW_TAG_const_type
    4999                      .dwattr DW$T$70, DW_AT_type(*DW$301)
    5000              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    5001                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    5002                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    5003              DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("OS_STK"), DW_AT_type(*DW$T$11)
    5004                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
    5005              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    5006                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    5007                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    5008              DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$23)
    5009                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    5010              DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("OS_TCB"), DW_AT_type(*DW$T$29)
    5011                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    5012              DW$T$85 .dwtag  DW_TAG_typedef, DW_AT_name("OS_Q"), DW_AT_type(*DW$T$32)
    5013                      .dwattr DW$T$85, DW_AT_language(DW_LANG_C)
    5014              
    5015              DW$T$23 .dwtag  DW_TAG_structure_type
    5016                      .dwattr DW$T$23, DW_AT_name("os_event")
    5017                      .dwattr DW$T$23, DW_AT_byte_size(0x1e)
    5018              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5019                      .dwattr DW$302, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    5020                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5021                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    5022              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    5023                      .dwattr DW$303, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    5024                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5025                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5026              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    5027                      .dwattr DW$304, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    5028                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5029                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5030              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5031                      .dwattr DW$305, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    5032                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5033                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5034              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    5035                      .dwattr DW$306, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    5036                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5037                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    5038              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    5039                      .dwattr DW$307, DW_AT_name("OSEventName"), DW_AT_symbol_name("_OSEventName")
    5040                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5041                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    5042                      .dwendtag DW$T$23
    5043              
    5044              
    5045              DW$T$29 .dwtag  DW_TAG_structure_type
    5046                      .dwattr DW$T$29, DW_AT_name("os_tcb")
    5047                      .dwattr DW$T$29, DW_AT_byte_size(0x14)
    5048              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    5049                      .dwattr DW$308, DW_AT_name("OSTCBStkPtr"), DW_AT_symbol_name("_OSTCBStkPtr")
    5050                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5051                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Jul 15 08:50:48 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6202                            PAGE   96

    5052              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    5053                      .dwattr DW$309, DW_AT_name("OSTCBNext"), DW_AT_symbol_name("_OSTCBNext")
    5054                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5055                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    5056              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    5057                      .dwattr DW$310, DW_AT_name("OSTCBPrev"), DW_AT_symbol_name("_OSTCBPrev")
    5058                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5059                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    5060              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    5061                      .dwattr DW$311, DW_AT_name("OSTCBEventPtr"), DW_AT_symbol_name("_OSTCBEventPtr")
    5062                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5063                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    5064              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    5065                      .dwattr DW$312, DW_AT_name("OSTCBMsg"), DW_AT_symbol_name("_OSTCBMsg")
    5066                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5067                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5068              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    5069                      .dwattr DW$313, DW_AT_name("OSTCBDly"), DW_AT_symbol_name("_OSTCBDly")
    5070                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5071                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    5072              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5073                      .dwattr DW$314, DW_AT_name("OSTCBStat"), DW_AT_symbol_name("_OSTCBStat")
    5074                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5075                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    5076              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5077                      .dwattr DW$315, DW_AT_name("OSTCBStatPend"), DW_AT_symbol_name("_OSTCBStatPend")
    5078                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5079                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    5080              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5081                      .dwattr DW$316, DW_AT_name("OSTCBPrio"), DW_AT_symbol_name("_OSTCBPrio")
    5082                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5083                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    5084              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5085                      .dwattr DW$317, DW_AT_name("OSTCBX"), DW_AT_symbol_name("_OSTCBX")
    5086                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5087                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    5088              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5089                      .dwattr DW$318, DW_AT_name("OSTCBY"), DW_AT_symbol_name("_OSTCBY")
    5090                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5091                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    5092              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5093                      .dwattr DW$319, DW_AT_name("OSTCBBitX"), DW_AT_symbol_name("_OSTCBBitX")
    5094                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5095                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    5096              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5097                      .dwattr DW$320, DW_AT_name("OSTCBBitY"), DW_AT_symbol_name("_OSTCBBitY")
    5098                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5099                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    5100              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5101                      .dwattr DW$321, DW_AT_name("OSTCBDelReq"), DW_AT_symbol_name("_OSTCBDelReq")
    5102                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5103                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    5104                      .dwendtag DW$T$29
    5105              
    5106              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Jul 15 08:50:48 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6202                            PAGE   97

    5107                      .dwattr DW$T$26, DW_AT_address_class(0x16)
    5108              
    5109              DW$T$32 .dwtag  DW_TAG_structure_type
    5110                      .dwattr DW$T$32, DW_AT_name("os_q")
    5111                      .dwattr DW$T$32, DW_AT_byte_size(0x0c)
    5112              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    5113                      .dwattr DW$322, DW_AT_name("OSQPtr"), DW_AT_symbol_name("_OSQPtr")
    5114                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5115                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5116              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5117                      .dwattr DW$323, DW_AT_name("OSQStart"), DW_AT_symbol_name("_OSQStart")
    5118                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5119                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5120              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5121                      .dwattr DW$324, DW_AT_name("OSQEnd"), DW_AT_symbol_name("_OSQEnd")
    5122                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5123                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5124              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5125                      .dwattr DW$325, DW_AT_name("OSQIn"), DW_AT_symbol_name("_OSQIn")
    5126                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5127                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5128              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5129                      .dwattr DW$326, DW_AT_name("OSQOut"), DW_AT_symbol_name("_OSQOut")
    5130                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5131                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5132              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    5133                      .dwattr DW$327, DW_AT_name("OSQSize"), DW_AT_symbol_name("_OSQSize")
    5134                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5135                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5136              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    5137                      .dwattr DW$328, DW_AT_name("OSQEntries"), DW_AT_symbol_name("_OSQEntries")
    5138                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5139                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5140                      .dwendtag DW$T$32
    5141              
    5142              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    5143                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    5144              
    5145              DW$T$22 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    5146                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    5147                      .dwattr DW$T$22, DW_AT_byte_size(0x10)
    5148              DW$329  .dwtag  DW_TAG_subrange_type
    5149                      .dwattr DW$329, DW_AT_upper_bound(0x0f)
    5150                      .dwendtag DW$T$22
    5151              
    5152              
    5153                      .dwattr DW$39, DW_AT_external(0x01)
    5154                      .dwattr DW$39, DW_AT_type(*DW$T$19)
    5155                      .dwattr DW$46, DW_AT_external(0x01)
    5156                      .dwattr DW$53, DW_AT_external(0x01)
    5157                      .dwattr DW$54, DW_AT_external(0x01)
    5158                      .dwattr DW$55, DW_AT_external(0x01)
    5159                      .dwattr DW$172, DW_AT_external(0x01)
    5160                      .dwattr DW$172, DW_AT_type(*DW$T$28)
    5161                      .dwattr DW$179, DW_AT_external(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Jul 15 08:50:48 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6202                            PAGE   98

    5162                      .dwattr DW$179, DW_AT_type(*DW$T$19)
    5163                      .dwattr DW$183, DW_AT_external(0x01)
    5164                      .dwattr DW$183, DW_AT_type(*DW$T$3)
    5165                      .dwattr DW$192, DW_AT_external(0x01)
    5166                      .dwattr DW$192, DW_AT_type(*DW$T$19)
    5167                      .dwattr DW$204, DW_AT_external(0x01)
    5168                      .dwattr DW$204, DW_AT_type(*DW$T$28)
    5169                      .dwattr DW$208, DW_AT_external(0x01)
    5170                      .dwattr DW$215, DW_AT_external(0x01)
    5171                      .dwattr DW$215, DW_AT_type(*DW$T$19)
    5172                      .dwattr DW$56, DW_AT_external(0x01)
    5173                      .dwattr DW$218, DW_AT_external(0x01)
    5174                      .dwattr DW$218, DW_AT_type(*DW$T$19)
    5175                      .dwattr DW$228, DW_AT_external(0x01)
    5176                      .dwattr DW$228, DW_AT_type(*DW$T$19)
    5177                      .dwattr DW$232, DW_AT_external(0x01)
    5178                      .dwattr DW$232, DW_AT_type(*DW$T$19)
    5179                      .dwattr DW$237, DW_AT_external(0x01)
    5180                      .dwattr DW$57, DW_AT_external(0x01)
    5181                      .dwattr DW$69, DW_AT_external(0x01)
    5182                      .dwattr DW$69, DW_AT_type(*DW$T$20)
    5183                      .dwattr DW$70, DW_AT_external(0x01)
    5184                      .dwattr DW$71, DW_AT_external(0x01)
    5185                      .dwattr DW$71, DW_AT_type(*DW$T$19)
    5186                      .dwattr DW$88, DW_AT_external(0x01)
    5187                      .dwattr DW$84, DW_AT_external(0x01)
    5188                      .dwattr DW$94, DW_AT_external(0x01)
    5189                      .dwattr DW$120, DW_AT_external(0x01)
    5190                      .dwattr DW$127, DW_AT_external(0x01)
    5191                      .dwattr DW$198, DW_AT_external(0x01)
    5192                      .dwattr DW$136, DW_AT_external(0x01)
    5193                      .dwattr DW$139, DW_AT_external(0x01)
    5194                      .dwattr DW$139, DW_AT_type(*DW$T$19)
    5195                      .dwattr DW$148, DW_AT_external(0x01)
    5196                      .dwattr DW$148, DW_AT_type(*DW$T$19)
