TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:21 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7482                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Nov 29 16:03:21 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("Gui_front_connect.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("GUI_extlib_init"), DW_AT_symbol_name("_GUI_extlib_init")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              

     606                      .global _GUI_strlen
     607                      .global _lcd_driver_HZASCcode_display
     608                      .global _GUI_F8X16_EXTASCII
     609              
     610              ;***************************************************************
     611              ;* TYPE INFORMATION                                            *
     612              ;***************************************************************
     613              
     614              DW$T$31 .dwtag  DW_TAG_subroutine_type
     615                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     616              DW$60   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
     617              DW$61   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     618                      .dwendtag DW$T$31
     619              
     620              
     621              DW$T$33 .dwtag  DW_TAG_subroutine_type
     622                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
     623              
     624              DW$T$38 .dwtag  DW_TAG_subroutine_type
     625                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     626              DW$62   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
     627                      .dwendtag DW$T$38
     628              
     629              
     630              DW$T$40 .dwtag  DW_TAG_subroutine_type
     631                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     632              DW$63   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
     633              DW$64   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     634              DW$65   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     635                      .dwendtag DW$T$40
     636              
     637              
     638              DW$T$43 .dwtag  DW_TAG_subroutine_type
     639                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:21 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7482                            PAGE   13

     640              DW$66   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     641              DW$67   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     642              DW$68   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     643              DW$69   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     644              DW$70   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     645              DW$71   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     646              DW$72   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$42)
     647                      .dwendtag DW$T$43
     648              
     649              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     650                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     651                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
     652              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     653                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     654                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     655              
     656              DW$T$44 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     657                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
     658              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     659                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     660                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     661              
     662              DW$T$46 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$11)
     663                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
     664              DW$73   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$42)
     665                      .dwendtag DW$T$46
     666              
     667              DW$T$49 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
     668                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
     669              DW$T$42 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
     670                      .dwattr DW$T$42, DW_AT_address_class(0x16)
     671              DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_front_t"), DW_AT_type(*DW$T$21)
     672                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
     673              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
     674                      .dwattr DW$T$30, DW_AT_address_class(0x16)
     675              DW$74   .dwtag  DW_TAG_far_type
     676                      .dwattr DW$74, DW_AT_type(*DW$T$35)
     677              DW$T$36 .dwtag  DW_TAG_const_type
     678                      .dwattr DW$T$36, DW_AT_type(*DW$74)
     679              DW$T$37 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
     680                      .dwattr DW$T$37, DW_AT_address_class(0x16)
     681              
     682              DW$T$51 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$37)
     683                      .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
     684              DW$T$52 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
     685                      .dwattr DW$T$52, DW_AT_address_class(0x16)
     686              DW$T$19 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     687                      .dwattr DW$T$19, DW_AT_encoding(DW_ATE_signed_char)
     688                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
     689              
     690              DW$T$21 .dwtag  DW_TAG_structure_type
     691                      .dwattr DW$T$21, DW_AT_byte_size(0x104)
     692              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     693                      .dwattr DW$75, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
     694                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:21 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7482                            PAGE   14

     695                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     696              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     697                      .dwattr DW$76, DW_AT_name("high"), DW_AT_symbol_name("_high")
     698                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     699                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     700              DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     701                      .dwattr DW$77, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
     702                      .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     703                      .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     704              DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     705                      .dwattr DW$78, DW_AT_name("nbyte"), DW_AT_symbol_name("_nbyte")
     706                      .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     707                      .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     708              DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     709                      .dwattr DW$79, DW_AT_name("Dbuf"), DW_AT_symbol_name("_Dbuf")
     710                      .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     711                      .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     712                      .dwendtag DW$T$21
     713              
     714              DW$T$35 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT"), DW_AT_type(*DW$T$28)
     715                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
     716              
     717              DW$T$20 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
     718                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     719                      .dwattr DW$T$20, DW_AT_byte_size(0x100)
     720              DW$80   .dwtag  DW_TAG_subrange_type
     721                      .dwattr DW$80, DW_AT_upper_bound(0xff)
     722                      .dwendtag DW$T$20
     723              
     724              
     725              DW$T$28 .dwtag  DW_TAG_structure_type
     726                      .dwattr DW$T$28, DW_AT_name("GUI_FONT")
     727                      .dwattr DW$T$28, DW_AT_byte_size(0x0c)
     728              DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     729                      .dwattr DW$81, DW_AT_name("start_asc"), DW_AT_symbol_name("_start_asc")
     730                      .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     731                      .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
     732              DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     733                      .dwattr DW$82, DW_AT_name("end_asc"), DW_AT_symbol_name("_end_asc")
     734                      .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     735                      .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
     736              DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
     737                      .dwattr DW$83, DW_AT_name("nbyte"), DW_AT_symbol_name("_nbyte")
     738                      .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     739                      .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
     740              DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     741                      .dwattr DW$84, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
     742                      .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     743                      .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
     744              DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     745                      .dwattr DW$85, DW_AT_name("high"), DW_AT_symbol_name("_high")
     746                      .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     747                      .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
     748              DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     749                      .dwattr DW$86, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:21 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7482                            PAGE   15

     750                      .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     751                      .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
     752              DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     753                      .dwattr DW$87, DW_AT_name("pcode"), DW_AT_symbol_name("_pcode")
     754                      .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     755                      .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
     756              DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
     757                      .dwattr DW$88, DW_AT_name("pNext"), DW_AT_symbol_name("_pNext")
     758                      .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     759                      .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
     760                      .dwendtag DW$T$28
     761              
     762              DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
     763                      .dwattr DW$T$27, DW_AT_address_class(0x16)
     764              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
     765                      .dwattr DW$T$25, DW_AT_address_class(0x16)
     766              DW$T$23 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
     767                      .dwattr DW$T$23, DW_AT_address_class(0x16)
     768              DW$89   .dwtag  DW_TAG_far_type
     769                      .dwattr DW$89, DW_AT_type(*DW$T$28)
     770              DW$T$26 .dwtag  DW_TAG_const_type
     771                      .dwattr DW$T$26, DW_AT_type(*DW$89)
     772              DW$90   .dwtag  DW_TAG_far_type
     773                      .dwattr DW$90, DW_AT_type(*DW$T$6)
     774              DW$T$24 .dwtag  DW_TAG_const_type
     775                      .dwattr DW$T$24, DW_AT_type(*DW$90)
     776              DW$91   .dwtag  DW_TAG_far_type
     777                      .dwattr DW$91, DW_AT_type(*DW$T$19)
     778              DW$T$22 .dwtag  DW_TAG_const_type
     779                      .dwattr DW$T$22, DW_AT_type(*DW$91)
     780              
     781                      .dwattr DW$22, DW_AT_external(0x01)
     782                      .dwattr DW$22, DW_AT_type(*DW$T$37)
     783                      .dwattr DW$19, DW_AT_external(0x01)
     784                      .dwattr DW$30, DW_AT_external(0x01)
     785                      .dwattr DW$59, DW_AT_external(0x01)
     786                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     787              
     788              ;***************************************************************
     789              ;* DWARF CIE ENTRIES                                           *
     790              ;***************************************************************
     791              
     792              DW$CIE  .dwcie 1, 40
     793                      .dwcfa  0x0c, 20, 0
     794                      .dwcfa  0x07, 0
     795                      .dwcfa  0x07, 1
     796                      .dwcfa  0x07, 2
     797                      .dwcfa  0x07, 3
     798                      .dwcfa  0x07, 4
     799                      .dwcfa  0x07, 5
     800                      .dwcfa  0x08, 6
     801                      .dwcfa  0x08, 7
     802                      .dwcfa  0x08, 8
     803                      .dwcfa  0x08, 9
     804                      .dwcfa  0x08, 10
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:21 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7482                            PAGE   16

     805                      .dwcfa  0x08, 11
     806                      .dwcfa  0x07, 12
     807                      .dwcfa  0x07, 13
     808                      .dwcfa  0x07, 14
     809                      .dwcfa  0x07, 15
     810                      .dwcfa  0x07, 16
     811                      .dwcfa  0x07, 17
     812                      .dwcfa  0x07, 18
     813                      .dwcfa  0x07, 19
     814                      .dwcfa  0x07, 20
     815                      .dwcfa  0x07, 21
     816                      .dwcfa  0x07, 22
     817                      .dwcfa  0x07, 23
     818                      .dwcfa  0x07, 24
     819                      .dwcfa  0x07, 25
     820                      .dwcfa  0x07, 26
     821                      .dwcfa  0x08, 27
     822                      .dwcfa  0x07, 28
     823                      .dwcfa  0x07, 29
     824                      .dwcfa  0x07, 30
     825                      .dwcfa  0x07, 31
     826                      .dwcfa  0x07, 32
