TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Mon Dec 03 13:50:31 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("GUI_lcd_driver.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("global_round_off_float"), DW_AT_symbol_name("_global_round_off
      15                      .dwattr DW$1, DW_AT_type(*DW$T$16)
      16                      .dwattr DW$1, DW_AT_declaration(0x01)
      17                      .dwattr DW$1, DW_AT_external(0x01)

C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   59

    3025              DW$272  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3026              DW$273  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3027              DW$274  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$140)
    3028                      .dwendtag DW$T$155
    3029              
    3030              
    3031              DW$T$156        .dwtag  DW_TAG_subroutine_type
    3032                      .dwattr DW$T$156, DW_AT_language(DW_LANG_C)
    3033              DW$275  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3034              DW$276  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3035              DW$277  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3036              DW$278  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3037              DW$279  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$148)
    3038                      .dwendtag DW$T$156
    3039              
    3040              
    3041              DW$T$157        .dwtag  DW_TAG_subroutine_type
    3042                      .dwattr DW$T$157, DW_AT_language(DW_LANG_C)
    3043              DW$280  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3044              DW$281  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3045              DW$282  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3046              DW$283  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3047              DW$284  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$148)
    3048              DW$285  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    3049                      .dwendtag DW$T$157
    3050              
    3051              
    3052              DW$T$158        .dwtag  DW_TAG_subroutine_type
    3053                      .dwattr DW$T$158, DW_AT_language(DW_LANG_C)
    3054              
    3055              DW$T$159        .dwtag  DW_TAG_subroutine_type
    3056                      .dwattr DW$T$159, DW_AT_language(DW_LANG_C)
    3057              DW$286  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    3058                      .dwendtag DW$T$159
    3059              
    3060              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    3061                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3062                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    3063              DW$T$148        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
    3064                      .dwattr DW$T$148, DW_AT_address_class(0x16)
    3065              
    3066              DW$T$160        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
    3067                      .dwattr DW$T$160, DW_AT_language(DW_LANG_C)
    3068              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    3069                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3070                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
    3071              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    3072                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3073                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    3074              DW$T$140        .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
    3075                      .dwattr DW$T$140, DW_AT_language(DW_LANG_C)
    3076              DW$T$163        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$11)
    3077                      .dwattr DW$T$163, DW_AT_address_class(0x16)
    3078              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
    3079                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   60

    3080                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
    3081              
    3082              DW$T$165        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$16)
    3083                      .dwattr DW$T$165, DW_AT_language(DW_LANG_C)
    3084              DW$287  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$16)
    3085                      .dwendtag DW$T$165
    3086              
    3087              DW$288  .dwtag  DW_TAG_far_type
    3088                      .dwattr DW$288, DW_AT_type(*DW$T$55)
    3089              DW$T$168        .dwtag  DW_TAG_volatile_type
    3090                      .dwattr DW$T$168, DW_AT_type(*DW$288)
    3091              DW$289  .dwtag  DW_TAG_far_type
    3092                      .dwattr DW$289, DW_AT_type(*DW$T$105)
    3093              DW$T$173        .dwtag  DW_TAG_volatile_type
    3094                      .dwattr DW$T$173, DW_AT_type(*DW$289)
    3095              DW$290  .dwtag  DW_TAG_far_type
    3096                      .dwattr DW$290, DW_AT_type(*DW$T$137)
    3097              DW$T$184        .dwtag  DW_TAG_volatile_type
    3098                      .dwattr DW$T$184, DW_AT_type(*DW$290)
    3099              DW$T$143        .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    3100                      .dwattr DW$T$143, DW_AT_encoding(DW_ATE_signed_char)
    3101                      .dwattr DW$T$143, DW_AT_byte_size(0x01)
    3102              DW$T$152        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$143)
    3103                      .dwattr DW$T$152, DW_AT_address_class(0x16)
    3104              
    3105              DW$T$55 .dwtag  DW_TAG_structure_type
    3106                      .dwattr DW$T$55, DW_AT_name("GPIO_MUX_REGS")
    3107                      .dwattr DW$T$55, DW_AT_byte_size(0x20)
    3108              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    3109                      .dwattr DW$291, DW_AT_name("GPAMUX"), DW_AT_symbol_name("_GPAMUX")
    3110                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3111                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3112              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3113                      .dwattr DW$292, DW_AT_name("GPADIR"), DW_AT_symbol_name("_GPADIR")
    3114                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3115                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3116              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    3117                      .dwattr DW$293, DW_AT_name("GPAQUAL"), DW_AT_symbol_name("_GPAQUAL")
    3118                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3119                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3120              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3121                      .dwattr DW$294, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3122                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3123                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3124              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    3125                      .dwattr DW$295, DW_AT_name("GPBMUX"), DW_AT_symbol_name("_GPBMUX")
    3126                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3127                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3128              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    3129                      .dwattr DW$296, DW_AT_name("GPBDIR"), DW_AT_symbol_name("_GPBDIR")
    3130                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3131                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3132              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3133                      .dwattr DW$297, DW_AT_name("GPBQUAL"), DW_AT_symbol_name("_GPBQUAL")
    3134                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   61

    3135                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3136              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    3137                      .dwattr DW$298, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3138                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3139                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3140              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    3141                      .dwattr DW$299, DW_AT_name("GPDMUX"), DW_AT_symbol_name("_GPDMUX")
    3142                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3143                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3144              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    3145                      .dwattr DW$300, DW_AT_name("GPDDIR"), DW_AT_symbol_name("_GPDDIR")
    3146                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3147                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3148              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3149                      .dwattr DW$301, DW_AT_name("GPDQUAL"), DW_AT_symbol_name("_GPDQUAL")
    3150                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3151                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3152              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3153                      .dwattr DW$302, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
    3154                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3155                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3156              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3157                      .dwattr DW$303, DW_AT_name("GPEMUX"), DW_AT_symbol_name("_GPEMUX")
    3158                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3159                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3160              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    3161                      .dwattr DW$304, DW_AT_name("GPEDIR"), DW_AT_symbol_name("_GPEDIR")
    3162                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3163                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3164              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    3165                      .dwattr DW$305, DW_AT_name("GPEQUAL"), DW_AT_symbol_name("_GPEQUAL")
    3166                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3167                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3168              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3169                      .dwattr DW$306, DW_AT_name("rsvd4"), DW_AT_symbol_name("_rsvd4")
    3170                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3171                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3172              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    3173                      .dwattr DW$307, DW_AT_name("GPFMUX"), DW_AT_symbol_name("_GPFMUX")
    3174                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3175                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3176              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    3177                      .dwattr DW$308, DW_AT_name("GPFDIR"), DW_AT_symbol_name("_GPFDIR")
    3178                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3179                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3180              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
    3181                      .dwattr DW$309, DW_AT_name("rsvd5"), DW_AT_symbol_name("_rsvd5")
    3182                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3183                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3184              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    3185                      .dwattr DW$310, DW_AT_name("GPGMUX"), DW_AT_symbol_name("_GPGMUX")
    3186                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3187                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3188              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    3189                      .dwattr DW$311, DW_AT_name("GPGDIR"), DW_AT_symbol_name("_GPGDIR")
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   62

    3190                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3191                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3192              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    3193                      .dwattr DW$312, DW_AT_name("rsvd6"), DW_AT_symbol_name("_rsvd6")
    3194                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3195                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3196                      .dwendtag DW$T$55
    3197              
    3198              
    3199              DW$T$105        .dwtag  DW_TAG_structure_type
    3200                      .dwattr DW$T$105, DW_AT_name("GPIO_DATA_REGS")
    3201                      .dwattr DW$T$105, DW_AT_byte_size(0x20)
    3202              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    3203                      .dwattr DW$313, DW_AT_name("GPADAT"), DW_AT_symbol_name("_GPADAT")
    3204                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3205                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3206              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    3207                      .dwattr DW$314, DW_AT_name("GPASET"), DW_AT_symbol_name("_GPASET")
    3208                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3209                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3210              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    3211                      .dwattr DW$315, DW_AT_name("GPACLEAR"), DW_AT_symbol_name("_GPACLEAR")
    3212                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3213                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3214              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    3215                      .dwattr DW$316, DW_AT_name("GPATOGGLE"), DW_AT_symbol_name("_GPATOGGLE")
    3216                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3217                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3218              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    3219                      .dwattr DW$317, DW_AT_name("GPBDAT"), DW_AT_symbol_name("_GPBDAT")
    3220                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3221                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3222              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    3223                      .dwattr DW$318, DW_AT_name("GPBSET"), DW_AT_symbol_name("_GPBSET")
    3224                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3225                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3226              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
    3227                      .dwattr DW$319, DW_AT_name("GPBCLEAR"), DW_AT_symbol_name("_GPBCLEAR")
    3228                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3229                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3230              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
    3231                      .dwattr DW$320, DW_AT_name("GPBTOGGLE"), DW_AT_symbol_name("_GPBTOGGLE")
    3232                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3233                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3234              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$104)
    3235                      .dwattr DW$321, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3236                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3237                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3238              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
    3239                      .dwattr DW$322, DW_AT_name("GPDDAT"), DW_AT_symbol_name("_GPDDAT")
    3240                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3241                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3242              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$75)
    3243                      .dwattr DW$323, DW_AT_name("GPDSET"), DW_AT_symbol_name("_GPDSET")
    3244                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   63

    3245                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3246              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
    3247                      .dwattr DW$324, DW_AT_name("GPDCLEAR"), DW_AT_symbol_name("_GPDCLEAR")
    3248                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3249                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3250              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    3251                      .dwattr DW$325, DW_AT_name("GPDTOGGLE"), DW_AT_symbol_name("_GPDTOGGLE")
    3252                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3253                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3254              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$81)
    3255                      .dwattr DW$326, DW_AT_name("GPEDAT"), DW_AT_symbol_name("_GPEDAT")
    3256                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3257                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3258              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$83)
    3259                      .dwattr DW$327, DW_AT_name("GPESET"), DW_AT_symbol_name("_GPESET")
    3260                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3261                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3262              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$85)
    3263                      .dwattr DW$328, DW_AT_name("GPECLEAR"), DW_AT_symbol_name("_GPECLEAR")
    3264                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3265                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3266              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$87)
    3267                      .dwattr DW$329, DW_AT_name("GPETOGGLE"), DW_AT_symbol_name("_GPETOGGLE")
    3268                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3269                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3270              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
    3271                      .dwattr DW$330, DW_AT_name("GPFDAT"), DW_AT_symbol_name("_GPFDAT")
    3272                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3273                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3274              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$91)
    3275                      .dwattr DW$331, DW_AT_name("GPFSET"), DW_AT_symbol_name("_GPFSET")
    3276                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3277                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3278              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$93)
    3279                      .dwattr DW$332, DW_AT_name("GPFCLEAR"), DW_AT_symbol_name("_GPFCLEAR")
    3280                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3281                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3282              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$95)
    3283                      .dwattr DW$333, DW_AT_name("GPFTOGGLE"), DW_AT_symbol_name("_GPFTOGGLE")
    3284                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3285                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3286              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    3287                      .dwattr DW$334, DW_AT_name("GPGDAT"), DW_AT_symbol_name("_GPGDAT")
    3288                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3289                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3290              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    3291                      .dwattr DW$335, DW_AT_name("GPGSET"), DW_AT_symbol_name("_GPGSET")
    3292                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3293                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3294              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
    3295                      .dwattr DW$336, DW_AT_name("GPGCLEAR"), DW_AT_symbol_name("_GPGCLEAR")
    3296                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3297                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3298              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$103)
    3299                      .dwattr DW$337, DW_AT_name("GPGTOGGLE"), DW_AT_symbol_name("_GPGTOGGLE")
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   64

    3300                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3301                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3302              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$104)
    3303                      .dwattr DW$338, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3304                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3305                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3306                      .dwendtag DW$T$105
    3307              
    3308              
    3309              DW$T$137        .dwtag  DW_TAG_structure_type
    3310                      .dwattr DW$T$137, DW_AT_name("EVB_REGS")
    3311                      .dwattr DW$T$137, DW_AT_byte_size(0x32)
    3312              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
    3313                      .dwattr DW$339, DW_AT_name("GPTCONB"), DW_AT_symbol_name("_GPTCONB")
    3314                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3315                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3316              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3317                      .dwattr DW$340, DW_AT_name("T3CNT"), DW_AT_symbol_name("_T3CNT")
    3318                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3319                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3320              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3321                      .dwattr DW$341, DW_AT_name("T3CMPR"), DW_AT_symbol_name("_T3CMPR")
    3322                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3323                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3324              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3325                      .dwattr DW$342, DW_AT_name("T3PR"), DW_AT_symbol_name("_T3PR")
    3326                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3327                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3328              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$109)
    3329                      .dwattr DW$343, DW_AT_name("T3CON"), DW_AT_symbol_name("_T3CON")
    3330                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3331                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3332              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3333                      .dwattr DW$344, DW_AT_name("T4CNT"), DW_AT_symbol_name("_T4CNT")
    3334                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3335                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3336              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3337                      .dwattr DW$345, DW_AT_name("T4CMPR"), DW_AT_symbol_name("_T4CMPR")
    3338                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3339                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3340              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3341                      .dwattr DW$346, DW_AT_name("T4PR"), DW_AT_symbol_name("_T4PR")
    3342                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3343                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3344              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$111)
    3345                      .dwattr DW$347, DW_AT_name("T4CON"), DW_AT_symbol_name("_T4CON")
    3346                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3347                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3348              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$113)
    3349                      .dwattr DW$348, DW_AT_name("EXTCONB"), DW_AT_symbol_name("_EXTCONB")
    3350                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3351                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3352              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$136)
    3353                      .dwattr DW$349, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3354                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   65

    3355                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3356              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$115)
    3357                      .dwattr DW$350, DW_AT_name("COMCONB"), DW_AT_symbol_name("_COMCONB")
    3358                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3359                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3360              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3361                      .dwattr DW$351, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3362                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3363                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3364              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    3365                      .dwattr DW$352, DW_AT_name("ACTRB"), DW_AT_symbol_name("_ACTRB")
    3366                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3367                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3368              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3369                      .dwattr DW$353, DW_AT_name("rsvd3"), DW_AT_symbol_name("_rsvd3")
    3370                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3371                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3372              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    3373                      .dwattr DW$354, DW_AT_name("DBTCONB"), DW_AT_symbol_name("_DBTCONB")
    3374                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3375                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3376              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3377                      .dwattr DW$355, DW_AT_name("rsvd4"), DW_AT_symbol_name("_rsvd4")
    3378                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3379                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3380              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3381                      .dwattr DW$356, DW_AT_name("CMPR4"), DW_AT_symbol_name("_CMPR4")
    3382                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3383                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3384              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3385                      .dwattr DW$357, DW_AT_name("CMPR5"), DW_AT_symbol_name("_CMPR5")
    3386                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3387                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3388              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3389                      .dwattr DW$358, DW_AT_name("CMPR6"), DW_AT_symbol_name("_CMPR6")
    3390                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3391                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3392              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    3393                      .dwattr DW$359, DW_AT_name("rsvd5"), DW_AT_symbol_name("_rsvd5")
    3394                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3395                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3396              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$121)
    3397                      .dwattr DW$360, DW_AT_name("CAPCONB"), DW_AT_symbol_name("_CAPCONB")
    3398                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3399                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3400              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3401                      .dwattr DW$361, DW_AT_name("rsvd6"), DW_AT_symbol_name("_rsvd6")
    3402                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3403                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3404              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    3405                      .dwattr DW$362, DW_AT_name("CAPFIFOB"), DW_AT_symbol_name("_CAPFIFOB")
    3406                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3407                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3408              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3409                      .dwattr DW$363, DW_AT_name("CAP4FIFO"), DW_AT_symbol_name("_CAP4FIFO")
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   66

    3410                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    3411                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3412              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3413                      .dwattr DW$364, DW_AT_name("CAP5FIFO"), DW_AT_symbol_name("_CAP5FIFO")
    3414                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3415                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3416              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3417                      .dwattr DW$365, DW_AT_name("CAP6FIFO"), DW_AT_symbol_name("_CAP6FIFO")
    3418                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    3419                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3420              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3421                      .dwattr DW$366, DW_AT_name("rsvd7"), DW_AT_symbol_name("_rsvd7")
    3422                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3423                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3424              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3425                      .dwattr DW$367, DW_AT_name("CAP4FBOT"), DW_AT_symbol_name("_CAP4FBOT")
    3426                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    3427                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3428              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3429                      .dwattr DW$368, DW_AT_name("CAP5FBOT"), DW_AT_symbol_name("_CAP5FBOT")
    3430                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3431                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3432              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3433                      .dwattr DW$369, DW_AT_name("CAP6FBOT"), DW_AT_symbol_name("_CAP6FBOT")
    3434                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3435                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3436              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
    3437                      .dwattr DW$370, DW_AT_name("rsvd8"), DW_AT_symbol_name("_rsvd8")
    3438                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3439                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3440              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$125)
    3441                      .dwattr DW$371, DW_AT_name("EVBIMRA"), DW_AT_symbol_name("_EVBIMRA")
    3442                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3443                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3444              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$127)
    3445                      .dwattr DW$372, DW_AT_name("EVBIMRB"), DW_AT_symbol_name("_EVBIMRB")
    3446                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    3447                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3448              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$129)
    3449                      .dwattr DW$373, DW_AT_name("EVBIMRC"), DW_AT_symbol_name("_EVBIMRC")
    3450                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3451                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3452              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$131)
    3453                      .dwattr DW$374, DW_AT_name("EVBIFRA"), DW_AT_symbol_name("_EVBIFRA")
    3454                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    3455                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3456              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
    3457                      .dwattr DW$375, DW_AT_name("EVBIFRB"), DW_AT_symbol_name("_EVBIFRB")
    3458                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3459                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3460              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$135)
    3461                      .dwattr DW$376, DW_AT_name("EVBIFRC"), DW_AT_symbol_name("_EVBIFRC")
    3462                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    3463                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3464                      .dwendtag DW$T$137
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   67

    3465              
    3466              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$11)
    3467                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    3468              
    3469              DW$T$52 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3470                      .dwattr DW$T$52, DW_AT_language(DW_LANG_C)
    3471                      .dwattr DW$T$52, DW_AT_byte_size(0x05)
    3472              DW$377  .dwtag  DW_TAG_subrange_type
    3473                      .dwattr DW$377, DW_AT_upper_bound(0x04)
    3474                      .dwendtag DW$T$52
    3475              
    3476              
    3477              DW$T$53 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3478                      .dwattr DW$T$53, DW_AT_language(DW_LANG_C)
    3479                      .dwattr DW$T$53, DW_AT_byte_size(0x02)
    3480              DW$378  .dwtag  DW_TAG_subrange_type
    3481                      .dwattr DW$378, DW_AT_upper_bound(0x01)
    3482                      .dwendtag DW$T$53
    3483              
    3484              
    3485              DW$T$54 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3486                      .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    3487                      .dwattr DW$T$54, DW_AT_byte_size(0x06)
    3488              DW$379  .dwtag  DW_TAG_subrange_type
    3489                      .dwattr DW$379, DW_AT_upper_bound(0x05)
    3490                      .dwendtag DW$T$54
    3491              
    3492              
    3493              DW$T$104        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3494                      .dwattr DW$T$104, DW_AT_language(DW_LANG_C)
    3495                      .dwattr DW$T$104, DW_AT_byte_size(0x04)
    3496              DW$380  .dwtag  DW_TAG_subrange_type
    3497                      .dwattr DW$380, DW_AT_upper_bound(0x03)
    3498                      .dwendtag DW$T$104
    3499              
    3500              
    3501              DW$T$136        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3502                      .dwattr DW$T$136, DW_AT_language(DW_LANG_C)
    3503                      .dwattr DW$T$136, DW_AT_byte_size(0x07)
    3504              DW$381  .dwtag  DW_TAG_subrange_type
    3505                      .dwattr DW$381, DW_AT_upper_bound(0x06)
    3506                      .dwendtag DW$T$136
    3507              
    3508              
    3509              DW$T$21 .dwtag  DW_TAG_union_type
    3510                      .dwattr DW$T$21, DW_AT_name("GPAMUX_REG")
    3511                      .dwattr DW$T$21, DW_AT_byte_size(0x01)
    3512              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3513                      .dwattr DW$382, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3514                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3515                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3516              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    3517                      .dwattr DW$383, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3518                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3519                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   68

    3520                      .dwendtag DW$T$21
    3521              
    3522              
    3523              DW$T$23 .dwtag  DW_TAG_union_type
    3524                      .dwattr DW$T$23, DW_AT_name("GPADIR_REG")
    3525                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    3526              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3527                      .dwattr DW$384, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3528                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3529                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3530              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    3531                      .dwattr DW$385, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3532                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3533                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3534                      .dwendtag DW$T$23
    3535              
    3536              
    3537              DW$T$25 .dwtag  DW_TAG_union_type
    3538                      .dwattr DW$T$25, DW_AT_name("GPAQUAL_REG")
    3539                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    3540              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3541                      .dwattr DW$386, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3542                      .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3543                      .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3544              DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    3545                      .dwattr DW$387, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3546                      .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3547                      .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3548                      .dwendtag DW$T$25
    3549              
    3550              
    3551              DW$T$27 .dwtag  DW_TAG_union_type
    3552                      .dwattr DW$T$27, DW_AT_name("GPBMUX_REG")
    3553                      .dwattr DW$T$27, DW_AT_byte_size(0x01)
    3554              DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3555                      .dwattr DW$388, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3556                      .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3557                      .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3558              DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    3559                      .dwattr DW$389, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3560                      .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3561                      .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3562                      .dwendtag DW$T$27
    3563              
    3564              
    3565              DW$T$29 .dwtag  DW_TAG_union_type
    3566                      .dwattr DW$T$29, DW_AT_name("GPBDIR_REG")
    3567                      .dwattr DW$T$29, DW_AT_byte_size(0x01)
    3568              DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3569                      .dwattr DW$390, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3570                      .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3571                      .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3572              DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    3573                      .dwattr DW$391, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3574                      .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   69

    3575                      .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3576                      .dwendtag DW$T$29
    3577              
    3578              
    3579              DW$T$31 .dwtag  DW_TAG_union_type
    3580                      .dwattr DW$T$31, DW_AT_name("GPBQUAL_REG")
    3581                      .dwattr DW$T$31, DW_AT_byte_size(0x01)
    3582              DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3583                      .dwattr DW$392, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3584                      .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3585                      .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3586              DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    3587                      .dwattr DW$393, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3588                      .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3589                      .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3590                      .dwendtag DW$T$31
    3591              
    3592              
    3593              DW$T$33 .dwtag  DW_TAG_union_type
    3594                      .dwattr DW$T$33, DW_AT_name("GPDMUX_REG")
    3595                      .dwattr DW$T$33, DW_AT_byte_size(0x01)
    3596              DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3597                      .dwattr DW$394, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3598                      .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3599                      .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3600              DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    3601                      .dwattr DW$395, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3602                      .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3603                      .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3604                      .dwendtag DW$T$33
    3605              
    3606              
    3607              DW$T$35 .dwtag  DW_TAG_union_type
    3608                      .dwattr DW$T$35, DW_AT_name("GPDDIR_REG")
    3609                      .dwattr DW$T$35, DW_AT_byte_size(0x01)
    3610              DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3611                      .dwattr DW$396, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3612                      .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3613                      .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3614              DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    3615                      .dwattr DW$397, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3616                      .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3617                      .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3618                      .dwendtag DW$T$35
    3619              
    3620              
    3621              DW$T$37 .dwtag  DW_TAG_union_type
    3622                      .dwattr DW$T$37, DW_AT_name("GPDQUAL_REG")
    3623                      .dwattr DW$T$37, DW_AT_byte_size(0x01)
    3624              DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3625                      .dwattr DW$398, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3626                      .dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3627                      .dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3628              DW$399  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    3629                      .dwattr DW$399, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   70

    3630                      .dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3631                      .dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3632                      .dwendtag DW$T$37
    3633              
    3634              
    3635              DW$T$39 .dwtag  DW_TAG_union_type
    3636                      .dwattr DW$T$39, DW_AT_name("GPEMUX_REG")
    3637                      .dwattr DW$T$39, DW_AT_byte_size(0x01)
    3638              DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3639                      .dwattr DW$400, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3640                      .dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3641                      .dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3642              DW$401  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3643                      .dwattr DW$401, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3644                      .dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3645                      .dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3646                      .dwendtag DW$T$39
    3647              
    3648              
    3649              DW$T$41 .dwtag  DW_TAG_union_type
    3650                      .dwattr DW$T$41, DW_AT_name("GPEDIR_REG")
    3651                      .dwattr DW$T$41, DW_AT_byte_size(0x01)
    3652              DW$402  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3653                      .dwattr DW$402, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3654                      .dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3655                      .dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3656              DW$403  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    3657                      .dwattr DW$403, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3658                      .dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3659                      .dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3660                      .dwendtag DW$T$41
    3661              
    3662              
    3663              DW$T$43 .dwtag  DW_TAG_union_type
    3664                      .dwattr DW$T$43, DW_AT_name("GPEQUAL_REG")
    3665                      .dwattr DW$T$43, DW_AT_byte_size(0x01)
    3666              DW$404  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3667                      .dwattr DW$404, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3668                      .dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3669                      .dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3670              DW$405  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3671                      .dwattr DW$405, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3672                      .dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3673                      .dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3674                      .dwendtag DW$T$43
    3675              
    3676              
    3677              DW$T$45 .dwtag  DW_TAG_union_type
    3678                      .dwattr DW$T$45, DW_AT_name("GPFMUX_REG")
    3679                      .dwattr DW$T$45, DW_AT_byte_size(0x01)
    3680              DW$406  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3681                      .dwattr DW$406, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3682                      .dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3683                      .dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3684              DW$407  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   71

    3685                      .dwattr DW$407, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3686                      .dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3687                      .dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3688                      .dwendtag DW$T$45
    3689              
    3690              
    3691              DW$T$47 .dwtag  DW_TAG_union_type
    3692                      .dwattr DW$T$47, DW_AT_name("GPFDIR_REG")
    3693                      .dwattr DW$T$47, DW_AT_byte_size(0x01)
    3694              DW$408  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3695                      .dwattr DW$408, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3696                      .dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3697                      .dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3698              DW$409  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    3699                      .dwattr DW$409, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3700                      .dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3701                      .dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3702                      .dwendtag DW$T$47
    3703              
    3704              
    3705              DW$T$49 .dwtag  DW_TAG_union_type
    3706                      .dwattr DW$T$49, DW_AT_name("GPGMUX_REG")
    3707                      .dwattr DW$T$49, DW_AT_byte_size(0x01)
    3708              DW$410  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3709                      .dwattr DW$410, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3710                      .dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3711                      .dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3712              DW$411  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    3713                      .dwattr DW$411, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3714                      .dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3715                      .dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3716                      .dwendtag DW$T$49
    3717              
    3718              
    3719              DW$T$51 .dwtag  DW_TAG_union_type
    3720                      .dwattr DW$T$51, DW_AT_name("GPGDIR_REG")
    3721                      .dwattr DW$T$51, DW_AT_byte_size(0x01)
    3722              DW$412  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3723                      .dwattr DW$412, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3724                      .dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3725                      .dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3726              DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    3727                      .dwattr DW$413, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3728                      .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3729                      .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3730                      .dwendtag DW$T$51
    3731              
    3732              
    3733              DW$T$57 .dwtag  DW_TAG_union_type
    3734                      .dwattr DW$T$57, DW_AT_name("GPADAT_REG")
    3735                      .dwattr DW$T$57, DW_AT_byte_size(0x01)
    3736              DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3737                      .dwattr DW$414, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3738                      .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3739                      .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   72

    3740              DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    3741                      .dwattr DW$415, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3742                      .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3743                      .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3744                      .dwendtag DW$T$57
    3745              
    3746              
    3747              DW$T$59 .dwtag  DW_TAG_union_type
    3748                      .dwattr DW$T$59, DW_AT_name("GPASET_REG")
    3749                      .dwattr DW$T$59, DW_AT_byte_size(0x01)
    3750              DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3751                      .dwattr DW$416, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3752                      .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3753                      .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3754              DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3755                      .dwattr DW$417, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3756                      .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3757                      .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3758                      .dwendtag DW$T$59
    3759              
    3760              
    3761              DW$T$61 .dwtag  DW_TAG_union_type
    3762                      .dwattr DW$T$61, DW_AT_name("GPACLEAR_REG")
    3763                      .dwattr DW$T$61, DW_AT_byte_size(0x01)
    3764              DW$418  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3765                      .dwattr DW$418, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3766                      .dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3767                      .dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3768              DW$419  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    3769                      .dwattr DW$419, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3770                      .dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3771                      .dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3772                      .dwendtag DW$T$61
    3773              
    3774              
    3775              DW$T$63 .dwtag  DW_TAG_union_type
    3776                      .dwattr DW$T$63, DW_AT_name("GPATOGGLE_REG")
    3777                      .dwattr DW$T$63, DW_AT_byte_size(0x01)
    3778              DW$420  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3779                      .dwattr DW$420, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3780                      .dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3781                      .dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3782              DW$421  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    3783                      .dwattr DW$421, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3784                      .dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3785                      .dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3786                      .dwendtag DW$T$63
    3787              
    3788              
    3789              DW$T$65 .dwtag  DW_TAG_union_type
    3790                      .dwattr DW$T$65, DW_AT_name("GPBDAT_REG")
    3791                      .dwattr DW$T$65, DW_AT_byte_size(0x01)
    3792              DW$422  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3793                      .dwattr DW$422, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3794                      .dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   73

    3795                      .dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3796              DW$423  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    3797                      .dwattr DW$423, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3798                      .dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3799                      .dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3800                      .dwendtag DW$T$65
    3801              
    3802              
    3803              DW$T$67 .dwtag  DW_TAG_union_type
    3804                      .dwattr DW$T$67, DW_AT_name("GPBSET_REG")
    3805                      .dwattr DW$T$67, DW_AT_byte_size(0x01)
    3806              DW$424  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3807                      .dwattr DW$424, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3808                      .dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3809                      .dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3810              DW$425  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    3811                      .dwattr DW$425, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3812                      .dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3813                      .dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3814                      .dwendtag DW$T$67
    3815              
    3816              
    3817              DW$T$69 .dwtag  DW_TAG_union_type
    3818                      .dwattr DW$T$69, DW_AT_name("GPBCLEAR_REG")
    3819                      .dwattr DW$T$69, DW_AT_byte_size(0x01)
    3820              DW$426  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3821                      .dwattr DW$426, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3822                      .dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3823                      .dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3824              DW$427  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    3825                      .dwattr DW$427, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3826                      .dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3827                      .dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3828                      .dwendtag DW$T$69
    3829              
    3830              
    3831              DW$T$71 .dwtag  DW_TAG_union_type
    3832                      .dwattr DW$T$71, DW_AT_name("GPBTOGGLE_REG")
    3833                      .dwattr DW$T$71, DW_AT_byte_size(0x01)
    3834              DW$428  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3835                      .dwattr DW$428, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3836                      .dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3837                      .dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3838              DW$429  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    3839                      .dwattr DW$429, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3840                      .dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3841                      .dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3842                      .dwendtag DW$T$71
    3843              
    3844              
    3845              DW$T$73 .dwtag  DW_TAG_union_type
    3846                      .dwattr DW$T$73, DW_AT_name("GPDDAT_REG")
    3847                      .dwattr DW$T$73, DW_AT_byte_size(0x01)
    3848              DW$430  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3849                      .dwattr DW$430, DW_AT_name("all"), DW_AT_symbol_name("_all")
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   74

    3850                      .dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3851                      .dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3852              DW$431  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
    3853                      .dwattr DW$431, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3854                      .dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3855                      .dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3856                      .dwendtag DW$T$73
    3857              
    3858              
    3859              DW$T$75 .dwtag  DW_TAG_union_type
    3860                      .dwattr DW$T$75, DW_AT_name("GPDSET_REG")
    3861                      .dwattr DW$T$75, DW_AT_byte_size(0x01)
    3862              DW$432  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3863                      .dwattr DW$432, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3864                      .dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3865                      .dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3866              DW$433  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    3867                      .dwattr DW$433, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3868                      .dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3869                      .dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3870                      .dwendtag DW$T$75
    3871              
    3872              
    3873              DW$T$77 .dwtag  DW_TAG_union_type
    3874                      .dwattr DW$T$77, DW_AT_name("GPDCLEAR_REG")
    3875                      .dwattr DW$T$77, DW_AT_byte_size(0x01)
    3876              DW$434  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3877                      .dwattr DW$434, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3878                      .dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3879                      .dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3880              DW$435  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    3881                      .dwattr DW$435, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3882                      .dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3883                      .dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3884                      .dwendtag DW$T$77
    3885              
    3886              
    3887              DW$T$79 .dwtag  DW_TAG_union_type
    3888                      .dwattr DW$T$79, DW_AT_name("GPDTOGGLE_REG")
    3889                      .dwattr DW$T$79, DW_AT_byte_size(0x01)
    3890              DW$436  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3891                      .dwattr DW$436, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3892                      .dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3893                      .dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3894              DW$437  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
    3895                      .dwattr DW$437, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3896                      .dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3897                      .dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3898                      .dwendtag DW$T$79
    3899              
    3900              
    3901              DW$T$81 .dwtag  DW_TAG_union_type
    3902                      .dwattr DW$T$81, DW_AT_name("GPEDAT_REG")
    3903                      .dwattr DW$T$81, DW_AT_byte_size(0x01)
    3904              DW$438  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   75

    3905                      .dwattr DW$438, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3906                      .dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3907                      .dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3908              DW$439  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    3909                      .dwattr DW$439, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3910                      .dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3911                      .dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3912                      .dwendtag DW$T$81
    3913              
    3914              
    3915              DW$T$83 .dwtag  DW_TAG_union_type
    3916                      .dwattr DW$T$83, DW_AT_name("GPESET_REG")
    3917                      .dwattr DW$T$83, DW_AT_byte_size(0x01)
    3918              DW$440  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3919                      .dwattr DW$440, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3920                      .dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3921                      .dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3922              DW$441  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
    3923                      .dwattr DW$441, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3924                      .dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3925                      .dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3926                      .dwendtag DW$T$83
    3927              
    3928              
    3929              DW$T$85 .dwtag  DW_TAG_union_type
    3930                      .dwattr DW$T$85, DW_AT_name("GPECLEAR_REG")
    3931                      .dwattr DW$T$85, DW_AT_byte_size(0x01)
    3932              DW$442  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3933                      .dwattr DW$442, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3934                      .dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3935                      .dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3936              DW$443  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
    3937                      .dwattr DW$443, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3938                      .dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3939                      .dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3940                      .dwendtag DW$T$85
    3941              
    3942              
    3943              DW$T$87 .dwtag  DW_TAG_union_type
    3944                      .dwattr DW$T$87, DW_AT_name("GPETOGGLE_REG")
    3945                      .dwattr DW$T$87, DW_AT_byte_size(0x01)
    3946              DW$444  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3947                      .dwattr DW$444, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3948                      .dwattr DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3949                      .dwattr DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3950              DW$445  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
    3951                      .dwattr DW$445, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3952                      .dwattr DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3953                      .dwattr DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3954                      .dwendtag DW$T$87
    3955              
    3956              
    3957              DW$T$89 .dwtag  DW_TAG_union_type
    3958                      .dwattr DW$T$89, DW_AT_name("GPFDAT_REG")
    3959                      .dwattr DW$T$89, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   76

    3960              DW$446  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3961                      .dwattr DW$446, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3962                      .dwattr DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3963                      .dwattr DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3964              DW$447  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    3965                      .dwattr DW$447, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3966                      .dwattr DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3967                      .dwattr DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3968                      .dwendtag DW$T$89
    3969              
    3970              
    3971              DW$T$91 .dwtag  DW_TAG_union_type
    3972                      .dwattr DW$T$91, DW_AT_name("GPFSET_REG")
    3973                      .dwattr DW$T$91, DW_AT_byte_size(0x01)
    3974              DW$448  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3975                      .dwattr DW$448, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3976                      .dwattr DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3977                      .dwattr DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3978              DW$449  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    3979                      .dwattr DW$449, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3980                      .dwattr DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3981                      .dwattr DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3982                      .dwendtag DW$T$91
    3983              
    3984              
    3985              DW$T$93 .dwtag  DW_TAG_union_type
    3986                      .dwattr DW$T$93, DW_AT_name("GPFCLEAR_REG")
    3987                      .dwattr DW$T$93, DW_AT_byte_size(0x01)
    3988              DW$450  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3989                      .dwattr DW$450, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3990                      .dwattr DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3991                      .dwattr DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3992              DW$451  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
    3993                      .dwattr DW$451, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    3994                      .dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3995                      .dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3996                      .dwendtag DW$T$93
    3997              
    3998              
    3999              DW$T$95 .dwtag  DW_TAG_union_type
    4000                      .dwattr DW$T$95, DW_AT_name("GPFTOGGLE_REG")
    4001                      .dwattr DW$T$95, DW_AT_byte_size(0x01)
    4002              DW$452  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4003                      .dwattr DW$452, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4004                      .dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4005                      .dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4006              DW$453  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
    4007                      .dwattr DW$453, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4008                      .dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4009                      .dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4010                      .dwendtag DW$T$95
    4011              
    4012              
    4013              DW$T$97 .dwtag  DW_TAG_union_type
    4014                      .dwattr DW$T$97, DW_AT_name("GPGDAT_REG")
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   77

    4015                      .dwattr DW$T$97, DW_AT_byte_size(0x01)
    4016              DW$454  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4017                      .dwattr DW$454, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4018                      .dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4019                      .dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4020              DW$455  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$96)
    4021                      .dwattr DW$455, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4022                      .dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4023                      .dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4024                      .dwendtag DW$T$97
    4025              
    4026              
    4027              DW$T$99 .dwtag  DW_TAG_union_type
    4028                      .dwattr DW$T$99, DW_AT_name("GPGSET_REG")
    4029                      .dwattr DW$T$99, DW_AT_byte_size(0x01)
    4030              DW$456  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4031                      .dwattr DW$456, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4032                      .dwattr DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4033                      .dwattr DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4034              DW$457  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$98)
    4035                      .dwattr DW$457, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4036                      .dwattr DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4037                      .dwattr DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4038                      .dwendtag DW$T$99
    4039              
    4040              
    4041              DW$T$101        .dwtag  DW_TAG_union_type
    4042                      .dwattr DW$T$101, DW_AT_name("GPGCLEAR_REG")
    4043                      .dwattr DW$T$101, DW_AT_byte_size(0x01)
    4044              DW$458  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4045                      .dwattr DW$458, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4046                      .dwattr DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4047                      .dwattr DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4048              DW$459  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$100)
    4049                      .dwattr DW$459, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4050                      .dwattr DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4051                      .dwattr DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4052                      .dwendtag DW$T$101
    4053              
    4054              
    4055              DW$T$103        .dwtag  DW_TAG_union_type
    4056                      .dwattr DW$T$103, DW_AT_name("GPGTOGGLE_REG")
    4057                      .dwattr DW$T$103, DW_AT_byte_size(0x01)
    4058              DW$460  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4059                      .dwattr DW$460, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4060                      .dwattr DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4061                      .dwattr DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4062              DW$461  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$102)
    4063                      .dwattr DW$461, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4064                      .dwattr DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4065                      .dwattr DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4066                      .dwendtag DW$T$103
    4067              
    4068              
    4069              DW$T$107        .dwtag  DW_TAG_union_type
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   78

    4070                      .dwattr DW$T$107, DW_AT_name("GPTCONB_REG")
    4071                      .dwattr DW$T$107, DW_AT_byte_size(0x01)
    4072              DW$462  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4073                      .dwattr DW$462, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4074                      .dwattr DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4075                      .dwattr DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4076              DW$463  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$106)
    4077                      .dwattr DW$463, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4078                      .dwattr DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4079                      .dwattr DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4080                      .dwendtag DW$T$107
    4081              
    4082              
    4083              DW$T$109        .dwtag  DW_TAG_union_type
    4084                      .dwattr DW$T$109, DW_AT_name("T3CON_REG")
    4085                      .dwattr DW$T$109, DW_AT_byte_size(0x01)
    4086              DW$464  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4087                      .dwattr DW$464, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4088                      .dwattr DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4089                      .dwattr DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4090              DW$465  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$108)
    4091                      .dwattr DW$465, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4092                      .dwattr DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4093                      .dwattr DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4094                      .dwendtag DW$T$109
    4095              
    4096              
    4097              DW$T$111        .dwtag  DW_TAG_union_type
    4098                      .dwattr DW$T$111, DW_AT_name("T4CON_REG")
    4099                      .dwattr DW$T$111, DW_AT_byte_size(0x01)
    4100              DW$466  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4101                      .dwattr DW$466, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4102                      .dwattr DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4103                      .dwattr DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4104              DW$467  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$110)
    4105                      .dwattr DW$467, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4106                      .dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4107                      .dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4108                      .dwendtag DW$T$111
    4109              
    4110              
    4111              DW$T$113        .dwtag  DW_TAG_union_type
    4112                      .dwattr DW$T$113, DW_AT_name("EXTCONB_REG")
    4113                      .dwattr DW$T$113, DW_AT_byte_size(0x01)
    4114              DW$468  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4115                      .dwattr DW$468, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4116                      .dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4117                      .dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4118              DW$469  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$112)
    4119                      .dwattr DW$469, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4120                      .dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4121                      .dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4122                      .dwendtag DW$T$113
    4123              
    4124              
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   79

    4125              DW$T$115        .dwtag  DW_TAG_union_type
    4126                      .dwattr DW$T$115, DW_AT_name("COMCONB_REG")
    4127                      .dwattr DW$T$115, DW_AT_byte_size(0x01)
    4128              DW$470  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4129                      .dwattr DW$470, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4130                      .dwattr DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4131                      .dwattr DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4132              DW$471  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$114)
    4133                      .dwattr DW$471, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4134                      .dwattr DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4135                      .dwattr DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4136                      .dwendtag DW$T$115
    4137              
    4138              
    4139              DW$T$117        .dwtag  DW_TAG_union_type
    4140                      .dwattr DW$T$117, DW_AT_name("ACTRB_REG")
    4141                      .dwattr DW$T$117, DW_AT_byte_size(0x01)
    4142              DW$472  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4143                      .dwattr DW$472, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4144                      .dwattr DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4145                      .dwattr DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4146              DW$473  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$116)
    4147                      .dwattr DW$473, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4148                      .dwattr DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4149                      .dwattr DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4150                      .dwendtag DW$T$117
    4151              
    4152              
    4153              DW$T$119        .dwtag  DW_TAG_union_type
    4154                      .dwattr DW$T$119, DW_AT_name("DBTCON_REG")
    4155                      .dwattr DW$T$119, DW_AT_byte_size(0x01)
    4156              DW$474  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4157                      .dwattr DW$474, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4158                      .dwattr DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4159                      .dwattr DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4160              DW$475  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$118)
    4161                      .dwattr DW$475, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4162                      .dwattr DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4163                      .dwattr DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4164                      .dwendtag DW$T$119
    4165              
    4166              
    4167              DW$T$121        .dwtag  DW_TAG_union_type
    4168                      .dwattr DW$T$121, DW_AT_name("CAPCONB_REG")
    4169                      .dwattr DW$T$121, DW_AT_byte_size(0x01)
    4170              DW$476  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4171                      .dwattr DW$476, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4172                      .dwattr DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4173                      .dwattr DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4174              DW$477  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$120)
    4175                      .dwattr DW$477, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4176                      .dwattr DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4177                      .dwattr DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4178                      .dwendtag DW$T$121
    4179              
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   80

    4180              
    4181              DW$T$123        .dwtag  DW_TAG_union_type
    4182                      .dwattr DW$T$123, DW_AT_name("CAPFIFOB_REG")
    4183                      .dwattr DW$T$123, DW_AT_byte_size(0x01)
    4184              DW$478  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4185                      .dwattr DW$478, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4186                      .dwattr DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4187                      .dwattr DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4188              DW$479  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$122)
    4189                      .dwattr DW$479, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4190                      .dwattr DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4191                      .dwattr DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4192                      .dwendtag DW$T$123
    4193              
    4194              
    4195              DW$T$125        .dwtag  DW_TAG_union_type
    4196                      .dwattr DW$T$125, DW_AT_name("EVBIMRA_REG")
    4197                      .dwattr DW$T$125, DW_AT_byte_size(0x01)
    4198              DW$480  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4199                      .dwattr DW$480, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4200                      .dwattr DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4201                      .dwattr DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4202              DW$481  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$124)
    4203                      .dwattr DW$481, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4204                      .dwattr DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4205                      .dwattr DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4206                      .dwendtag DW$T$125
    4207              
    4208              
    4209              DW$T$127        .dwtag  DW_TAG_union_type
    4210                      .dwattr DW$T$127, DW_AT_name("EVBIMRB_REG")
    4211                      .dwattr DW$T$127, DW_AT_byte_size(0x01)
    4212              DW$482  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4213                      .dwattr DW$482, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4214                      .dwattr DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4215                      .dwattr DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4216              DW$483  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$126)
    4217                      .dwattr DW$483, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4218                      .dwattr DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4219                      .dwattr DW$483, DW_AT_accessibility(DW_ACCESS_public)
    4220                      .dwendtag DW$T$127
    4221              
    4222              
    4223              DW$T$129        .dwtag  DW_TAG_union_type
    4224                      .dwattr DW$T$129, DW_AT_name("EVBIMRC_REG")
    4225                      .dwattr DW$T$129, DW_AT_byte_size(0x01)
    4226              DW$484  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4227                      .dwattr DW$484, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4228                      .dwattr DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4229                      .dwattr DW$484, DW_AT_accessibility(DW_ACCESS_public)
    4230              DW$485  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$128)
    4231                      .dwattr DW$485, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4232                      .dwattr DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4233                      .dwattr DW$485, DW_AT_accessibility(DW_ACCESS_public)
    4234                      .dwendtag DW$T$129
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:31 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9922                            PAGE   81

    4235              
    4236              
    4237              DW$T$131        .dwtag  DW_TAG_union_type
    4238                      .dwattr DW$T$131, DW_AT_name("EVBIFRA_REG")
    4239                      .dwattr DW$T$131, DW_AT_byte_size(0x01)
    4240              DW$486  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4241                      .dwattr DW$486, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4242                      .dwattr DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4243                      .dwattr DW$486, DW_AT_accessibility(DW_ACCESS_public)
    4244              DW$487  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$130)
    4245                      .dwattr DW$487, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4246                      .dwattr DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4247                      .dwattr DW$487, DW_AT_accessibility(DW_ACCESS_public)
    4248                      .dwendtag DW$T$131
    4249              
    4250              
    4251              DW$T$133        .dwtag  DW_TAG_union_type
    4252                      .dwattr DW$T$133, DW_AT_name("EVBIFRB_REG")
    4253                      .dwattr DW$T$133, DW_AT_byte_size(0x01)
    4254              DW$488  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4255                      .dwattr DW$488, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4256                      .dwattr DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4257                      .dwattr DW$488, DW_AT_accessibility(DW_ACCESS_public)
    4258              DW$489  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$132)
    4259                      .dwattr DW$489, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4260                      .dwattr DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4261                      .dwattr DW$489, DW_AT_accessibility(DW_ACCESS_public)
    4262                      .dwendtag DW$T$133
    4263              
    4264              
    4265              DW$T$135        .dwtag  DW_TAG_union_type
    4266                      .dwattr DW$T$135, DW_AT_name("EVBIFRC_REG")
    4267                      .dwattr DW$T$135, DW_AT_byte_size(0x01)
    4268              DW$490  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4269                      .dwattr DW$490, DW_AT_name("all"), DW_AT_symbol_name("_all")
    4270                      .dwattr DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4271                      .dwattr DW$490, DW_AT_accessibility(DW_ACCESS_public)
    4272              DW$491  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$134)
    4273                      .dwattr DW$491, DW_AT_name("bit"), DW_AT_symbol_name("_bit")
    4274                      .dwattr DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4275                      .dwattr DW$491, DW_AT_accessibility(DW_ACCESS_public)
    4276                      .dwendtag DW$T$135
    4277              
    4278              
    4279              DW$T$20 .dwtag  DW_TAG_structure_type
    4280                      .dwattr DW$T$20, DW_AT_name("GPAMUX_BITS")
    4281                      .dwattr DW$T$20, DW_AT_byte_size(0x01)
    4282              DW$492  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4283                      .dwattr DW$492, DW_AT_name("PWM1_GPIOA0"), DW_AT_symbol_name("_PWM1_GPIOA0")
    4284                      .dwattr DW$492, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4285                      .dwattr DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4286                      .dwattr DW$492, DW_AT_accessibility(DW_ACCESS_public)
    4287              DW$493  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
