TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 18 15:40:02 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Tue Sep 18 15:40:02 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("Gui_lib_connect.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("lcd_display_ASClib"), DW_AT_symbol_name("_lcd_display_ASClib")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)

    1809                      .dwendtag DW$T$42
    1810              
    1811              
    1812              DW$T$44 .dwtag  DW_TAG_subroutine_type
    1813                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
    1814              DW$108  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1815              DW$109  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1816              DW$110  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$16)
    1817                      .dwendtag DW$T$44
    1818              
    1819              
    1820              DW$T$45 .dwtag  DW_TAG_subroutine_type
    1821                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    1822              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1823                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1824                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1825              
    1826              DW$T$48 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$46)
    1827                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
    1828                      .dwattr DW$T$48, DW_AT_byte_size(0x400)
    1829              DW$111  .dwtag  DW_TAG_subrange_type
    1830                      .dwattr DW$111, DW_AT_upper_bound(0x0f)
    1831              DW$112  .dwtag  DW_TAG_subrange_type
    1832                      .dwattr DW$112, DW_AT_upper_bound(0x3f)
    1833                      .dwendtag DW$T$48
    1834              
    1835              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    1836                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1837                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
    1838              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1839                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1840                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1841              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
    1842                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    1843              
    1844              DW$T$51 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
    1845                      .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
    1846              DW$113  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$16)
    1847              DW$114  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
    1848              DW$115  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1849                      .dwendtag DW$T$51
    1850              
    1851              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
    1852                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
    1853                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 18 15:40:02 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   35

    1854              DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1855                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
    1856                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    1857              
    1858              DW$T$53 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$26)
    1859                      .dwattr DW$T$53, DW_AT_language(DW_LANG_C)
    1860                      .dwattr DW$T$53, DW_AT_byte_size(0x10)
    1861              DW$116  .dwtag  DW_TAG_subrange_type
    1862                      .dwattr DW$116, DW_AT_upper_bound(0x0f)
    1863                      .dwendtag DW$T$53
    1864              
    1865              
    1866              DW$T$54 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$26)
    1867                      .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    1868                      .dwattr DW$T$54, DW_AT_byte_size(0x14)
    1869              DW$117  .dwtag  DW_TAG_subrange_type
    1870                      .dwattr DW$117, DW_AT_upper_bound(0x13)
    1871                      .dwendtag DW$T$54
    1872              
    1873              DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    1874                      .dwattr DW$T$33, DW_AT_address_class(0x16)
    1875              
    1876              DW$T$55 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    1877                      .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
    1878                      .dwattr DW$T$55, DW_AT_byte_size(0x14)
    1879              DW$118  .dwtag  DW_TAG_subrange_type
    1880                      .dwattr DW$118, DW_AT_upper_bound(0x13)
    1881                      .dwendtag DW$T$55
    1882              
    1883              DW$T$58 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$57)
    1884                      .dwattr DW$T$58, DW_AT_address_class(0x16)
    1885              DW$119  .dwtag  DW_TAG_far_type
    1886                      .dwattr DW$119, DW_AT_type(*DW$T$6)
    1887              DW$T$46 .dwtag  DW_TAG_const_type
    1888                      .dwattr DW$T$46, DW_AT_type(*DW$119)
    1889              DW$120  .dwtag  DW_TAG_far_type
    1890                      .dwattr DW$120, DW_AT_type(*DW$T$25)
    1891              DW$T$26 .dwtag  DW_TAG_const_type
    1892                      .dwattr DW$T$26, DW_AT_type(*DW$120)
    1893              DW$T$57 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$30)
    1894                      .dwattr DW$T$57, DW_AT_language(DW_LANG_C)
    1895              
    1896              DW$T$30 .dwtag  DW_TAG_structure_type
    1897                      .dwattr DW$T$30, DW_AT_name("hwin")
    1898                      .dwattr DW$T$30, DW_AT_byte_size(0x22)
    1899              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1900                      .dwattr DW$121, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    1901                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1903              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1904                      .dwattr DW$122, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    1905                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1906                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1907              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1908                      .dwattr DW$123, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 18 15:40:02 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   36

    1909                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1910                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1911              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1912                      .dwattr DW$124, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    1913                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1914                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1915              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1916                      .dwattr DW$125, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    1917                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1918                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1919              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1920                      .dwattr DW$126, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    1921                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1922                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1923              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1924                      .dwattr DW$127, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    1925                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1926                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1927              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1928                      .dwattr DW$128, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    1929                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1930                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1931              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1932                      .dwattr DW$129, DW_AT_name("type"), DW_AT_symbol_name("_type")
    1933                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1934                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1935              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1936                      .dwattr DW$130, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    1937                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1938                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1939              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1940                      .dwattr DW$131, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    1941                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1942                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1943              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1944                      .dwattr DW$132, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
    1945                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1946                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1947              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1948                      .dwattr DW$133, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    1949                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1950                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1951              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1952                      .dwattr DW$134, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    1953                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1954                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1955              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1956                      .dwattr DW$135, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    1957                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1958                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1959              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1960                      .dwattr DW$136, DW_AT_name("drop_list_is_start"), DW_AT_symbol_name("_drop_list_is_start")
    1961                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1962                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1963              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 18 15:40:02 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   37

    1964                      .dwattr DW$137, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    1965                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1966                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1967              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1968                      .dwattr DW$138, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
    1969                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1970                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1971              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1972                      .dwattr DW$139, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    1973                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1974                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1975              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1976                      .dwattr DW$140, DW_AT_name("checkbox_radio_state"), DW_AT_symbol_name("_checkbox_radio_state")
    1977                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1978                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1979              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1980                      .dwattr DW$141, DW_AT_name("title_len"), DW_AT_symbol_name("_title_len")
    1981                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1982                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1983              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1984                      .dwattr DW$142, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
    1985                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1986                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1987              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1988                      .dwattr DW$143, DW_AT_name("pwidget"), DW_AT_symbol_name("_pwidget")
    1989                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1990                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1991                      .dwendtag DW$T$30
    1992              
    1993              DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
    1994                      .dwattr DW$T$22, DW_AT_address_class(0x16)
    1995              DW$T$3  .dwtag  DW_TAG_pointer_type
    1996                      .dwattr DW$T$3, DW_AT_address_class(0x16)
    1997              DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$6)
    1998                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    1999              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    2000                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    2001              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
    2002                      .dwattr DW$T$28, DW_AT_address_class(0x16)
    2003              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$21)
    2004                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    2005              DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
    2006                      .dwattr DW$T$27, DW_AT_address_class(0x16)
    2007              
    2008              DW$T$21 .dwtag  DW_TAG_structure_type
    2009                      .dwattr DW$T$21, DW_AT_name("edit_mem")
    2010                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    2011              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2012                      .dwattr DW$144, DW_AT_name("x"), DW_AT_symbol_name("_x")
    2013                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2014                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2015              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2016                      .dwattr DW$145, DW_AT_name("y"), DW_AT_symbol_name("_y")
    2017                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2018                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 18 15:40:02 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   38

    2019              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2020                      .dwattr DW$146, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    2021                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2022                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2023              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2024                      .dwattr DW$147, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    2025                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2026                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2027              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2028                      .dwattr DW$148, DW_AT_name("id"), DW_AT_symbol_name("_id")
    2029                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2030                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2031              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2032                      .dwattr DW$149, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    2033                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2034                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2035              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    2036                      .dwattr DW$150, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    2037                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2038                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2039                      .dwendtag DW$T$21
    2040              
    2041              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
    2042                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    2043              
    2044                      .dwattr DW$62, DW_AT_external(0x01)
    2045                      .dwattr DW$72, DW_AT_external(0x01)
    2046                      .dwattr DW$22, DW_AT_external(0x01)
    2047                      .dwattr DW$31, DW_AT_external(0x01)
    2048                      .dwattr DW$40, DW_AT_external(0x01)
    2049                      .dwattr DW$80, DW_AT_external(0x01)
    2050                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    2051              
    2052              ;***************************************************************
    2053              ;* DWARF CIE ENTRIES                                           *
    2054              ;***************************************************************
    2055              
    2056              DW$CIE  .dwcie 1, 40
    2057                      .dwcfa  0x0c, 20, 0
    2058                      .dwcfa  0x07, 0
    2059                      .dwcfa  0x07, 1
    2060                      .dwcfa  0x07, 2
    2061                      .dwcfa  0x07, 3
    2062                      .dwcfa  0x07, 4
    2063                      .dwcfa  0x07, 5
    2064                      .dwcfa  0x08, 6
    2065                      .dwcfa  0x08, 7
    2066                      .dwcfa  0x08, 8
    2067                      .dwcfa  0x08, 9
    2068                      .dwcfa  0x08, 10
    2069                      .dwcfa  0x08, 11
    2070                      .dwcfa  0x07, 12
    2071                      .dwcfa  0x07, 13
    2072                      .dwcfa  0x07, 14
    2073                      .dwcfa  0x07, 15
TMS320C2000 COFF Assembler PC v4.1.3 Tue Sep 18 15:40:02 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   39

    2074                      .dwcfa  0x07, 16
    2075                      .dwcfa  0x07, 17
    2076                      .dwcfa  0x07, 18
    2077                      .dwcfa  0x07, 19
    2078                      .dwcfa  0x07, 20
    2079                      .dwcfa  0x07, 21
    2080                      .dwcfa  0x07, 22
    2081                      .dwcfa  0x07, 23
    2082                      .dwcfa  0x07, 24
    2083                      .dwcfa  0x07, 25
    2084                      .dwcfa  0x07, 26
    2085                      .dwcfa  0x08, 27
    2086                      .dwcfa  0x07, 28
    2087                      .dwcfa  0x07, 29
    2088                      .dwcfa  0x07, 30
    2089                      .dwcfa  0x07, 31
    2090                      .dwcfa  0x07, 32
    2091                      .dwcfa  0x07, 33
    2092                      .dwcfa  0x07, 34
    2093                      .dwcfa  0x07, 35
    2094                      .dwcfa  0x07, 36
    2095                      .dwcfa  0x07, 37
    2096                      .dwcfa  0x07, 38
    2097                      .dwcfa  0x07, 39
    2098                      .dwcfa  0x07, 40
    2099              
    2100              ;***************************************************************
    2101              ;* DWARF REGISTER MAP                                          *
    2102              ;***************************************************************
    2103              
    2104              DW$151  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    2105                      .dwattr DW$151, DW_AT_location[DW_OP_reg0]
    2106              DW$152  .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
    2107                      .dwattr DW$152, DW_AT_location[DW_OP_reg1]
