TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:34 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9882                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Nov 29 16:03:32 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("Gui_widget.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

   11958              DW$T$159        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$158)
   11959                      .dwattr DW$T$159, DW_AT_address_class(0x16)
   11960              DW$T$160        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$159)
   11961                      .dwattr DW$T$160, DW_AT_address_class(0x16)
   11962              DW$T$102        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$101)
   11963                      .dwattr DW$T$102, DW_AT_address_class(0x16)
   11964              
   11965              DW$T$220        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$102)
   11966                      .dwattr DW$T$220, DW_AT_language(DW_LANG_C)
   11967              DW$1034 .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
   11968              DW$1035 .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
   11969              DW$1036 .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
   11970              DW$1037 .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
   11971                      .dwendtag DW$T$220
   11972              
   11973              DW$T$223        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$222)
   11974                      .dwattr DW$T$223, DW_AT_address_class(0x16)
   11975              
   11976              DW$T$224        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$223)
   11977                      .dwattr DW$T$224, DW_AT_language(DW_LANG_C)
   11978              DW$1038 .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$54)
   11979                      .dwendtag DW$T$224
   11980              
   11981              DW$T$216        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$215)
   11982                      .dwattr DW$T$216, DW_AT_address_class(0x16)
   11983              DW$T$226        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$214)
   11984                      .dwattr DW$T$226, DW_AT_address_class(0x16)
   11985              DW$T$146        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$145)
   11986                      .dwattr DW$T$146, DW_AT_address_class(0x16)
   11987              
   11988              DW$T$228        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$227)
   11989                      .dwattr DW$T$228, DW_AT_language(DW_LANG_C)
   11990                      .dwattr DW$T$228, DW_AT_byte_size(0x78)
   11991              DW$1039 .dwtag  DW_TAG_subrange_type
   11992                      .dwattr DW$1039, DW_AT_upper_bound(0x1d)
   11993                      .dwendtag DW$T$228
   11994              
   11995              
   11996              DW$T$171        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
   11997                      .dwattr DW$T$171, DW_AT_language(DW_LANG_C)
   11998              DW$1040 .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$54)
   11999                      .dwendtag DW$T$171
   12000              
   12001              DW$1041 .dwtag  DW_TAG_far_type
   12002                      .dwattr DW$1041, DW_AT_type(*DW$T$19)
   12003              DW$T$20 .dwtag  DW_TAG_const_type
   12004                      .dwattr DW$T$20, DW_AT_type(*DW$1041)
   12005              DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT"), DW_AT_type(*DW$T$26)
   12006                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
   12007              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$32)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:34 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9882                            PAGE  232

   12008                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
   12009              DW$T$53 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$38)
   12010                      .dwattr DW$T$53, DW_AT_language(DW_LANG_C)
   12011              DW$T$92 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$42)
   12012                      .dwattr DW$T$92, DW_AT_language(DW_LANG_C)
   12013              DW$T$93 .dwtag  DW_TAG_typedef, DW_AT_name("a_lock_t"), DW_AT_type(*DW$T$92)
   12014                      .dwattr DW$T$93, DW_AT_language(DW_LANG_C)
   12015              DW$T$158        .dwtag  DW_TAG_typedef, DW_AT_name("a_sem_t"), DW_AT_type(*DW$T$92)
   12016                      .dwattr DW$T$158, DW_AT_language(DW_LANG_C)
   12017              DW$T$101        .dwtag  DW_TAG_typedef, DW_AT_name("lcd_csr_arg_t"), DW_AT_type(*DW$T$49)
   12018                      .dwattr DW$T$101, DW_AT_language(DW_LANG_C)
   12019              DW$T$222        .dwtag  DW_TAG_typedef, DW_AT_name("widget_button_t"), DW_AT_type(*DW$T$51)
   12020                      .dwattr DW$T$222, DW_AT_language(DW_LANG_C)
   12021              DW$T$214        .dwtag  DW_TAG_typedef, DW_AT_name("dialogBox_t"), DW_AT_type(*DW$T$57)
   12022                      .dwattr DW$T$214, DW_AT_language(DW_LANG_C)
   12023              DW$1042 .dwtag  DW_TAG_far_type
   12024                      .dwattr DW$1042, DW_AT_type(*DW$T$214)
   12025              DW$T$215        .dwtag  DW_TAG_const_type
   12026                      .dwattr DW$T$215, DW_AT_type(*DW$1042)
   12027              DW$T$145        .dwtag  DW_TAG_typedef, DW_AT_name("app_touch_t"), DW_AT_type(*DW$T$58)
   12028                      .dwattr DW$T$145, DW_AT_language(DW_LANG_C)
   12029              DW$T$227        .dwtag  DW_TAG_typedef, DW_AT_name("dialogBox_ctl_t"), DW_AT_type(*DW$T$59)
   12030                      .dwattr DW$T$227, DW_AT_language(DW_LANG_C)
   12031              
   12032              DW$T$26 .dwtag  DW_TAG_structure_type
   12033                      .dwattr DW$T$26, DW_AT_name("GUI_FONT")
   12034                      .dwattr DW$T$26, DW_AT_byte_size(0x0c)
   12035              DW$1043 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
   12036                      .dwattr DW$1043, DW_AT_name("start_asc"), DW_AT_symbol_name("_start_asc")
   12037                      .dwattr DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12038                      .dwattr DW$1043, DW_AT_accessibility(DW_ACCESS_public)
   12039              DW$1044 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
   12040                      .dwattr DW$1044, DW_AT_name("end_asc"), DW_AT_symbol_name("_end_asc")
   12041                      .dwattr DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12042                      .dwattr DW$1044, DW_AT_accessibility(DW_ACCESS_public)
   12043              DW$1045 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   12044                      .dwattr DW$1045, DW_AT_name("nbyte"), DW_AT_symbol_name("_nbyte")
   12045                      .dwattr DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12046                      .dwattr DW$1045, DW_AT_accessibility(DW_ACCESS_public)
   12047              DW$1046 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12048                      .dwattr DW$1046, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
   12049                      .dwattr DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12050                      .dwattr DW$1046, DW_AT_accessibility(DW_ACCESS_public)
   12051              DW$1047 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12052                      .dwattr DW$1047, DW_AT_name("high"), DW_AT_symbol_name("_high")
   12053                      .dwattr DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12054                      .dwattr DW$1047, DW_AT_accessibility(DW_ACCESS_public)
   12055              DW$1048 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12056                      .dwattr DW$1048, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
   12057                      .dwattr DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12058                      .dwattr DW$1048, DW_AT_accessibility(DW_ACCESS_public)
   12059              DW$1049 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   12060                      .dwattr DW$1049, DW_AT_name("pcode"), DW_AT_symbol_name("_pcode")
   12061                      .dwattr DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12062                      .dwattr DW$1049, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:34 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9882                            PAGE  233

   12063              DW$1050 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
   12064                      .dwattr DW$1050, DW_AT_name("pNext"), DW_AT_symbol_name("_pNext")
   12065                      .dwattr DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12066                      .dwattr DW$1050, DW_AT_accessibility(DW_ACCESS_public)
   12067                      .dwendtag DW$T$26
   12068              
   12069              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
   12070                      .dwattr DW$T$25, DW_AT_address_class(0x16)
   12071              
   12072              DW$T$32 .dwtag  DW_TAG_structure_type
   12073                      .dwattr DW$T$32, DW_AT_name("edit_mem")
   12074                      .dwattr DW$T$32, DW_AT_byte_size(0x0c)
   12075              DW$1051 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12076                      .dwattr DW$1051, DW_AT_name("x"), DW_AT_symbol_name("_x")
   12077                      .dwattr DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12078                      .dwattr DW$1051, DW_AT_accessibility(DW_ACCESS_public)
   12079              DW$1052 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12080                      .dwattr DW$1052, DW_AT_name("y"), DW_AT_symbol_name("_y")
   12081                      .dwattr DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12082                      .dwattr DW$1052, DW_AT_accessibility(DW_ACCESS_public)
   12083              DW$1053 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12084                      .dwattr DW$1053, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
   12085                      .dwattr DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12086                      .dwattr DW$1053, DW_AT_accessibility(DW_ACCESS_public)
   12087              DW$1054 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12088                      .dwattr DW$1054, DW_AT_name("CHhigh"), DW_AT_symbol_name("_CHhigh")
   12089                      .dwattr DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12090                      .dwattr DW$1054, DW_AT_accessibility(DW_ACCESS_public)
   12091              DW$1055 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12092                      .dwattr DW$1055, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
   12093                      .dwattr DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12094                      .dwattr DW$1055, DW_AT_accessibility(DW_ACCESS_public)
   12095              DW$1056 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12096                      .dwattr DW$1056, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
   12097                      .dwattr DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12098                      .dwattr DW$1056, DW_AT_accessibility(DW_ACCESS_public)
   12099              DW$1057 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12100                      .dwattr DW$1057, DW_AT_name("id"), DW_AT_symbol_name("_id")
   12101                      .dwattr DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12102                      .dwattr DW$1057, DW_AT_accessibility(DW_ACCESS_public)
   12103              DW$1058 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   12104                      .dwattr DW$1058, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
   12105                      .dwattr DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12106                      .dwattr DW$1058, DW_AT_accessibility(DW_ACCESS_public)
   12107              DW$1059 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
   12108                      .dwattr DW$1059, DW_AT_name("pfront"), DW_AT_symbol_name("_pfront")
   12109                      .dwattr DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12110                      .dwattr DW$1059, DW_AT_accessibility(DW_ACCESS_public)
   12111              DW$1060 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
   12112                      .dwattr DW$1060, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
   12113                      .dwattr DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12114                      .dwattr DW$1060, DW_AT_accessibility(DW_ACCESS_public)
   12115                      .dwendtag DW$T$32
   12116              
   12117              DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:34 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9882                            PAGE  234

   12118                      .dwattr DW$T$31, DW_AT_address_class(0x16)
   12119              
   12120              DW$T$38 .dwtag  DW_TAG_structure_type
   12121                      .dwattr DW$T$38, DW_AT_name("hwin")
   12122                      .dwattr DW$T$38, DW_AT_byte_size(0x22)
   12123              DW$1061 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12124                      .dwattr DW$1061, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
   12125                      .dwattr DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12126                      .dwattr DW$1061, DW_AT_accessibility(DW_ACCESS_public)
   12127              DW$1062 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12128                      .dwattr DW$1062, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
   12129                      .dwattr DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12130                      .dwattr DW$1062, DW_AT_accessibility(DW_ACCESS_public)
   12131              DW$1063 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12132                      .dwattr DW$1063, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
   12133                      .dwattr DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12134                      .dwattr DW$1063, DW_AT_accessibility(DW_ACCESS_public)
   12135              DW$1064 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12136                      .dwattr DW$1064, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
   12137                      .dwattr DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12138                      .dwattr DW$1064, DW_AT_accessibility(DW_ACCESS_public)
   12139              DW$1065 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12140                      .dwattr DW$1065, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
   12141                      .dwattr DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12142                      .dwattr DW$1065, DW_AT_accessibility(DW_ACCESS_public)
   12143              DW$1066 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12144                      .dwattr DW$1066, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
   12145                      .dwattr DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12146                      .dwattr DW$1066, DW_AT_accessibility(DW_ACCESS_public)
   12147              DW$1067 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12148                      .dwattr DW$1067, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
   12149                      .dwattr DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12150                      .dwattr DW$1067, DW_AT_accessibility(DW_ACCESS_public)
   12151              DW$1068 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12152                      .dwattr DW$1068, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
   12153                      .dwattr DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12154                      .dwattr DW$1068, DW_AT_accessibility(DW_ACCESS_public)
   12155              DW$1069 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12156                      .dwattr DW$1069, DW_AT_name("type"), DW_AT_symbol_name("_type")
   12157                      .dwattr DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12158                      .dwattr DW$1069, DW_AT_accessibility(DW_ACCESS_public)
   12159              DW$1070 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
   12160                      .dwattr DW$1070, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
   12161                      .dwattr DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12162                      .dwattr DW$1070, DW_AT_accessibility(DW_ACCESS_public)
   12163              DW$1071 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
   12164                      .dwattr DW$1071, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
   12165                      .dwattr DW$1071, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12166                      .dwattr DW$1071, DW_AT_accessibility(DW_ACCESS_public)
   12167              DW$1072 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
   12168                      .dwattr DW$1072, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
   12169                      .dwattr DW$1072, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12170                      .dwattr DW$1072, DW_AT_accessibility(DW_ACCESS_public)
   12171              DW$1073 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
   12172                      .dwattr DW$1073, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:34 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9882                            PAGE  235

   12173                      .dwattr DW$1073, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12174                      .dwattr DW$1073, DW_AT_accessibility(DW_ACCESS_public)
   12175              DW$1074 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
   12176                      .dwattr DW$1074, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
   12177                      .dwattr DW$1074, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   12178                      .dwattr DW$1074, DW_AT_accessibility(DW_ACCESS_public)
   12179              DW$1075 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
   12180                      .dwattr DW$1075, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
   12181                      .dwattr DW$1075, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   12182                      .dwattr DW$1075, DW_AT_accessibility(DW_ACCESS_public)
   12183              DW$1076 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   12184                      .dwattr DW$1076, DW_AT_name("drop_list_is_start"), DW_AT_symbol_name("_drop_list_is_start")
   12185                      .dwattr DW$1076, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12186                      .dwattr DW$1076, DW_AT_accessibility(DW_ACCESS_public)
   12187              DW$1077 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
   12188                      .dwattr DW$1077, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
   12189                      .dwattr DW$1077, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12190                      .dwattr DW$1077, DW_AT_accessibility(DW_ACCESS_public)
   12191              DW$1078 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   12192                      .dwattr DW$1078, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
   12193                      .dwattr DW$1078, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   12194                      .dwattr DW$1078, DW_AT_accessibility(DW_ACCESS_public)
   12195              DW$1079 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   12196                      .dwattr DW$1079, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
   12197                      .dwattr DW$1079, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
   12198                      .dwattr DW$1079, DW_AT_accessibility(DW_ACCESS_public)
   12199              DW$1080 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
   12200                      .dwattr DW$1080, DW_AT_name("checkbox_radio_state"), DW_AT_symbol_name("_checkbox_radio_state")
   12201                      .dwattr DW$1080, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   12202                      .dwattr DW$1080, DW_AT_accessibility(DW_ACCESS_public)
   12203              DW$1081 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12204                      .dwattr DW$1081, DW_AT_name("title_len"), DW_AT_symbol_name("_title_len")
   12205                      .dwattr DW$1081, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
   12206                      .dwattr DW$1081, DW_AT_accessibility(DW_ACCESS_public)
   12207              DW$1082 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12208                      .dwattr DW$1082, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
   12209                      .dwattr DW$1082, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   12210                      .dwattr DW$1082, DW_AT_accessibility(DW_ACCESS_public)
   12211              DW$1083 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
   12212                      .dwattr DW$1083, DW_AT_name("pwidget"), DW_AT_symbol_name("_pwidget")
   12213                      .dwattr DW$1083, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   12214                      .dwattr DW$1083, DW_AT_accessibility(DW_ACCESS_public)
   12215                      .dwendtag DW$T$38
   12216              
   12217              DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
   12218                      .dwattr DW$T$33, DW_AT_address_class(0x16)
   12219              
   12220              DW$T$42 .dwtag  DW_TAG_structure_type
   12221                      .dwattr DW$T$42, DW_AT_name("os_event")
   12222                      .dwattr DW$T$42, DW_AT_byte_size(0x0e)
   12223              DW$1084 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
   12224                      .dwattr DW$1084, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
   12225                      .dwattr DW$1084, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12226                      .dwattr DW$1084, DW_AT_accessibility(DW_ACCESS_public)
   12227              DW$1085 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:34 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9882                            PAGE  236

   12228                      .dwattr DW$1085, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
   12229                      .dwattr DW$1085, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12230                      .dwattr DW$1085, DW_AT_accessibility(DW_ACCESS_public)
   12231              DW$1086 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
   12232                      .dwattr DW$1086, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
   12233                      .dwattr DW$1086, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12234                      .dwattr DW$1086, DW_AT_accessibility(DW_ACCESS_public)
   12235              DW$1087 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
   12236                      .dwattr DW$1087, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
   12237                      .dwattr DW$1087, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12238                      .dwattr DW$1087, DW_AT_accessibility(DW_ACCESS_public)
   12239              DW$1088 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
   12240                      .dwattr DW$1088, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
   12241                      .dwattr DW$1088, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12242                      .dwattr DW$1088, DW_AT_accessibility(DW_ACCESS_public)
   12243                      .dwendtag DW$T$42
   12244              
   12245              
   12246              DW$T$49 .dwtag  DW_TAG_structure_type
   12247                      .dwattr DW$T$49, DW_AT_byte_size(0x0a)
   12248              DW$1089 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12249                      .dwattr DW$1089, DW_AT_name("x"), DW_AT_symbol_name("_x")
   12250                      .dwattr DW$1089, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12251                      .dwattr DW$1089, DW_AT_accessibility(DW_ACCESS_public)
   12252              DW$1090 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12253                      .dwattr DW$1090, DW_AT_name("y"), DW_AT_symbol_name("_y")
   12254                      .dwattr DW$1090, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12255                      .dwattr DW$1090, DW_AT_accessibility(DW_ACCESS_public)
   12256              DW$1091 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12257                      .dwattr DW$1091, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
   12258                      .dwattr DW$1091, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12259                      .dwattr DW$1091, DW_AT_accessibility(DW_ACCESS_public)
   12260              DW$1092 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12261                      .dwattr DW$1092, DW_AT_name("high"), DW_AT_symbol_name("_high")
   12262                      .dwattr DW$1092, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12263                      .dwattr DW$1092, DW_AT_accessibility(DW_ACCESS_public)
   12264              DW$1093 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
   12265                      .dwattr DW$1093, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
   12266                      .dwattr DW$1093, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12267                      .dwattr DW$1093, DW_AT_accessibility(DW_ACCESS_public)
   12268              DW$1094 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
   12269                      .dwattr DW$1094, DW_AT_name("flicker_flag"), DW_AT_symbol_name("_flicker_flag")
   12270                      .dwattr DW$1094, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12271                      .dwattr DW$1094, DW_AT_accessibility(DW_ACCESS_public)
   12272              DW$1095 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
   12273                      .dwattr DW$1095, DW_AT_name("csr_shadow"), DW_AT_symbol_name("_csr_shadow")
   12274                      .dwattr DW$1095, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12275                      .dwattr DW$1095, DW_AT_accessibility(DW_ACCESS_public)
   12276              DW$1096 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
   12277                      .dwattr DW$1096, DW_AT_name("csr_tmr_id"), DW_AT_symbol_name("_csr_tmr_id")
   12278                      .dwattr DW$1096, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12279                      .dwattr DW$1096, DW_AT_accessibility(DW_ACCESS_public)
   12280                      .dwendtag DW$T$49
   12281              
   12282              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:34 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9882                            PAGE  237

   12283              DW$T$51 .dwtag  DW_TAG_structure_type
   12284                      .dwattr DW$T$51, DW_AT_byte_size(0x1e)
   12285              DW$1097 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
   12286                      .dwattr DW$1097, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
   12287                      .dwattr DW$1097, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12288                      .dwattr DW$1097, DW_AT_accessibility(DW_ACCESS_public)
   12289              DW$1098 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
   12290                      .dwattr DW$1098, DW_AT_name("button_icon"), DW_AT_symbol_name("_button_icon")
   12291                      .dwattr DW$1098, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12292                      .dwattr DW$1098, DW_AT_accessibility(DW_ACCESS_public)
   12293              DW$1099 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
   12294                      .dwattr DW$1099, DW_AT_name("button_state"), DW_AT_symbol_name("_button_state")
   12295                      .dwattr DW$1099, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12296                      .dwattr DW$1099, DW_AT_accessibility(DW_ACCESS_public)
   12297              DW$1100 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12298                      .dwattr DW$1100, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
   12299                      .dwattr DW$1100, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   12300                      .dwattr DW$1100, DW_AT_accessibility(DW_ACCESS_public)
   12301              DW$1101 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12302                      .dwattr DW$1101, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
   12303                      .dwattr DW$1101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   12304                      .dwattr DW$1101, DW_AT_accessibility(DW_ACCESS_public)
   12305              DW$1102 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
   12306                      .dwattr DW$1102, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
   12307                      .dwattr DW$1102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   12308                      .dwattr DW$1102, DW_AT_accessibility(DW_ACCESS_public)
   12309                      .dwendtag DW$T$51
   12310              
   12311              
   12312              DW$T$57 .dwtag  DW_TAG_structure_type
   12313                      .dwattr DW$T$57, DW_AT_byte_size(0x10)
   12314              DW$1103 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12315                      .dwattr DW$1103, DW_AT_name("member_type"), DW_AT_symbol_name("_member_type")
   12316                      .dwattr DW$1103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12317                      .dwattr DW$1103, DW_AT_accessibility(DW_ACCESS_public)
   12318              DW$1104 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12319                      .dwattr DW$1104, DW_AT_name("member_id"), DW_AT_symbol_name("_member_id")
   12320                      .dwattr DW$1104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12321                      .dwattr DW$1104, DW_AT_accessibility(DW_ACCESS_public)
   12322              DW$1105 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
   12323                      .dwattr DW$1105, DW_AT_name("member_title"), DW_AT_symbol_name("_member_title")
   12324                      .dwattr DW$1105, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12325                      .dwattr DW$1105, DW_AT_accessibility(DW_ACCESS_public)
   12326              DW$1106 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12327                      .dwattr DW$1106, DW_AT_name("x"), DW_AT_symbol_name("_x")
   12328                      .dwattr DW$1106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12329                      .dwattr DW$1106, DW_AT_accessibility(DW_ACCESS_public)
   12330              DW$1107 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12331                      .dwattr DW$1107, DW_AT_name("y"), DW_AT_symbol_name("_y")
   12332                      .dwattr DW$1107, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12333                      .dwattr DW$1107, DW_AT_accessibility(DW_ACCESS_public)
   12334              DW$1108 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12335                      .dwattr DW$1108, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
   12336                      .dwattr DW$1108, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12337                      .dwattr DW$1108, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:34 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9882                            PAGE  238

   12338              DW$1109 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   12339                      .dwattr DW$1109, DW_AT_name("high"), DW_AT_symbol_name("_high")
   12340                      .dwattr DW$1109, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12341                      .dwattr DW$1109, DW_AT_accessibility(DW_ACCESS_public)
   12342              DW$1110 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12343                      .dwattr DW$1110, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
   12344                      .dwattr DW$1110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12345                      .dwattr DW$1110, DW_AT_accessibility(DW_ACCESS_public)
   12346              DW$1111 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
   12347                      .dwattr DW$1111, DW_AT_name("parg"), DW_AT_symbol_name("_parg")
   12348                      .dwattr DW$1111, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12349                      .dwattr DW$1111, DW_AT_accessibility(DW_ACCESS_public)
   12350              DW$1112 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12351                      .dwattr DW$1112, DW_AT_name("arg_size"), DW_AT_symbol_name("_arg_size")
   12352                      .dwattr DW$1112, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12353                      .dwattr DW$1112, DW_AT_accessibility(DW_ACCESS_public)
   12354              DW$1113 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
   12355                      .dwattr DW$1113, DW_AT_name("callblack"), DW_AT_symbol_name("_callblack")
   12356                      .dwattr DW$1113, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12357                      .dwattr DW$1113, DW_AT_accessibility(DW_ACCESS_public)
   12358                      .dwendtag DW$T$57
   12359              
   12360              
   12361              DW$T$58 .dwtag  DW_TAG_structure_type
   12362                      .dwattr DW$T$58, DW_AT_byte_size(0x03)
   12363              DW$1114 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12364                      .dwattr DW$1114, DW_AT_name("x"), DW_AT_symbol_name("_x")
   12365                      .dwattr DW$1114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12366                      .dwattr DW$1114, DW_AT_accessibility(DW_ACCESS_public)
   12367              DW$1115 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12368                      .dwattr DW$1115, DW_AT_name("y"), DW_AT_symbol_name("_y")
   12369                      .dwattr DW$1115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12370                      .dwattr DW$1115, DW_AT_accessibility(DW_ACCESS_public)
   12371              DW$1116 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12372                      .dwattr DW$1116, DW_AT_name("state"), DW_AT_symbol_name("_state")
   12373                      .dwattr DW$1116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12374                      .dwattr DW$1116, DW_AT_accessibility(DW_ACCESS_public)
   12375                      .dwendtag DW$T$58
   12376              
   12377              
   12378              DW$T$59 .dwtag  DW_TAG_structure_type
   12379                      .dwattr DW$T$59, DW_AT_byte_size(0x04)
   12380              DW$1117 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   12381                      .dwattr DW$1117, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
   12382                      .dwattr DW$1117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12383                      .dwattr DW$1117, DW_AT_accessibility(DW_ACCESS_public)
   12384              DW$1118 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   12385                      .dwattr DW$1118, DW_AT_name("member_id"), DW_AT_symbol_name("_member_id")
   12386                      .dwattr DW$1118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12387                      .dwattr DW$1118, DW_AT_accessibility(DW_ACCESS_public)
   12388              DW$1119 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
   12389                      .dwattr DW$1119, DW_AT_name("pmember"), DW_AT_symbol_name("_pmember")
   12390                      .dwattr DW$1119, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12391                      .dwattr DW$1119, DW_AT_accessibility(DW_ACCESS_public)
   12392                      .dwendtag DW$T$59
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:34 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9882                            PAGE  239

   12393              
   12394              DW$T$56 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$55)
   12395                      .dwattr DW$T$56, DW_AT_address_class(0x16)
   12396              DW$T$23 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
   12397                      .dwattr DW$T$23, DW_AT_address_class(0x16)
   12398              
   12399              DW$T$41 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$39)
   12400                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
   12401                      .dwattr DW$T$41, DW_AT_byte_size(0x08)
   12402              DW$1120 .dwtag  DW_TAG_subrange_type
   12403                      .dwattr DW$1120, DW_AT_upper_bound(0x07)
   12404                      .dwendtag DW$T$41
   12405              
   12406              
   12407              DW$T$50 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
   12408                      .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
   12409                      .dwattr DW$T$50, DW_AT_byte_size(0x16)
   12410              DW$1121 .dwtag  DW_TAG_subrange_type
   12411                      .dwattr DW$1121, DW_AT_upper_bound(0x15)
   12412                      .dwendtag DW$T$50
   12413              
   12414              DW$1122 .dwtag  DW_TAG_far_type
   12415                      .dwattr DW$1122, DW_AT_type(*DW$T$26)
   12416              DW$T$24 .dwtag  DW_TAG_const_type
   12417                      .dwattr DW$T$24, DW_AT_type(*DW$1122)
   12418              DW$T$48 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$47)
   12419                      .dwattr DW$T$48, DW_AT_address_class(0x16)
   12420              DW$1123 .dwtag  DW_TAG_far_type
   12421                      .dwattr DW$1123, DW_AT_type(*DW$T$6)
   12422              DW$T$22 .dwtag  DW_TAG_const_type
   12423                      .dwattr DW$T$22, DW_AT_type(*DW$1123)
   12424              DW$T$47 .dwtag  DW_TAG_typedef, DW_AT_name("tmr_member_t"), DW_AT_type(*DW$T$46)
   12425                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
   12426              
   12427              DW$T$46 .dwtag  DW_TAG_structure_type
   12428                      .dwattr DW$T$46, DW_AT_byte_size(0x0a)
   12429              DW$1124 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
   12430                      .dwattr DW$1124, DW_AT_name("function"), DW_AT_symbol_name("_function")
   12431                      .dwattr DW$1124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12432                      .dwattr DW$1124, DW_AT_accessibility(DW_ACCESS_public)
   12433              DW$1125 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   12434                      .dwattr DW$1125, DW_AT_name("expires"), DW_AT_symbol_name("_expires")
   12435                      .dwattr DW$1125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12436                      .dwattr DW$1125, DW_AT_accessibility(DW_ACCESS_public)
   12437              DW$1126 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12438                      .dwattr DW$1126, DW_AT_name("tmr_state"), DW_AT_symbol_name("_tmr_state")
   12439                      .dwattr DW$1126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12440                      .dwattr DW$1126, DW_AT_accessibility(DW_ACCESS_public)
   12441              DW$1127 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   12442                      .dwattr DW$1127, DW_AT_name("type"), DW_AT_symbol_name("_type")
   12443                      .dwattr DW$1127, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12444                      .dwattr DW$1127, DW_AT_accessibility(DW_ACCESS_public)
   12445              DW$1128 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
   12446                      .dwattr DW$1128, DW_AT_name("auto_load_expires"), DW_AT_symbol_name("_auto_load_expires")
   12447                      .dwattr DW$1128, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:34 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9882                            PAGE  240

   12448                      .dwattr DW$1128, DW_AT_accessibility(DW_ACCESS_public)
   12449              DW$1129 .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
   12450                      .dwattr DW$1129, DW_AT_name("p_arg"), DW_AT_symbol_name("_p_arg")
   12451                      .dwattr DW$1129, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12452                      .dwattr DW$1129, DW_AT_accessibility(DW_ACCESS_public)
   12453                      .dwendtag DW$T$46
   12454              
   12455              DW$T$45 .dwtag  DW_TAG_typedef, DW_AT_name("tmr_callblack"), DW_AT_type(*DW$T$44)
   12456                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
   12457              
   12458                      .dwattr DW$275, DW_AT_external(0x01)
   12459                      .dwattr DW$269, DW_AT_external(0x01)
   12460                      .dwattr DW$712, DW_AT_external(0x01)
   12461                      .dwattr DW$712, DW_AT_type(*DW$T$10)
   12462                      .dwattr DW$702, DW_AT_external(0x01)
   12463                      .dwattr DW$711, DW_AT_external(0x01)
   12464                      .dwattr DW$328, DW_AT_external(0x01)
   12465                      .dwattr DW$338, DW_AT_external(0x01)
   12466                      .dwattr DW$331, DW_AT_external(0x01)
   12467                      .dwattr DW$373, DW_AT_external(0x01)
   12468                      .dwattr DW$406, DW_AT_external(0x01)
   12469                      .dwattr DW$276, DW_AT_type(*DW$T$223)
   12470                      .dwattr DW$420, DW_AT_external(0x01)
   12471                      .dwattr DW$420, DW_AT_type(*DW$T$37)
   12472                      .dwattr DW$425, DW_AT_external(0x01)
   12473                      .dwattr DW$367, DW_AT_external(0x01)
   12474                      .dwattr DW$356, DW_AT_external(0x01)
   12475                      .dwattr DW$345, DW_AT_external(0x01)
   12476                      .dwattr DW$412, DW_AT_external(0x01)
   12477                      .dwattr DW$412, DW_AT_type(*DW$T$37)
   12478                      .dwattr DW$426, DW_AT_external(0x01)
   12479                      .dwattr DW$426, DW_AT_type(*DW$T$54)
   12480                      .dwattr DW$442, DW_AT_external(0x01)
   12481                      .dwattr DW$439, DW_AT_external(0x01)
   12482                      .dwattr DW$439, DW_AT_type(*DW$T$37)
   12483                      .dwattr DW$458, DW_AT_external(0x01)
   12484                      .dwattr DW$458, DW_AT_type(*DW$T$54)
   12485                      .dwattr DW$496, DW_AT_external(0x01)
   12486                      .dwattr DW$450, DW_AT_external(0x01)
   12487                      .dwattr DW$450, DW_AT_type(*DW$T$54)
   12488                      .dwattr DW$564, DW_AT_external(0x01)
   12489                      .dwattr DW$560, DW_AT_external(0x01)
   12490                      .dwattr DW$560, DW_AT_type(*DW$T$27)
   12491                      .dwattr DW$622, DW_AT_external(0x01)
   12492                      .dwattr DW$622, DW_AT_type(*DW$T$27)
   12493                      .dwattr DW$576, DW_AT_external(0x01)
   12494                      .dwattr DW$626, DW_AT_external(0x01)
   12495                      .dwattr DW$583, DW_AT_external(0x01)
   12496                      .dwattr DW$583, DW_AT_type(*DW$T$54)
   12497                      .dwattr DW$669, DW_AT_external(0x01)
   12498                      .dwattr DW$665, DW_AT_external(0x01)
   12499                      .dwattr DW$652, DW_AT_external(0x01)
   12500                      .dwattr DW$624, DW_AT_external(0x01)
   12501                      .dwattr DW$624, DW_AT_type(*DW$T$27)
   12502                      .dwattr DW$692, DW_AT_external(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:34 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9882                            PAGE  241

   12503                      .dwattr DW$646, DW_AT_external(0x01)
   12504                      .dwattr DW$574, DW_AT_external(0x01)
   12505                      .dwattr DW$574, DW_AT_type(*DW$T$35)
   12506                      .dwattr DW$569, DW_AT_external(0x01)
   12507                      .dwattr DW$595, DW_AT_external(0x01)
