TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:19 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6202                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Nov 29 16:03:19 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("Gui_cursor.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    1114                      .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
    1115              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1116                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1117                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1118              
    1119              DW$T$53 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
    1120                      .dwattr DW$T$53, DW_AT_language(DW_LANG_C)
    1121              DW$102  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$52)
    1122                      .dwendtag DW$T$53
    1123              
    1124              
    1125              DW$T$56 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$55)
    1126                      .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
    1127              DW$103  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$48)
    1128                      .dwendtag DW$T$56
    1129              
    1130              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    1131                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1132                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
    1133              DW$T$26 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
    1134                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    1135              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    1136                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1137                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    1138              DW$T$40 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$39)
    1139                      .dwattr DW$T$40, DW_AT_address_class(0x16)
    1140              DW$T$52 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$40)
    1141                      .dwattr DW$T$52, DW_AT_address_class(0x16)
    1142              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    1143                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    1144              
    1145              DW$T$58 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$30)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:19 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6202                            PAGE   23

    1146                      .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
    1147              DW$104  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
    1148              DW$105  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
    1149              DW$106  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    1150              DW$107  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1151                      .dwendtag DW$T$58
    1152              
    1153              DW$T$28 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1154                      .dwattr DW$T$28, DW_AT_encoding(DW_ATE_signed_char)
    1155                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
    1156              DW$T$48 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$47)
    1157                      .dwattr DW$T$48, DW_AT_address_class(0x16)
    1158              
    1159              DW$T$60 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$48)
    1160                      .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
    1161              
    1162              DW$T$62 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$48)
    1163                      .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
    1164              DW$108  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1165              DW$109  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1166              DW$110  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1167              DW$111  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1168                      .dwendtag DW$T$62
    1169              
    1170              
    1171              DW$T$63 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$47)
    1172                      .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    1173                      .dwattr DW$T$63, DW_AT_byte_size(0x32)
    1174              DW$112  .dwtag  DW_TAG_subrange_type
    1175                      .dwattr DW$112, DW_AT_upper_bound(0x04)
    1176                      .dwendtag DW$T$63
    1177              
    1178              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    1179                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    1180              DW$T$55 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$6)
    1181                      .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
    1182              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1183                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1184                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1185              DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("a_lock_t"), DW_AT_type(*DW$T$38)
    1186                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    1187              DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("tmr_member_t"), DW_AT_type(*DW$T$27)
    1188                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    1189              DW$T$47 .dwtag  DW_TAG_typedef, DW_AT_name("lcd_csr_arg_t"), DW_AT_type(*DW$T$31)
    1190                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
    1191              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    1192                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    1193              
    1194              DW$T$27 .dwtag  DW_TAG_structure_type
    1195                      .dwattr DW$T$27, DW_AT_byte_size(0x0a)
    1196              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1197                      .dwattr DW$113, DW_AT_name("function"), DW_AT_symbol_name("_function")
    1198                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1200              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:19 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6202                            PAGE   24

    1201                      .dwattr DW$114, DW_AT_name("expires"), DW_AT_symbol_name("_expires")
    1202                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1203                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1204              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1205                      .dwattr DW$115, DW_AT_name("tmr_state"), DW_AT_symbol_name("_tmr_state")
    1206                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1207                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1208              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1209                      .dwattr DW$116, DW_AT_name("type"), DW_AT_symbol_name("_type")
    1210                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1211                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1212              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    1213                      .dwattr DW$117, DW_AT_name("auto_load_expires"), DW_AT_symbol_name("_auto_load_expires")
    1214                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1215                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1216              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1217                      .dwattr DW$118, DW_AT_name("p_arg"), DW_AT_symbol_name("_p_arg")
    1218                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1219                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1220                      .dwendtag DW$T$27
    1221              
    1222              
    1223              DW$T$31 .dwtag  DW_TAG_structure_type
    1224                      .dwattr DW$T$31, DW_AT_byte_size(0x0a)
    1225              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1226                      .dwattr DW$119, DW_AT_name("x"), DW_AT_symbol_name("_x")
    1227                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1229              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1230                      .dwattr DW$120, DW_AT_name("y"), DW_AT_symbol_name("_y")
    1231                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1232                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1233              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1234                      .dwattr DW$121, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
    1235                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1236                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1237              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1238                      .dwattr DW$122, DW_AT_name("high"), DW_AT_symbol_name("_high")
    1239                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1240                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1241              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1242                      .dwattr DW$123, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    1243                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1244                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1245              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1246                      .dwattr DW$124, DW_AT_name("flicker_flag"), DW_AT_symbol_name("_flicker_flag")
    1247                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1248                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1249              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1250                      .dwattr DW$125, DW_AT_name("csr_shadow"), DW_AT_symbol_name("_csr_shadow")
    1251                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1252                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1253              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1254                      .dwattr DW$126, DW_AT_name("csr_tmr_id"), DW_AT_symbol_name("_csr_tmr_id")
    1255                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:19 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6202                            PAGE   25

    1256                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1257                      .dwendtag DW$T$31
    1258              
    1259              
    1260              DW$T$22 .dwtag  DW_TAG_structure_type
    1261                      .dwattr DW$T$22, DW_AT_name("os_event")
    1262                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    1263              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1264                      .dwattr DW$127, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    1265                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1266                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1267              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1268                      .dwattr DW$128, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    1269                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1270                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1271              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1272                      .dwattr DW$129, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    1273                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1274                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1275              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1276                      .dwattr DW$130, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    1277                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1278                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1279              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1280                      .dwattr DW$131, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    1281                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1282                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1283                      .dwendtag DW$T$22
    1284              
    1285              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
    1286                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    1287              
    1288              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    1289                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    1290                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    1291              DW$132  .dwtag  DW_TAG_subrange_type
    1292                      .dwattr DW$132, DW_AT_upper_bound(0x07)
    1293                      .dwendtag DW$T$21
    1294              
    1295              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
    1296                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    1297              
    1298                      .dwattr DW$73, DW_AT_external(0x01)
    1299                      .dwattr DW$54, DW_AT_external(0x01)
    1300                      .dwattr DW$47, DW_AT_external(0x01)
    1301                      .dwattr DW$60, DW_AT_external(0x01)
    1302                      .dwattr DW$60, DW_AT_type(*DW$T$48)
    1303                      .dwattr DW$57, DW_AT_external(0x01)
    1304                      .dwattr DW$57, DW_AT_type(*DW$T$55)
    1305                      .dwattr DW$70, DW_AT_external(0x01)
    1306                      .dwattr DW$38, DW_AT_external(0x01)
    1307                      .dwattr DW$38, DW_AT_type(*DW$T$48)
    1308                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1309              
    1310              ;***************************************************************
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:19 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6202                            PAGE   26

    1311              ;* DWARF CIE ENTRIES                                           *
    1312              ;***************************************************************
    1313              
    1314              DW$CIE  .dwcie 1, 40
    1315                      .dwcfa  0x0c, 20, 0
    1316                      .dwcfa  0x07, 0
    1317                      .dwcfa  0x07, 1
    1318                      .dwcfa  0x07, 2
    1319                      .dwcfa  0x07, 3
    1320                      .dwcfa  0x07, 4
    1321                      .dwcfa  0x07, 5
    1322                      .dwcfa  0x08, 6
    1323                      .dwcfa  0x08, 7
    1324                      .dwcfa  0x08, 8
    1325                      .dwcfa  0x08, 9
    1326                      .dwcfa  0x08, 10
    1327                      .dwcfa  0x08, 11
    1328                      .dwcfa  0x07, 12
    1329                      .dwcfa  0x07, 13
    1330                      .dwcfa  0x07, 14
    1331                      .dwcfa  0x07, 15
    1332                      .dwcfa  0x07, 16
    1333                      .dwcfa  0x07, 17
    1334                      .dwcfa  0x07, 18
    1335                      .dwcfa  0x07, 19
    1336                      .dwcfa  0x07, 20
    1337                      .dwcfa  0x07, 21
    1338                      .dwcfa  0x07, 22
    1339                      .dwcfa  0x07, 23
    1340                      .dwcfa  0x07, 24
    1341                      .dwcfa  0x07, 25
    1342                      .dwcfa  0x07, 26
    1343                      .dwcfa  0x08, 27
    1344                      .dwcfa  0x07, 28
    1345                      .dwcfa  0x07, 29
    1346                      .dwcfa  0x07, 30
    1347                      .dwcfa  0x07, 31
    1348                      .dwcfa  0x07, 32
    1349                      .dwcfa  0x07, 33
    1350                      .dwcfa  0x07, 34
