TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:24 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Nov 29 16:03:24 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("Gui_lcd_connect.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   50

    2579              DW$350  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2580              DW$351  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$50)
    2581                      .dwendtag DW$T$80
    2582              
    2583              
    2584              DW$T$82 .dwtag  DW_TAG_subroutine_type
    2585                      .dwattr DW$T$82, DW_AT_language(DW_LANG_C)
    2586              DW$352  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    2587              DW$353  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    2588              DW$354  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2589              DW$355  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2590              DW$356  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$50)
    2591                      .dwendtag DW$T$82
    2592              
    2593              
    2594              DW$T$83 .dwtag  DW_TAG_subroutine_type
    2595                      .dwattr DW$T$83, DW_AT_language(DW_LANG_C)
    2596              DW$357  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2597              DW$358  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2598              DW$359  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2599              DW$360  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2600              DW$361  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2601              DW$362  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2602              DW$363  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    2603                      .dwendtag DW$T$83
    2604              
    2605              
    2606              DW$T$85 .dwtag  DW_TAG_subroutine_type
    2607                      .dwattr DW$T$85, DW_AT_language(DW_LANG_C)
    2608              DW$364  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2609              DW$365  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2610              DW$366  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2611              DW$367  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2612              DW$368  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$50)
    2613                      .dwendtag DW$T$85
    2614              
    2615              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    2616                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2617                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    2618              DW$T$65 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
    2619                      .dwattr DW$T$65, DW_AT_address_class(0x16)
    2620              
    2621              DW$T$87 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
    2622                      .dwattr DW$T$87, DW_AT_language(DW_LANG_C)
    2623              DW$369  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$86)
    2624                      .dwendtag DW$T$87
    2625              
    2626              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    2627                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2628                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
    2629              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    2630                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2631                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    2632              DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
    2633                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:24 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   51

    2634              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    2635                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2636                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    2637              DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$46)
    2638                      .dwattr DW$T$47, DW_AT_address_class(0x16)
    2639              DW$T$86 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$47)
    2640                      .dwattr DW$T$86, DW_AT_address_class(0x16)
    2641              DW$T$23 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    2642                      .dwattr DW$T$23, DW_AT_encoding(DW_ATE_signed_char)
    2643                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    2644              DW$T$50 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    2645                      .dwattr DW$T$50, DW_AT_address_class(0x16)
    2646              DW$T$90 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$89)
    2647                      .dwattr DW$T$90, DW_AT_address_class(0x16)
    2648              DW$T$46 .dwtag  DW_TAG_typedef, DW_AT_name("a_lock_t"), DW_AT_type(*DW$T$45)
    2649                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
    2650              DW$T$89 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$42)
    2651                      .dwattr DW$T$89, DW_AT_language(DW_LANG_C)
    2652              DW$T$45 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    2653                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    2654              
    2655              DW$T$42 .dwtag  DW_TAG_structure_type
    2656                      .dwattr DW$T$42, DW_AT_name("hwin")
    2657                      .dwattr DW$T$42, DW_AT_byte_size(0x22)
    2658              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2659                      .dwattr DW$370, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    2660                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2661                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2662              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2663                      .dwattr DW$371, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    2664                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2665                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2666              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2667                      .dwattr DW$372, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    2668                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2669                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2670              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2671                      .dwattr DW$373, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    2672                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2673                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2674              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2675                      .dwattr DW$374, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    2676                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2677                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2678              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2679                      .dwattr DW$375, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    2680                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2681                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2682              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2683                      .dwattr DW$376, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    2684                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2685                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2686              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2687                      .dwattr DW$377, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    2688                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:24 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   52

    2689                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2690              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2691                      .dwattr DW$378, DW_AT_name("type"), DW_AT_symbol_name("_type")
    2692                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2693                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2694              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    2695                      .dwattr DW$379, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    2696                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2697                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2698              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    2699                      .dwattr DW$380, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    2700                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2701                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2702              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    2703                      .dwattr DW$381, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
    2704                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2705                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2706              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    2707                      .dwattr DW$382, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    2708                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2709                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2710              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    2711                      .dwattr DW$383, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    2712                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2713                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2714              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    2715                      .dwattr DW$384, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    2716                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2717                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2718              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2719                      .dwattr DW$385, DW_AT_name("drop_list_is_start"), DW_AT_symbol_name("_drop_list_is_start")
    2720                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2721                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2722              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    2723                      .dwattr DW$386, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    2724                      .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2725                      .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2726              DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2727                      .dwattr DW$387, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
    2728                      .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2729                      .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2730              DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2731                      .dwattr DW$388, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    2732                      .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2733                      .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2734              DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    2735                      .dwattr DW$389, DW_AT_name("checkbox_radio_state"), DW_AT_symbol_name("_checkbox_radio_state")
    2736                      .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2737                      .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2738              DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2739                      .dwattr DW$390, DW_AT_name("title_len"), DW_AT_symbol_name("_title_len")
    2740                      .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2741                      .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2742              DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2743                      .dwattr DW$391, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:24 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   53

    2744                      .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2745                      .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2746              DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2747                      .dwattr DW$392, DW_AT_name("pwidget"), DW_AT_symbol_name("_pwidget")
    2748                      .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2749                      .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2750                      .dwendtag DW$T$42
    2751              
    2752              DW$T$37 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
    2753                      .dwattr DW$T$37, DW_AT_address_class(0x16)
    2754              DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$6)
    2755                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    2756              
    2757              DW$T$22 .dwtag  DW_TAG_structure_type
    2758                      .dwattr DW$T$22, DW_AT_name("os_event")
    2759                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    2760              DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2761                      .dwattr DW$393, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    2762                      .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2763                      .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2764              DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2765                      .dwattr DW$394, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    2766                      .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2767                      .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2768              DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    2769                      .dwattr DW$395, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    2770                      .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2771                      .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    2772              DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2773                      .dwattr DW$396, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    2774                      .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2775                      .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    2776              DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2777                      .dwattr DW$397, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    2778                      .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2779                      .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    2780                      .dwendtag DW$T$22
    2781              
    2782              DW$T$40 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    2783                      .dwattr DW$T$40, DW_AT_address_class(0x16)
    2784              DW$T$39 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
    2785                      .dwattr DW$T$39, DW_AT_address_class(0x16)
    2786              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
    2787                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    2788              
    2789              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    2790                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    2791                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    2792              DW$398  .dwtag  DW_TAG_subrange_type
    2793                      .dwattr DW$398, DW_AT_upper_bound(0x07)
    2794                      .dwendtag DW$T$21
    2795              
    2796              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
    2797                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    2798              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:24 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   54

    2799                      .dwattr DW$T$25, DW_AT_address_class(0x16)
    2800              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$36)
    2801                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    2802              DW$399  .dwtag  DW_TAG_far_type
    2803                      .dwattr DW$399, DW_AT_type(*DW$T$23)
    2804              DW$T$24 .dwtag  DW_TAG_const_type
    2805                      .dwattr DW$T$24, DW_AT_type(*DW$399)
    2806              
    2807              DW$T$36 .dwtag  DW_TAG_structure_type
    2808                      .dwattr DW$T$36, DW_AT_name("edit_mem")
    2809                      .dwattr DW$T$36, DW_AT_byte_size(0x0c)
    2810              DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2811                      .dwattr DW$400, DW_AT_name("x"), DW_AT_symbol_name("_x")
    2812                      .dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2813                      .dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
    2814              DW$401  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2815                      .dwattr DW$401, DW_AT_name("y"), DW_AT_symbol_name("_y")
    2816                      .dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2817                      .dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
    2818              DW$402  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2819                      .dwattr DW$402, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
    2820                      .dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2821                      .dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
    2822              DW$403  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2823                      .dwattr DW$403, DW_AT_name("CHhigh"), DW_AT_symbol_name("_CHhigh")
    2824                      .dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2825                      .dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
    2826              DW$404  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2827                      .dwattr DW$404, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    2828                      .dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2829                      .dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
    2830              DW$405  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2831                      .dwattr DW$405, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    2832                      .dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2833                      .dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
    2834              DW$406  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2835                      .dwattr DW$406, DW_AT_name("id"), DW_AT_symbol_name("_id")
    2836                      .dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2837                      .dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
    2838              DW$407  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2839                      .dwattr DW$407, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    2840                      .dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2841                      .dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
    2842              DW$408  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    2843                      .dwattr DW$408, DW_AT_name("pfront"), DW_AT_symbol_name("_pfront")
    2844                      .dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2845                      .dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
    2846              DW$409  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    2847                      .dwattr DW$409, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    2848                      .dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2849                      .dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
    2850                      .dwendtag DW$T$36
    2851              
    2852              DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
    2853                      .dwattr DW$T$35, DW_AT_address_class(0x16)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:24 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   55

    2854              DW$T$34 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
    2855                      .dwattr DW$T$34, DW_AT_address_class(0x16)
    2856              DW$410  .dwtag  DW_TAG_far_type
    2857                      .dwattr DW$410, DW_AT_type(*DW$T$32)
    2858              DW$T$33 .dwtag  DW_TAG_const_type
    2859                      .dwattr DW$T$33, DW_AT_type(*DW$410)
    2860              DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT"), DW_AT_type(*DW$T$30)
    2861                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    2862              
    2863              DW$T$30 .dwtag  DW_TAG_structure_type
    2864                      .dwattr DW$T$30, DW_AT_name("GUI_FONT")
    2865                      .dwattr DW$T$30, DW_AT_byte_size(0x0c)
    2866              DW$411  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2867                      .dwattr DW$411, DW_AT_name("start_asc"), DW_AT_symbol_name("_start_asc")
    2868                      .dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2869                      .dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
    2870              DW$412  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2871                      .dwattr DW$412, DW_AT_name("end_asc"), DW_AT_symbol_name("_end_asc")
    2872                      .dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2873                      .dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
    2874              DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2875                      .dwattr DW$413, DW_AT_name("nbyte"), DW_AT_symbol_name("_nbyte")
    2876                      .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2877                      .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    2878              DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2879                      .dwattr DW$414, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
    2880                      .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2881                      .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
    2882              DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2883                      .dwattr DW$415, DW_AT_name("high"), DW_AT_symbol_name("_high")
    2884                      .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2885                      .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    2886              DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2887                      .dwattr DW$416, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
    2888                      .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2889                      .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    2890              DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2891                      .dwattr DW$417, DW_AT_name("pcode"), DW_AT_symbol_name("_pcode")
    2892                      .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2893                      .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    2894              DW$418  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    2895                      .dwattr DW$418, DW_AT_name("pNext"), DW_AT_symbol_name("_pNext")
    2896                      .dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2897                      .dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
    2898                      .dwendtag DW$T$30
    2899              
    2900              DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
    2901                      .dwattr DW$T$29, DW_AT_address_class(0x16)
    2902              DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
    2903                      .dwattr DW$T$27, DW_AT_address_class(0x16)
    2904              DW$419  .dwtag  DW_TAG_far_type
    2905                      .dwattr DW$419, DW_AT_type(*DW$T$30)
    2906              DW$T$28 .dwtag  DW_TAG_const_type
    2907                      .dwattr DW$T$28, DW_AT_type(*DW$419)
    2908              DW$420  .dwtag  DW_TAG_far_type
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:24 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   56

    2909                      .dwattr DW$420, DW_AT_type(*DW$T$6)
    2910              DW$T$26 .dwtag  DW_TAG_const_type
    2911                      .dwattr DW$T$26, DW_AT_type(*DW$420)
    2912              
    2913                      .dwattr DW$214, DW_AT_external(0x01)
    2914                      .dwattr DW$215, DW_AT_external(0x01)
    2915                      .dwattr DW$100, DW_AT_external(0x01)
    2916                      .dwattr DW$86, DW_AT_external(0x01)
    2917                      .dwattr DW$91, DW_AT_external(0x01)
    2918                      .dwattr DW$178, DW_AT_external(0x01)
    2919                      .dwattr DW$109, DW_AT_external(0x01)
    2920                      .dwattr DW$118, DW_AT_external(0x01)
    2921                      .dwattr DW$195, DW_AT_external(0x01)
    2922                      .dwattr DW$269, DW_AT_external(0x01)
    2923                      .dwattr DW$268, DW_AT_external(0x01)
    2924                      .dwattr DW$227, DW_AT_external(0x01)
    2925                      .dwattr DW$236, DW_AT_external(0x01)
    2926                      .dwattr DW$258, DW_AT_external(0x01)
    2927                      .dwattr DW$246, DW_AT_external(0x01)
    2928                      .dwattr DW$127, DW_AT_external(0x01)
    2929                      .dwattr DW$148, DW_AT_external(0x01)
    2930                      .dwattr DW$83, DW_AT_external(0x01)
    2931                      .dwattr DW$80, DW_AT_external(0x01)
    2932                      .dwattr DW$137, DW_AT_external(0x01)
    2933                      .dwattr DW$158, DW_AT_external(0x01)
    2934                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    2935              
    2936              ;***************************************************************
    2937              ;* DWARF CIE ENTRIES                                           *
    2938              ;***************************************************************
    2939              
    2940              DW$CIE  .dwcie 1, 40
    2941                      .dwcfa  0x0c, 20, 0
    2942                      .dwcfa  0x07, 0
    2943                      .dwcfa  0x07, 1
    2944                      .dwcfa  0x07, 2
    2945                      .dwcfa  0x07, 3
    2946                      .dwcfa  0x07, 4
    2947                      .dwcfa  0x07, 5
    2948                      .dwcfa  0x08, 6
    2949                      .dwcfa  0x08, 7
    2950                      .dwcfa  0x08, 8
    2951                      .dwcfa  0x08, 9
    2952                      .dwcfa  0x08, 10
    2953                      .dwcfa  0x08, 11
    2954                      .dwcfa  0x07, 12
    2955                      .dwcfa  0x07, 13
    2956                      .dwcfa  0x07, 14
    2957                      .dwcfa  0x07, 15
    2958                      .dwcfa  0x07, 16
    2959                      .dwcfa  0x07, 17
    2960                      .dwcfa  0x07, 18
