TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:18 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Nov 29 16:03:17 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("Gui_core.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    5528              DW$T$17 .dwtag  DW_TAG_base_type, DW_AT_name("double")
    5529                      .dwattr DW$T$17, DW_AT_encoding(DW_ATE_float)
    5530                      .dwattr DW$T$17, DW_AT_byte_size(0x02)
    5531              
    5532              DW$T$122        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$17)
    5533                      .dwattr DW$T$122, DW_AT_language(DW_LANG_C)
    5534              DW$475  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$17)
    5535                      .dwendtag DW$T$122
    5536              
    5537              DW$T$63 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$62)
    5538                      .dwattr DW$T$63, DW_AT_address_class(0x16)
    5539              DW$T$102        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
    5540                      .dwattr DW$T$102, DW_AT_address_class(0x16)
    5541              
    5542              DW$T$124        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$24)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:18 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE  108

    5543                      .dwattr DW$T$124, DW_AT_language(DW_LANG_C)
    5544                      .dwattr DW$T$124, DW_AT_byte_size(0x14)
    5545              DW$476  .dwtag  DW_TAG_subrange_type
    5546                      .dwattr DW$476, DW_AT_upper_bound(0x13)
    5547                      .dwendtag DW$T$124
    5548              
    5549              DW$T$56 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    5550                      .dwattr DW$T$56, DW_AT_address_class(0x16)
    5551              
    5552              DW$T$125        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    5553                      .dwattr DW$T$125, DW_AT_language(DW_LANG_C)
    5554                      .dwattr DW$T$125, DW_AT_byte_size(0x14)
    5555              DW$477  .dwtag  DW_TAG_subrange_type
    5556                      .dwattr DW$477, DW_AT_upper_bound(0x13)
    5557                      .dwendtag DW$T$125
    5558              
    5559              DW$T$71 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$70)
    5560                      .dwattr DW$T$71, DW_AT_address_class(0x16)
    5561              
    5562              DW$T$127        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$71)
    5563                      .dwattr DW$T$127, DW_AT_language(DW_LANG_C)
    5564              
    5565              DW$T$129        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$71)
    5566                      .dwattr DW$T$129, DW_AT_language(DW_LANG_C)
    5567              DW$478  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    5568              DW$479  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    5569              DW$480  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
    5570              DW$481  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
    5571              DW$482  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
    5572              DW$483  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$71)
    5573                      .dwendtag DW$T$129
    5574              
    5575              
    5576              DW$T$130        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$71)
    5577                      .dwattr DW$T$130, DW_AT_language(DW_LANG_C)
    5578              DW$484  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    5579              DW$485  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    5580              DW$486  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
    5581              DW$487  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
    5582              DW$488  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
    5583                      .dwendtag DW$T$130
    5584              
    5585              
    5586              DW$T$132        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$71)
    5587                      .dwattr DW$T$132, DW_AT_language(DW_LANG_C)
    5588                      .dwattr DW$T$132, DW_AT_byte_size(0x0a)
    5589              DW$489  .dwtag  DW_TAG_subrange_type
    5590                      .dwattr DW$489, DW_AT_upper_bound(0x04)
    5591                      .dwendtag DW$T$132
    5592              
    5593              DW$T$62 .dwtag  DW_TAG_typedef, DW_AT_name("a_lock_t"), DW_AT_type(*DW$T$61)
    5594                      .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
    5595              DW$T$23 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    5596                      .dwattr DW$T$23, DW_AT_encoding(DW_ATE_signed_char)
    5597                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:18 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE  109

    5598              DW$490  .dwtag  DW_TAG_far_type
    5599                      .dwattr DW$490, DW_AT_type(*DW$T$23)
    5600              DW$T$24 .dwtag  DW_TAG_const_type
    5601                      .dwattr DW$T$24, DW_AT_type(*DW$490)
    5602              DW$T$70 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$42)
    5603                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    5604              DW$T$61 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    5605                      .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
    5606              
    5607              DW$T$42 .dwtag  DW_TAG_structure_type
    5608                      .dwattr DW$T$42, DW_AT_name("hwin")
    5609                      .dwattr DW$T$42, DW_AT_byte_size(0x22)
    5610              DW$491  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5611                      .dwattr DW$491, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    5612                      .dwattr DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5613                      .dwattr DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5614              DW$492  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5615                      .dwattr DW$492, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    5616                      .dwattr DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5617                      .dwattr DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5618              DW$493  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5619                      .dwattr DW$493, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    5620                      .dwattr DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5621                      .dwattr DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5622              DW$494  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5623                      .dwattr DW$494, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    5624                      .dwattr DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5625                      .dwattr DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5626              DW$495  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5627                      .dwattr DW$495, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    5628                      .dwattr DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5629                      .dwattr DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5630              DW$496  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5631                      .dwattr DW$496, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    5632                      .dwattr DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5633                      .dwattr DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5634              DW$497  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5635                      .dwattr DW$497, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    5636                      .dwattr DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5637                      .dwattr DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5638              DW$498  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5639                      .dwattr DW$498, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    5640                      .dwattr DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5641                      .dwattr DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5642              DW$499  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5643                      .dwattr DW$499, DW_AT_name("type"), DW_AT_symbol_name("_type")
    5644                      .dwattr DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5645                      .dwattr DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5646              DW$500  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    5647                      .dwattr DW$500, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    5648                      .dwattr DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5649                      .dwattr DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5650              DW$501  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    5651                      .dwattr DW$501, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    5652                      .dwattr DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:18 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE  110

    5653                      .dwattr DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5654              DW$502  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    5655                      .dwattr DW$502, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
    5656                      .dwattr DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5657                      .dwattr DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5658              DW$503  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    5659                      .dwattr DW$503, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    5660                      .dwattr DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5661                      .dwattr DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5662              DW$504  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    5663                      .dwattr DW$504, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    5664                      .dwattr DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5665                      .dwattr DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5666              DW$505  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    5667                      .dwattr DW$505, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    5668                      .dwattr DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5669                      .dwattr DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5670              DW$506  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5671                      .dwattr DW$506, DW_AT_name("drop_list_is_start"), DW_AT_symbol_name("_drop_list_is_start")
    5672                      .dwattr DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5673                      .dwattr DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5674              DW$507  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    5675                      .dwattr DW$507, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    5676                      .dwattr DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5677                      .dwattr DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5678              DW$508  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5679                      .dwattr DW$508, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
    5680                      .dwattr DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5681                      .dwattr DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5682              DW$509  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5683                      .dwattr DW$509, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    5684                      .dwattr DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    5685                      .dwattr DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5686              DW$510  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    5687                      .dwattr DW$510, DW_AT_name("checkbox_radio_state"), DW_AT_symbol_name("_checkbox_radio_state")
    5688                      .dwattr DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5689                      .dwattr DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5690              DW$511  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5691                      .dwattr DW$511, DW_AT_name("title_len"), DW_AT_symbol_name("_title_len")
    5692                      .dwattr DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5693                      .dwattr DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5694              DW$512  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5695                      .dwattr DW$512, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
    5696                      .dwattr DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5697                      .dwattr DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5698              DW$513  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    5699                      .dwattr DW$513, DW_AT_name("pwidget"), DW_AT_symbol_name("_pwidget")
    5700                      .dwattr DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5701                      .dwattr DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5702                      .dwendtag DW$T$42
    5703              
    5704              DW$T$37 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
    5705                      .dwattr DW$T$37, DW_AT_address_class(0x16)
    5706              DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$6)
    5707                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:18 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE  111

    5708              
    5709              DW$T$22 .dwtag  DW_TAG_structure_type
    5710                      .dwattr DW$T$22, DW_AT_name("os_event")
    5711                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    5712              DW$514  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5713                      .dwattr DW$514, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    5714                      .dwattr DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5715                      .dwattr DW$514, DW_AT_accessibility(DW_ACCESS_public)
    5716              DW$515  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    5717                      .dwattr DW$515, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    5718                      .dwattr DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5719                      .dwattr DW$515, DW_AT_accessibility(DW_ACCESS_public)
    5720              DW$516  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    5721                      .dwattr DW$516, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    5722                      .dwattr DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5723                      .dwattr DW$516, DW_AT_accessibility(DW_ACCESS_public)
    5724              DW$517  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5725                      .dwattr DW$517, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    5726                      .dwattr DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5727                      .dwattr DW$517, DW_AT_accessibility(DW_ACCESS_public)
    5728              DW$518  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    5729                      .dwattr DW$518, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    5730                      .dwattr DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5731                      .dwattr DW$518, DW_AT_accessibility(DW_ACCESS_public)
    5732                      .dwendtag DW$T$22
    5733              
    5734              DW$T$40 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    5735                      .dwattr DW$T$40, DW_AT_address_class(0x16)
    5736              DW$T$39 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
    5737                      .dwattr DW$T$39, DW_AT_address_class(0x16)
    5738              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
    5739                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    5740              
    5741              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    5742                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    5743                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    5744              DW$519  .dwtag  DW_TAG_subrange_type
    5745                      .dwattr DW$519, DW_AT_upper_bound(0x07)
    5746                      .dwendtag DW$T$21
    5747              
    5748              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    5749                      .dwattr DW$T$25, DW_AT_address_class(0x16)
    5750              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$36)
    5751                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    5752              
    5753              DW$T$36 .dwtag  DW_TAG_structure_type
    5754                      .dwattr DW$T$36, DW_AT_name("edit_mem")
    5755                      .dwattr DW$T$36, DW_AT_byte_size(0x0c)
    5756              DW$520  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5757                      .dwattr DW$520, DW_AT_name("x"), DW_AT_symbol_name("_x")
    5758                      .dwattr DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5759                      .dwattr DW$520, DW_AT_accessibility(DW_ACCESS_public)
    5760              DW$521  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5761                      .dwattr DW$521, DW_AT_name("y"), DW_AT_symbol_name("_y")
    5762                      .dwattr DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:18 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE  112

    5763                      .dwattr DW$521, DW_AT_accessibility(DW_ACCESS_public)
    5764              DW$522  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5765                      .dwattr DW$522, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
    5766                      .dwattr DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5767                      .dwattr DW$522, DW_AT_accessibility(DW_ACCESS_public)
    5768              DW$523  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5769                      .dwattr DW$523, DW_AT_name("CHhigh"), DW_AT_symbol_name("_CHhigh")
    5770                      .dwattr DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5771                      .dwattr DW$523, DW_AT_accessibility(DW_ACCESS_public)
    5772              DW$524  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5773                      .dwattr DW$524, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    5774                      .dwattr DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5775                      .dwattr DW$524, DW_AT_accessibility(DW_ACCESS_public)
    5776              DW$525  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5777                      .dwattr DW$525, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    5778                      .dwattr DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5779                      .dwattr DW$525, DW_AT_accessibility(DW_ACCESS_public)
    5780              DW$526  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5781                      .dwattr DW$526, DW_AT_name("id"), DW_AT_symbol_name("_id")
    5782                      .dwattr DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5783                      .dwattr DW$526, DW_AT_accessibility(DW_ACCESS_public)
    5784              DW$527  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5785                      .dwattr DW$527, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    5786                      .dwattr DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5787                      .dwattr DW$527, DW_AT_accessibility(DW_ACCESS_public)
    5788              DW$528  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    5789                      .dwattr DW$528, DW_AT_name("pfront"), DW_AT_symbol_name("_pfront")
    5790                      .dwattr DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5791                      .dwattr DW$528, DW_AT_accessibility(DW_ACCESS_public)
    5792              DW$529  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    5793                      .dwattr DW$529, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    5794                      .dwattr DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5795                      .dwattr DW$529, DW_AT_accessibility(DW_ACCESS_public)
    5796                      .dwendtag DW$T$36
    5797              
    5798              DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
    5799                      .dwattr DW$T$35, DW_AT_address_class(0x16)
    5800              DW$T$34 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
    5801                      .dwattr DW$T$34, DW_AT_address_class(0x16)
    5802              DW$530  .dwtag  DW_TAG_far_type
    5803                      .dwattr DW$530, DW_AT_type(*DW$T$32)
    5804              DW$T$33 .dwtag  DW_TAG_const_type
    5805                      .dwattr DW$T$33, DW_AT_type(*DW$530)
    5806              DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT"), DW_AT_type(*DW$T$30)
    5807                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    5808              
    5809              DW$T$30 .dwtag  DW_TAG_structure_type
    5810                      .dwattr DW$T$30, DW_AT_name("GUI_FONT")
    5811                      .dwattr DW$T$30, DW_AT_byte_size(0x0c)
    5812              DW$531  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    5813                      .dwattr DW$531, DW_AT_name("start_asc"), DW_AT_symbol_name("_start_asc")
    5814                      .dwattr DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5815                      .dwattr DW$531, DW_AT_accessibility(DW_ACCESS_public)
    5816              DW$532  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    5817                      .dwattr DW$532, DW_AT_name("end_asc"), DW_AT_symbol_name("_end_asc")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:18 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE  113

    5818                      .dwattr DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5819                      .dwattr DW$532, DW_AT_accessibility(DW_ACCESS_public)
    5820              DW$533  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5821                      .dwattr DW$533, DW_AT_name("nbyte"), DW_AT_symbol_name("_nbyte")
    5822                      .dwattr DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5823                      .dwattr DW$533, DW_AT_accessibility(DW_ACCESS_public)
    5824              DW$534  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5825                      .dwattr DW$534, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
    5826                      .dwattr DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5827                      .dwattr DW$534, DW_AT_accessibility(DW_ACCESS_public)
    5828              DW$535  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5829                      .dwattr DW$535, DW_AT_name("high"), DW_AT_symbol_name("_high")
    5830                      .dwattr DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5831                      .dwattr DW$535, DW_AT_accessibility(DW_ACCESS_public)
    5832              DW$536  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5833                      .dwattr DW$536, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
    5834                      .dwattr DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5835                      .dwattr DW$536, DW_AT_accessibility(DW_ACCESS_public)
    5836              DW$537  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    5837                      .dwattr DW$537, DW_AT_name("pcode"), DW_AT_symbol_name("_pcode")
    5838                      .dwattr DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5839                      .dwattr DW$537, DW_AT_accessibility(DW_ACCESS_public)
    5840              DW$538  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    5841                      .dwattr DW$538, DW_AT_name("pNext"), DW_AT_symbol_name("_pNext")
    5842                      .dwattr DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5843                      .dwattr DW$538, DW_AT_accessibility(DW_ACCESS_public)
    5844                      .dwendtag DW$T$30
    5845              
    5846              DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
    5847                      .dwattr DW$T$29, DW_AT_address_class(0x16)
    5848              DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
    5849                      .dwattr DW$T$27, DW_AT_address_class(0x16)
    5850              DW$539  .dwtag  DW_TAG_far_type
    5851                      .dwattr DW$539, DW_AT_type(*DW$T$30)
    5852              DW$T$28 .dwtag  DW_TAG_const_type
    5853                      .dwattr DW$T$28, DW_AT_type(*DW$539)
    5854              DW$540  .dwtag  DW_TAG_far_type
    5855                      .dwattr DW$540, DW_AT_type(*DW$T$6)
    5856              DW$T$26 .dwtag  DW_TAG_const_type
    5857                      .dwattr DW$T$26, DW_AT_type(*DW$540)
    5858              
    5859                      .dwattr DW$351, DW_AT_external(0x01)
    5860                      .dwattr DW$352, DW_AT_external(0x01)
    5861                      .dwattr DW$284, DW_AT_external(0x01)
    5862                      .dwattr DW$290, DW_AT_external(0x01)
    5863                      .dwattr DW$136, DW_AT_type(*DW$T$71)
    5864                      .dwattr DW$135, DW_AT_external(0x01)
    5865                      .dwattr DW$135, DW_AT_type(*DW$T$71)
    5866                      .dwattr DW$298, DW_AT_external(0x01)
    5867                      .dwattr DW$302, DW_AT_external(0x01)
    5868                      .dwattr DW$377, DW_AT_external(0x01)
    5869                      .dwattr DW$376, DW_AT_external(0x01)
    5870                      .dwattr DW$250, DW_AT_external(0x01)
    5871                      .dwattr DW$255, DW_AT_external(0x01)
    5872                      .dwattr DW$273, DW_AT_external(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:18 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE  114

    5873                      .dwattr DW$262, DW_AT_external(0x01)
    5874                      .dwattr DW$371, DW_AT_external(0x01)
    5875                      .dwattr DW$147, DW_AT_external(0x01)
    5876                      .dwattr DW$160, DW_AT_external(0x01)
    5877                      .dwattr DW$325, DW_AT_external(0x01)
    5878                      .dwattr DW$361, DW_AT_external(0x01)
    5879                      .dwattr DW$235, DW_AT_external(0x01)
    5880                      .dwattr DW$179, DW_AT_external(0x01)
    5881                      .dwattr DW$179, DW_AT_type(*DW$T$71)
    5882                      .dwattr DW$191, DW_AT_external(0x01)
    5883                      .dwattr DW$191, DW_AT_type(*DW$T$71)
    5884                      .dwattr DW$202, DW_AT_external(0x01)
    5885                      .dwattr DW$342, DW_AT_external(0x01)
    5886                      .dwattr DW$309, DW_AT_external(0x01)
    5887                      .dwattr DW$227, DW_AT_external(0x01)
    5888                      .dwattr DW$224, DW_AT_external(0x01)
    5889                      .dwattr DW$221, DW_AT_external(0x01)
    5890                      .dwattr DW$218, DW_AT_external(0x01)
    5891                      .dwattr DW$316, DW_AT_external(0x01)
    5892                      .dwattr DW$236, DW_AT_external(0x01)
    5893                      .dwattr DW$239, DW_AT_external(0x01)
    5894                      .dwattr DW$245, DW_AT_external(0x01)
    5895                      .dwattr DW$242, DW_AT_external(0x01)
    5896                      .dwattr DW$141, DW_AT_external(0x01)
    5897                      .dwattr DW$141, DW_AT_type(*DW$T$11)
    5898                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    5899              
