TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 04 16:21:37 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8402                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Aug 04 16:21:36 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_support.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    9276                      .dwattr DW$T$205, DW_AT_language(DW_LANG_C)
    9277              DW$T$81 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    9278                      .dwattr DW$T$81, DW_AT_encoding(DW_ATE_signed_char)
    9279                      .dwattr DW$T$81, DW_AT_byte_size(0x01)
    9280              DW$T$82 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$81)
    9281                      .dwattr DW$T$82, DW_AT_address_class(0x16)
    9282              
    9283              DW$T$174        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$82)
    9284                      .dwattr DW$T$174, DW_AT_language(DW_LANG_C)
    9285              DW$763  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$82)
    9286              DW$764  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$141)
    9287                      .dwendtag DW$T$174
    9288              
    9289              
    9290              DW$T$176        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$82)
    9291                      .dwattr DW$T$176, DW_AT_language(DW_LANG_C)
    9292              DW$765  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$82)
    9293              DW$766  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$82)
    9294                      .dwendtag DW$T$176
    9295              
    9296              
    9297              DW$T$178        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$82)
    9298                      .dwattr DW$T$178, DW_AT_language(DW_LANG_C)
    9299              DW$767  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$82)
    9300              DW$768  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$82)
    9301              DW$769  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$82)
    9302                      .dwendtag DW$T$178
    9303              
    9304              
    9305              DW$T$179        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$82)
    9306                      .dwattr DW$T$179, DW_AT_language(DW_LANG_C)
    9307              DW$770  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$82)
    9308              DW$771  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
    9309                      .dwendtag DW$T$179
    9310              
    9311              DW$T$180        .dwtag  DW_TAG_typedef, DW_AT_name("va_list"), DW_AT_type(*DW$T$82)
    9312                      .dwattr DW$T$180, DW_AT_language(DW_LANG_C)
    9313              DW$T$141        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$140)
    9314                      .dwattr DW$T$141, DW_AT_address_class(0x16)
    9315              
    9316              DW$T$182        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$81)
    9317                      .dwattr DW$T$182, DW_AT_language(DW_LANG_C)
    9318              DW$772  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    9319                      .dwendtag DW$T$182
    9320              
    9321              
    9322              DW$T$183        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$81)
    9323                      .dwattr DW$T$183, DW_AT_language(DW_LANG_C)
    9324                      .dwattr DW$T$183, DW_AT_byte_size(0x08)
    9325              DW$773  .dwtag  DW_TAG_subrange_type
    9326                      .dwattr DW$773, DW_AT_upper_bound(0x07)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 04 16:21:37 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8402                            PAGE  177

    9327                      .dwendtag DW$T$183
    9328              
    9329              
    9330              DW$T$185        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$81)
    9331                      .dwattr DW$T$185, DW_AT_language(DW_LANG_C)
    9332                      .dwattr DW$T$185, DW_AT_byte_size(0x10)
    9333              DW$774  .dwtag  DW_TAG_subrange_type
    9334                      .dwattr DW$774, DW_AT_upper_bound(0x0f)
    9335                      .dwendtag DW$T$185
    9336              
    9337              DW$775  .dwtag  DW_TAG_far_type
    9338              DW$T$51 .dwtag  DW_TAG_const_type
    9339                      .dwattr DW$T$51, DW_AT_type(*DW$775)
    9340              DW$T$64 .dwtag  DW_TAG_typedef, DW_AT_name("a_lock_t"), DW_AT_type(*DW$T$63)
    9341                      .dwattr DW$T$64, DW_AT_language(DW_LANG_C)
    9342              DW$T$69 .dwtag  DW_TAG_typedef, DW_AT_name("filtering_data_t"), DW_AT_type(*DW$T$24)
    9343                      .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
    9344              DW$T$72 .dwtag  DW_TAG_typedef, DW_AT_name("fifo_tcb_t"), DW_AT_type(*DW$T$26)
    9345                      .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
    9346              DW$T$87 .dwtag  DW_TAG_typedef, DW_AT_name("debounce_t"), DW_AT_type(*DW$T$31)
    9347                      .dwattr DW$T$87, DW_AT_language(DW_LANG_C)
    9348              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("link_list_t"), DW_AT_type(*DW$T$33)
    9349                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    9350              DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("link_list_tcb_t"), DW_AT_type(*DW$T$36)
    9351                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
    9352              DW$T$45 .dwtag  DW_TAG_typedef, DW_AT_name("tmr_member_t"), DW_AT_type(*DW$T$40)
    9353                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    9354              DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("mem_ctl_t"), DW_AT_type(*DW$T$41)
    9355                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
    9356              
    9357              DW$T$44 .dwtag  DW_TAG_structure_type
    9358                      .dwattr DW$T$44, DW_AT_byte_size(0x3e)
    9359              DW$776  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9360                      .dwattr DW$776, DW_AT_name("ture_size"), DW_AT_symbol_name("_ture_size")
    9361                      .dwattr DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9362                      .dwattr DW$776, DW_AT_accessibility(DW_ACCESS_public)
    9363              DW$777  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    9364                      .dwattr DW$777, DW_AT_name("link_list_member"), DW_AT_symbol_name("_link_list_member")
    9365                      .dwattr DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9366                      .dwattr DW$777, DW_AT_accessibility(DW_ACCESS_public)
    9367                      .dwendtag DW$T$44
    9368              
    9369              
    9370              DW$T$47 .dwtag  DW_TAG_structure_type
    9371                      .dwattr DW$T$47, DW_AT_byte_size(0x98)
    9372              DW$778  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9373                      .dwattr DW$778, DW_AT_name("ture_size"), DW_AT_symbol_name("_ture_size")
    9374                      .dwattr DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9375                      .dwattr DW$778, DW_AT_accessibility(DW_ACCESS_public)
    9376              DW$779  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    9377                      .dwattr DW$779, DW_AT_name("tmr_array"), DW_AT_symbol_name("_tmr_array")
    9378                      .dwattr DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9379                      .dwattr DW$779, DW_AT_accessibility(DW_ACCESS_public)
    9380                      .dwendtag DW$T$47
    9381              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 04 16:21:37 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8402                            PAGE  178

    9382              
    9383              DW$T$50 .dwtag  DW_TAG_structure_type
    9384                      .dwattr DW$T$50, DW_AT_byte_size(0x0a)
    9385              DW$780  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9386                      .dwattr DW$780, DW_AT_name("real_size"), DW_AT_symbol_name("_real_size")
    9387                      .dwattr DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9388                      .dwattr DW$780, DW_AT_accessibility(DW_ACCESS_public)
    9389              DW$781  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    9390                      .dwattr DW$781, DW_AT_name("mem_member"), DW_AT_symbol_name("_mem_member")
    9391                      .dwattr DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9392                      .dwattr DW$781, DW_AT_accessibility(DW_ACCESS_public)
    9393                      .dwendtag DW$T$50
    9394              
    9395              DW$782  .dwtag  DW_TAG_far_type
    9396                      .dwattr DW$782, DW_AT_type(*DW$T$81)
    9397              DW$T$140        .dwtag  DW_TAG_const_type
    9398                      .dwattr DW$T$140, DW_AT_type(*DW$782)
    9399              DW$T$63 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    9400                      .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    9401              
    9402              DW$T$24 .dwtag  DW_TAG_structure_type
    9403                      .dwattr DW$T$24, DW_AT_byte_size(0x0e)
    9404              DW$783  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    9405                      .dwattr DW$783, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
    9406                      .dwattr DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9407                      .dwattr DW$783, DW_AT_accessibility(DW_ACCESS_public)
    9408              DW$784  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9409                      .dwattr DW$784, DW_AT_name("buf_len"), DW_AT_symbol_name("_buf_len")
    9410                      .dwattr DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9411                      .dwattr DW$784, DW_AT_accessibility(DW_ACCESS_public)
    9412              DW$785  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    9413                      .dwattr DW$785, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
    9414                      .dwattr DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9415                      .dwattr DW$785, DW_AT_accessibility(DW_ACCESS_public)
    9416              DW$786  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9417                      .dwattr DW$786, DW_AT_name("times"), DW_AT_symbol_name("_times")
    9418                      .dwattr DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9419                      .dwattr DW$786, DW_AT_accessibility(DW_ACCESS_public)
    9420              DW$787  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9421                      .dwattr DW$787, DW_AT_name("times_cnt"), DW_AT_symbol_name("_times_cnt")
    9422                      .dwattr DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9423                      .dwattr DW$787, DW_AT_accessibility(DW_ACCESS_public)
    9424              DW$788  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9425                      .dwattr DW$788, DW_AT_name("data_cnt"), DW_AT_symbol_name("_data_cnt")
    9426                      .dwattr DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9427                      .dwattr DW$788, DW_AT_accessibility(DW_ACCESS_public)
    9428              DW$789  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    9429                      .dwattr DW$789, DW_AT_name("err"), DW_AT_symbol_name("_err")
    9430                      .dwattr DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9431                      .dwattr DW$789, DW_AT_accessibility(DW_ACCESS_public)
    9432              DW$790  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9433                      .dwattr DW$790, DW_AT_name("start_pos"), DW_AT_symbol_name("_start_pos")
    9434                      .dwattr DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9435                      .dwattr DW$790, DW_AT_accessibility(DW_ACCESS_public)
    9436              DW$791  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 04 16:21:37 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8402                            PAGE  179

    9437                      .dwattr DW$791, DW_AT_name("end_pos"), DW_AT_symbol_name("_end_pos")
    9438                      .dwattr DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9439                      .dwattr DW$791, DW_AT_accessibility(DW_ACCESS_public)
    9440              DW$792  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    9441                      .dwattr DW$792, DW_AT_name("average_data"), DW_AT_symbol_name("_average_data")
    9442                      .dwattr DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9443                      .dwattr DW$792, DW_AT_accessibility(DW_ACCESS_public)
    9444                      .dwendtag DW$T$24
    9445              
    9446              
    9447              DW$T$26 .dwtag  DW_TAG_structure_type
    9448                      .dwattr DW$T$26, DW_AT_byte_size(0x06)
    9449              DW$793  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9450                      .dwattr DW$793, DW_AT_name("start_pos"), DW_AT_symbol_name("_start_pos")
    9451                      .dwattr DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9452                      .dwattr DW$793, DW_AT_accessibility(DW_ACCESS_public)
    9453              DW$794  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9454                      .dwattr DW$794, DW_AT_name("end_pos"), DW_AT_symbol_name("_end_pos")
    9455                      .dwattr DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9456                      .dwattr DW$794, DW_AT_accessibility(DW_ACCESS_public)
    9457              DW$795  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9458                      .dwattr DW$795, DW_AT_name("buffer_size"), DW_AT_symbol_name("_buffer_size")
    9459                      .dwattr DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9460                      .dwattr DW$795, DW_AT_accessibility(DW_ACCESS_public)
    9461              DW$796  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    9462                      .dwattr DW$796, DW_AT_name("buffer_ptr"), DW_AT_symbol_name("_buffer_ptr")
    9463                      .dwattr DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9464                      .dwattr DW$796, DW_AT_accessibility(DW_ACCESS_public)
    9465                      .dwendtag DW$T$26
    9466              
    9467              
    9468              DW$T$31 .dwtag  DW_TAG_structure_type
    9469                      .dwattr DW$T$31, DW_AT_byte_size(0x0a)
    9470              DW$797  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    9471                      .dwattr DW$797, DW_AT_name("shadow_buf"), DW_AT_symbol_name("_shadow_buf")
    9472                      .dwattr DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9473                      .dwattr DW$797, DW_AT_accessibility(DW_ACCESS_public)
    9474              DW$798  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    9475                      .dwattr DW$798, DW_AT_name("shadow_buf_size"), DW_AT_symbol_name("_shadow_buf_size")
    9476                      .dwattr DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9477                      .dwattr DW$798, DW_AT_accessibility(DW_ACCESS_public)
    9478              DW$799  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    9479                      .dwattr DW$799, DW_AT_name("debounce_times_level"), DW_AT_symbol_name("_debounce_times_level")
    9480                      .dwattr DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9481                      .dwattr DW$799, DW_AT_accessibility(DW_ACCESS_public)
    9482              DW$800  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    9483                      .dwattr DW$800, DW_AT_name("current_debounce_times"), DW_AT_symbol_name("_current_debounce_times")
    9484                      .dwattr DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9485                      .dwattr DW$800, DW_AT_accessibility(DW_ACCESS_public)
    9486              DW$801  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    9487                      .dwattr DW$801, DW_AT_name("debounce_conditon"), DW_AT_symbol_name("_debounce_conditon")
    9488                      .dwattr DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9489                      .dwattr DW$801, DW_AT_accessibility(DW_ACCESS_public)
    9490                      .dwendtag DW$T$31
    9491              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 04 16:21:37 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8402                            PAGE  180

    9492              
    9493              DW$T$33 .dwtag  DW_TAG_structure_type
    9494                      .dwattr DW$T$33, DW_AT_name("_link_list_t")
    9495                      .dwattr DW$T$33, DW_AT_byte_size(0x06)
    9496              DW$802  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    9497                      .dwattr DW$802, DW_AT_name("last_member"), DW_AT_symbol_name("_last_member")
    9498                      .dwattr DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9499                      .dwattr DW$802, DW_AT_accessibility(DW_ACCESS_public)
    9500              DW$803  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    9501                      .dwattr DW$803, DW_AT_name("cur_member"), DW_AT_symbol_name("_cur_member")
    9502                      .dwattr DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9503                      .dwattr DW$803, DW_AT_accessibility(DW_ACCESS_public)
    9504              DW$804  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    9505                      .dwattr DW$804, DW_AT_name("next_member"), DW_AT_symbol_name("_next_member")
    9506                      .dwattr DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9507                      .dwattr DW$804, DW_AT_accessibility(DW_ACCESS_public)
    9508                      .dwendtag DW$T$33
    9509              
    9510              DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
    9511                      .dwattr DW$T$32, DW_AT_address_class(0x16)
    9512              
    9513              DW$T$36 .dwtag  DW_TAG_structure_type
    9514                      .dwattr DW$T$36, DW_AT_byte_size(0x06)
    9515              DW$805  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9516                      .dwattr DW$805, DW_AT_name("id"), DW_AT_symbol_name("_id")
    9517                      .dwattr DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9518                      .dwattr DW$805, DW_AT_accessibility(DW_ACCESS_public)
    9519              DW$806  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    9520                      .dwattr DW$806, DW_AT_name("link_list_end"), DW_AT_symbol_name("_link_list_end")
    9521                      .dwattr DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9522                      .dwattr DW$806, DW_AT_accessibility(DW_ACCESS_public)
    9523              DW$807  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    9524                      .dwattr DW$807, DW_AT_name("link_list_head"), DW_AT_symbol_name("_link_list_head")
    9525                      .dwattr DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9526                      .dwattr DW$807, DW_AT_accessibility(DW_ACCESS_public)
    9527                      .dwendtag DW$T$36
    9528              
    9529              
    9530              DW$T$43 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$42)
    9531                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
    9532                      .dwattr DW$T$43, DW_AT_byte_size(0x3c)
    9533              DW$808  .dwtag  DW_TAG_subrange_type
    9534                      .dwattr DW$808, DW_AT_upper_bound(0x09)
    9535                      .dwendtag DW$T$43
    9536              
    9537              
    9538              DW$T$40 .dwtag  DW_TAG_structure_type
    9539                      .dwattr DW$T$40, DW_AT_byte_size(0x0a)
    9540              DW$809  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    9541                      .dwattr DW$809, DW_AT_name("function"), DW_AT_symbol_name("_function")
    9542                      .dwattr DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9543                      .dwattr DW$809, DW_AT_accessibility(DW_ACCESS_public)
    9544              DW$810  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9545                      .dwattr DW$810, DW_AT_name("expires"), DW_AT_symbol_name("_expires")
    9546                      .dwattr DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 04 16:21:37 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8402                            PAGE  181

    9547                      .dwattr DW$810, DW_AT_accessibility(DW_ACCESS_public)
    9548              DW$811  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9549                      .dwattr DW$811, DW_AT_name("tmr_state"), DW_AT_symbol_name("_tmr_state")
    9550                      .dwattr DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9551                      .dwattr DW$811, DW_AT_accessibility(DW_ACCESS_public)
    9552              DW$812  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9553                      .dwattr DW$812, DW_AT_name("type"), DW_AT_symbol_name("_type")
    9554                      .dwattr DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9555                      .dwattr DW$812, DW_AT_accessibility(DW_ACCESS_public)
    9556              DW$813  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
    9557                      .dwattr DW$813, DW_AT_name("auto_load_expires"), DW_AT_symbol_name("_auto_load_expires")
    9558                      .dwattr DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9559                      .dwattr DW$813, DW_AT_accessibility(DW_ACCESS_public)
    9560              DW$814  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    9561                      .dwattr DW$814, DW_AT_name("p_arg"), DW_AT_symbol_name("_p_arg")
    9562                      .dwattr DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9563                      .dwattr DW$814, DW_AT_accessibility(DW_ACCESS_public)
    9564                      .dwendtag DW$T$40
    9565              
    9566              
    9567              DW$T$46 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$45)
    9568                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
    9569                      .dwattr DW$T$46, DW_AT_byte_size(0x96)
    9570              DW$815  .dwtag  DW_TAG_subrange_type
    9571                      .dwattr DW$815, DW_AT_upper_bound(0x0e)
    9572                      .dwendtag DW$T$46
    9573              
    9574              
    9575              DW$T$41 .dwtag  DW_TAG_structure_type
    9576                      .dwattr DW$T$41, DW_AT_byte_size(0x08)
    9577              DW$816  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    9578                      .dwattr DW$816, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    9579                      .dwattr DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9580                      .dwattr DW$816, DW_AT_accessibility(DW_ACCESS_public)
    9581              DW$817  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    9582                      .dwattr DW$817, DW_AT_name("parray"), DW_AT_symbol_name("_parray")
    9583                      .dwattr DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9584                      .dwattr DW$817, DW_AT_accessibility(DW_ACCESS_public)
    9585              DW$818  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    9586                      .dwattr DW$818, DW_AT_name("pmem"), DW_AT_symbol_name("_pmem")
    9587                      .dwattr DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9588                      .dwattr DW$818, DW_AT_accessibility(DW_ACCESS_public)
    9589              DW$819  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9590                      .dwattr DW$819, DW_AT_name("blk_size"), DW_AT_symbol_name("_blk_size")
    9591                      .dwattr DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9592                      .dwattr DW$819, DW_AT_accessibility(DW_ACCESS_public)
    9593              DW$820  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    9594                      .dwattr DW$820, DW_AT_name("blk_num"), DW_AT_symbol_name("_blk_num")
    9595                      .dwattr DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9596                      .dwattr DW$820, DW_AT_accessibility(DW_ACCESS_public)
    9597                      .dwendtag DW$T$41
    9598              
    9599              
    9600              DW$T$49 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$48)
    9601                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 04 16:21:37 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8402                            PAGE  182

    9602                      .dwattr DW$T$49, DW_AT_byte_size(0x08)
    9603              DW$821  .dwtag  DW_TAG_subrange_type
    9604                      .dwattr DW$821, DW_AT_upper_bound(0x00)
    9605                      .dwendtag DW$T$49
    9606              
    9607              
    9608              DW$T$27 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    9609                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    9610                      .dwattr DW$T$27, DW_AT_byte_size(0x04)
    9611              DW$822  .dwtag  DW_TAG_subrange_type
    9612                      .dwattr DW$822, DW_AT_upper_bound(0x03)
    9613                      .dwendtag DW$T$27
    9614              
    9615              DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("debounce_conditon_function_t"), DW_AT_type(*DW$T$29)
    9616                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    9617              
    9618              DW$T$22 .dwtag  DW_TAG_structure_type
    9619                      .dwattr DW$T$22, DW_AT_name("os_event")
    9620                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    9621              DW$823  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    9622                      .dwattr DW$823, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    9623                      .dwattr DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9624                      .dwattr DW$823, DW_AT_accessibility(DW_ACCESS_public)
    9625              DW$824  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    9626                      .dwattr DW$824, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    9627                      .dwattr DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9628                      .dwattr DW$824, DW_AT_accessibility(DW_ACCESS_public)
    9629              DW$825  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    9630                      .dwattr DW$825, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    9631                      .dwattr DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9632                      .dwattr DW$825, DW_AT_accessibility(DW_ACCESS_public)
    9633              DW$826  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    9634                      .dwattr DW$826, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    9635                      .dwattr DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9636                      .dwattr DW$826, DW_AT_accessibility(DW_ACCESS_public)
    9637              DW$827  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    9638                      .dwattr DW$827, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    9639                      .dwattr DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9640                      .dwattr DW$827, DW_AT_accessibility(DW_ACCESS_public)
    9641                      .dwendtag DW$T$22
    9642              
    9643              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
    9644                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    9645              
    9646              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    9647                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    9648                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    9649              DW$828  .dwtag  DW_TAG_subrange_type
    9650                      .dwattr DW$828, DW_AT_upper_bound(0x07)
    9651                      .dwendtag DW$T$21
    9652              
    9653              DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
    9654                      .dwattr DW$T$29, DW_AT_address_class(0x16)
    9655              
    9656              DW$T$28 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Aug 04 16:21:37 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8402                            PAGE  183

    9657                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    9658              DW$829  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    9659              DW$830  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    9660                      .dwendtag DW$T$28
    9661              
    9662              
    9663                      .dwattr DW$606, DW_AT_external(0x01)
    9664                      .dwattr DW$600, DW_AT_external(0x01)
    9665                      .dwattr DW$600, DW_AT_type(*DW$T$3)
    9666                      .dwattr DW$613, DW_AT_external(0x01)
    9667                      .dwattr DW$333, DW_AT_external(0x01)
    9668                      .dwattr DW$134, DW_AT_external(0x01)
    9669                      .dwattr DW$131, DW_AT_external(0x01)
    9670                      .dwattr DW$131, DW_AT_type(*DW$T$23)
    9671                      .dwattr DW$97, DW_AT_external(0x01)
    9672                      .dwattr DW$121, DW_AT_external(0x01)
    9673                      .dwattr DW$109, DW_AT_external(0x01)
    9674                      .dwattr DW$104, DW_AT_external(0x01)
    9675                      .dwattr DW$104, DW_AT_type(*DW$T$23)
    9676                      .dwattr DW$389, DW_AT_external(0x01)
    9677                      .dwattr DW$389, DW_AT_type(*DW$T$82)
    9678                      .dwattr DW$344, DW_AT_external(0x01)
    9679                      .dwattr DW$344, DW_AT_type(*DW$T$6)
    9680                      .dwattr DW$341, DW_AT_external(0x01)
    9681                      .dwattr DW$341, DW_AT_type(*DW$T$81)
    9682                      .dwattr DW$359, DW_AT_external(0x01)
    9683                      .dwattr DW$359, DW_AT_type(*DW$T$6)
    9684                      .dwattr DW$263, DW_AT_external(0x01)
    9685                      .dwattr DW$263, DW_AT_type(*DW$T$16)
    9686                      .dwattr DW$260, DW_AT_external(0x01)
    9687                      .dwattr DW$260, DW_AT_type(*DW$T$12)
    9688                      .dwattr DW$290, DW_AT_external(0x01)
    9689                      .dwattr DW$290, DW_AT_type(*DW$T$115)
    9690                      .dwattr DW$285, DW_AT_external(0x01)
    9691                      .dwattr DW$350, DW_AT_external(0x01)
    9692                      .dwattr DW$350, DW_AT_type(*DW$T$23)
    9693                      .dwattr DW$347, DW_AT_external(0x01)
    9694                      .dwattr DW$347, DW_AT_type(*DW$T$115)
    9695                      .dwattr DW$364, DW_AT_external(0x01)
    9696                      .dwattr DW$239, DW_AT_external(0x01)
    9697                      .dwattr DW$239, DW_AT_type(*DW$T$23)
