TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:01 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4722                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sat Oct 09 16:16:00 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("debuglog.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    2079                      .dwattr DW$T$104, DW_AT_language(DW_LANG_C)
    2080              
    2081              DW$T$105        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$104)
    2082                      .dwattr DW$T$105, DW_AT_language(DW_LANG_C)
    2083              DW$222  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
    2084              DW$223  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    2085              DW$224  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$43)
    2086                      .dwendtag DW$T$105
    2087              
    2088              DW$T$12 .dwtag  DW_TAG_base_type, DW_AT_name("long")
    2089                      .dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2090                      .dwattr DW$T$12, DW_AT_byte_size(0x02)
    2091              DW$T$107        .dwtag  DW_TAG_typedef, DW_AT_name("int32_t"), DW_AT_type(*DW$T$12)
    2092                      .dwattr DW$T$107, DW_AT_language(DW_LANG_C)
    2093              DW$T$109        .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t"), DW_AT_type(*DW$T$13)
    2094                      .dwattr DW$T$109, DW_AT_language(DW_LANG_C)
    2095              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
    2096                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
    2097                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
    2098              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
    2099                      .dwattr DW$T$28, DW_AT_address_class(0x16)
    2100              DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$46)
    2101                      .dwattr DW$T$47, DW_AT_address_class(0x16)
    2102              DW$T$74 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$47)
    2103                      .dwattr DW$T$74, DW_AT_address_class(0x16)
    2104              DW$T$51 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$50)
    2105                      .dwattr DW$T$51, DW_AT_address_class(0x16)
    2106              DW$T$52 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$51)
    2107                      .dwattr DW$T$52, DW_AT_address_class(0x16)
    2108              DW$T$79 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$78)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:01 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4722                            PAGE   42

    2109                      .dwattr DW$T$79, DW_AT_address_class(0x16)
    2110              DW$T$23 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    2111                      .dwattr DW$T$23, DW_AT_encoding(DW_ATE_signed_char)
    2112                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    2113              DW$T$66 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    2114                      .dwattr DW$T$66, DW_AT_address_class(0x16)
    2115              
    2116              DW$T$113        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$112)
    2117                      .dwattr DW$T$113, DW_AT_language(DW_LANG_C)
    2118                      .dwattr DW$T$113, DW_AT_byte_size(0x202)
    2119              DW$225  .dwtag  DW_TAG_subrange_type
    2120                      .dwattr DW$225, DW_AT_upper_bound(0x201)
    2121                      .dwendtag DW$T$113
    2122              
    2123              
    2124              DW$T$116        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    2125                      .dwattr DW$T$116, DW_AT_language(DW_LANG_C)
    2126                      .dwattr DW$T$116, DW_AT_byte_size(0x0f)
    2127              DW$226  .dwtag  DW_TAG_subrange_type
    2128                      .dwattr DW$226, DW_AT_upper_bound(0x0e)
    2129                      .dwendtag DW$T$116
    2130              
    2131              DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("log_param"), DW_AT_type(*DW$T$26)
    2132                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    2133              DW$T$34 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
    2134                      .dwattr DW$T$34, DW_AT_address_class(0x16)
    2135              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    2136                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2137                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    2138              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    2139                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2140                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    2141              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    2142                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2143                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    2144              DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    2145                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    2146              DW$T$46 .dwtag  DW_TAG_typedef, DW_AT_name("a_lock_t"), DW_AT_type(*DW$T$27)
    2147                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
    2148              DW$T$50 .dwtag  DW_TAG_typedef, DW_AT_name("a_q_t"), DW_AT_type(*DW$T$27)
    2149                      .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
    2150              DW$T$78 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$77)
    2151                      .dwattr DW$T$78, DW_AT_address_class(0x16)
    2152              DW$T$112        .dwtag  DW_TAG_typedef, DW_AT_name("int8_t"), DW_AT_type(*DW$T$23)
    2153                      .dwattr DW$T$112, DW_AT_language(DW_LANG_C)
    2154              
    2155              DW$T$26 .dwtag  DW_TAG_structure_type
    2156                      .dwattr DW$T$26, DW_AT_byte_size(0x28)
    2157              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    2158                      .dwattr DW$227, DW_AT_name("pram_buf"), DW_AT_symbol_name("_pram_buf")
    2159                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2160                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2161              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2162                      .dwattr DW$228, DW_AT_name("cur_off"), DW_AT_symbol_name("_cur_off")
    2163                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:01 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4722                            PAGE   43

    2164                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2165              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2166                      .dwattr DW$229, DW_AT_name("parm_0"), DW_AT_symbol_name("_parm_0")
    2167                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2168                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2169              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2170                      .dwattr DW$230, DW_AT_name("parm_1"), DW_AT_symbol_name("_parm_1")
    2171                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2172                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2173              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2174                      .dwattr DW$231, DW_AT_name("parm_2"), DW_AT_symbol_name("_parm_2")
    2175                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2176                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2177              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2178                      .dwattr DW$232, DW_AT_name("parm_3"), DW_AT_symbol_name("_parm_3")
    2179                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2180                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2181              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2182                      .dwattr DW$233, DW_AT_name("parm_4"), DW_AT_symbol_name("_parm_4")
    2183                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2184                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2185              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2186                      .dwattr DW$234, DW_AT_name("parm_5"), DW_AT_symbol_name("_parm_5")
    2187                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2188                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2189              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2190                      .dwattr DW$235, DW_AT_name("end_pram"), DW_AT_symbol_name("_end_pram")
    2191                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2192                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2193                      .dwendtag DW$T$26
    2194              
    2195              
    2196              DW$T$22 .dwtag  DW_TAG_structure_type
    2197                      .dwattr DW$T$22, DW_AT_name("os_event")
    2198                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    2199              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2200                      .dwattr DW$236, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    2201                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2202                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2203              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2204                      .dwattr DW$237, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    2205                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2206                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2207              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    2208                      .dwattr DW$238, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    2209                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2210                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2211              DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2212                      .dwattr DW$239, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    2213                      .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2214                      .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2215              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2216                      .dwattr DW$240, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    2217                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2218                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:01 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4722                            PAGE   44

    2219                      .dwendtag DW$T$22
    2220              
    2221              DW$T$77 .dwtag  DW_TAG_typedef, DW_AT_name("a_sem_t"), DW_AT_type(*DW$T$27)
    2222                      .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
    2223              
    2224              DW$T$24 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    2225                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
    2226                      .dwattr DW$T$24, DW_AT_byte_size(0x18)
    2227              DW$241  .dwtag  DW_TAG_subrange_type
    2228                      .dwattr DW$241, DW_AT_upper_bound(0x17)
    2229                      .dwendtag DW$T$24
    2230              
    2231              
    2232              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    2233                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    2234                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    2235              DW$242  .dwtag  DW_TAG_subrange_type
    2236                      .dwattr DW$242, DW_AT_upper_bound(0x07)
    2237                      .dwendtag DW$T$21
    2238              
    2239              
    2240                      .dwattr DW$103, DW_AT_external(0x01)
    2241                      .dwattr DW$103, DW_AT_type(*DW$T$3)
    2242                      .dwattr DW$171, DW_AT_external(0x01)
    2243                      .dwattr DW$173, DW_AT_external(0x01)
    2244                      .dwattr DW$93, DW_AT_external(0x01)
    2245                      .dwattr DW$144, DW_AT_external(0x01)
    2246                      .dwattr DW$144, DW_AT_type(*DW$T$43)
    2247                      .dwattr DW$150, DW_AT_external(0x01)
    2248                      .dwattr DW$158, DW_AT_external(0x01)
    2249                      .dwattr DW$86, DW_AT_external(0x01)
    2250                      .dwattr DW$108, DW_AT_external(0x01)
    2251                      .dwattr DW$96, DW_AT_external(0x01)
    2252                      .dwattr DW$145, DW_AT_external(0x01)
    2253                      .dwattr DW$145, DW_AT_type(*DW$T$43)
    2254                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    2255              
    2256              ;***************************************************************
    2257              ;* DWARF CIE ENTRIES                                           *
    2258              ;***************************************************************
    2259              
    2260              DW$CIE  .dwcie 1, 40
    2261                      .dwcfa  0x0c, 20, 0
    2262                      .dwcfa  0x07, 0
    2263                      .dwcfa  0x07, 1
    2264                      .dwcfa  0x07, 2
    2265                      .dwcfa  0x07, 3
    2266                      .dwcfa  0x07, 4
    2267                      .dwcfa  0x07, 5
    2268                      .dwcfa  0x08, 6
    2269                      .dwcfa  0x08, 7
    2270                      .dwcfa  0x08, 8
    2271                      .dwcfa  0x08, 9
    2272                      .dwcfa  0x08, 10
    2273                      .dwcfa  0x08, 11
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:01 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4722                            PAGE   45

    2274                      .dwcfa  0x07, 12
    2275                      .dwcfa  0x07, 13
    2276                      .dwcfa  0x07, 14
    2277                      .dwcfa  0x07, 15
    2278                      .dwcfa  0x07, 16
    2279                      .dwcfa  0x07, 17
    2280                      .dwcfa  0x07, 18
