TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:04 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1322                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sat Oct 09 16:16:03 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("mem_maneger.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    1146                      .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    1147              DW$107  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
    1148                      .dwendtag DW$T$54
    1149              
    1150              
    1151              DW$T$55 .dwtag  DW_TAG_subroutine_type
    1152                      .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
    1153              DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t"), DW_AT_type(*DW$T$6)
    1154                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    1155              DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    1156                      .dwattr DW$T$27, DW_AT_address_class(0x16)
    1157              
    1158              DW$T$57 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$25)
    1159                      .dwattr DW$T$57, DW_AT_language(DW_LANG_C)
    1160              DW$108  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
    1161                      .dwendtag DW$T$57
    1162              
    1163              
    1164              DW$T$59 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    1165                      .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
    1166                      .dwattr DW$T$59, DW_AT_byte_size(0x64)
    1167              DW$109  .dwtag  DW_TAG_subrange_type
    1168                      .dwattr DW$109, DW_AT_upper_bound(0x63)
    1169                      .dwendtag DW$T$59
    1170              
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:04 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1322                            PAGE   25

    1171              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    1172                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1173                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
    1174              DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$28)
    1175                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    1176              
    1177              DW$T$62 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$29)
    1178                      .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
    1179              DW$110  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
    1180              DW$111  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1181                      .dwendtag DW$T$62
    1182              
    1183              DW$T$44 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$43)
    1184                      .dwattr DW$T$44, DW_AT_address_class(0x16)
    1185              DW$T$56 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$44)
    1186                      .dwattr DW$T$56, DW_AT_address_class(0x16)
    1187              DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    1188                      .dwattr DW$T$47, DW_AT_address_class(0x16)
    1189              
    1190              DW$T$65 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$47)
    1191                      .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    1192              DW$112  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$47)
    1193              DW$113  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$47)
    1194                      .dwendtag DW$T$65
    1195              
    1196              DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("log_param"), DW_AT_type(*DW$T$26)
    1197                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
    1198              DW$T$49 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$48)
    1199                      .dwattr DW$T$49, DW_AT_address_class(0x16)
    1200              DW$T$34 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
    1201                      .dwattr DW$T$34, DW_AT_address_class(0x16)
    1202              
    1203              DW$T$67 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$34)
    1204                      .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
    1205              DW$114  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
    1206              DW$115  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
    1207              DW$116  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
    1208              DW$117  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
    1209                      .dwendtag DW$T$67
    1210              
    1211              DW$T$69 .dwtag  DW_TAG_typedef, DW_AT_name("mem_maneger_t"), DW_AT_type(*DW$T$33)
    1212                      .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
    1213              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1214                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1215                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1216              DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t"), DW_AT_type(*DW$T$11)
    1217                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    1218              DW$T$43 .dwtag  DW_TAG_typedef, DW_AT_name("a_lock_t"), DW_AT_type(*DW$T$42)
    1219                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
    1220              DW$T$23 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1221                      .dwattr DW$T$23, DW_AT_encoding(DW_ATE_signed_char)
    1222                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    1223              
    1224              DW$T$26 .dwtag  DW_TAG_structure_type
    1225                      .dwattr DW$T$26, DW_AT_byte_size(0x28)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:04 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1322                            PAGE   26

    1226              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1227                      .dwattr DW$118, DW_AT_name("pram_buf"), DW_AT_symbol_name("_pram_buf")
    1228                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1229                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1230              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1231                      .dwattr DW$119, DW_AT_name("cur_off"), DW_AT_symbol_name("_cur_off")
    1232                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1233                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1234              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1235                      .dwattr DW$120, DW_AT_name("parm_0"), DW_AT_symbol_name("_parm_0")
    1236                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1237                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1238              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1239                      .dwattr DW$121, DW_AT_name("parm_1"), DW_AT_symbol_name("_parm_1")
    1240                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1241                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1242              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1243                      .dwattr DW$122, DW_AT_name("parm_2"), DW_AT_symbol_name("_parm_2")
    1244                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1245                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1246              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1247                      .dwattr DW$123, DW_AT_name("parm_3"), DW_AT_symbol_name("_parm_3")
    1248                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1249                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1250              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1251                      .dwattr DW$124, DW_AT_name("parm_4"), DW_AT_symbol_name("_parm_4")
    1252                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1253                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1254              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1255                      .dwattr DW$125, DW_AT_name("parm_5"), DW_AT_symbol_name("_parm_5")
    1256                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1257                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1258              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1259                      .dwattr DW$126, DW_AT_name("end_pram"), DW_AT_symbol_name("_end_pram")
    1260                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1261                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1262                      .dwendtag DW$T$26
    1263              
    1264              DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("mem_ctl_t"), DW_AT_type(*DW$T$30)
    1265                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    1266              
    1267              DW$T$33 .dwtag  DW_TAG_structure_type
    1268                      .dwattr DW$T$33, DW_AT_byte_size(0x12)
    1269              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1270                      .dwattr DW$127, DW_AT_name("real_size"), DW_AT_symbol_name("_real_size")
    1271                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1272                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1273              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    1274                      .dwattr DW$128, DW_AT_name("mem_member"), DW_AT_symbol_name("_mem_member")
    1275                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1276                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1277                      .dwendtag DW$T$33
    1278              
    1279              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1280                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:04 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1322                            PAGE   27

    1281                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1282              DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    1283                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
    1284              
    1285              DW$T$24 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    1286                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
    1287                      .dwattr DW$T$24, DW_AT_byte_size(0x18)
    1288              DW$129  .dwtag  DW_TAG_subrange_type
    1289                      .dwattr DW$129, DW_AT_upper_bound(0x17)
    1290                      .dwendtag DW$T$24
    1291              
    1292              
    1293              DW$T$30 .dwtag  DW_TAG_structure_type
    1294                      .dwattr DW$T$30, DW_AT_byte_size(0x08)
    1295              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1296                      .dwattr DW$130, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    1297                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1298                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1299              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1300                      .dwattr DW$131, DW_AT_name("parray"), DW_AT_symbol_name("_parray")
    1301                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1302                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1303              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1304                      .dwattr DW$132, DW_AT_name("pmem"), DW_AT_symbol_name("_pmem")
    1305                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1306                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1307              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1308                      .dwattr DW$133, DW_AT_name("blk_size"), DW_AT_symbol_name("_blk_size")
    1309                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1310                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1311              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1312                      .dwattr DW$134, DW_AT_name("blk_num"), DW_AT_symbol_name("_blk_num")
    1313                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1314                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1315                      .dwendtag DW$T$30
    1316              
    1317              
    1318              DW$T$32 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$31)
    1319                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    1320                      .dwattr DW$T$32, DW_AT_byte_size(0x10)
    1321              DW$135  .dwtag  DW_TAG_subrange_type
    1322                      .dwattr DW$135, DW_AT_upper_bound(0x01)
    1323                      .dwendtag DW$T$32
    1324              
    1325              
    1326              DW$T$22 .dwtag  DW_TAG_structure_type
    1327                      .dwattr DW$T$22, DW_AT_name("os_event")
    1328                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    1329              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1330                      .dwattr DW$136, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    1331                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1333              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1334                      .dwattr DW$137, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    1335                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:04 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1322                            PAGE   28

    1336                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1337              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1338                      .dwattr DW$138, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    1339                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1340                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1341              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1342                      .dwattr DW$139, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    1343                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1344                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1345              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1346                      .dwattr DW$140, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    1347                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1348                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1349                      .dwendtag DW$T$22
    1350              
    1351              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
    1352                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    1353              
    1354              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    1355                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    1356                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    1357              DW$141  .dwtag  DW_TAG_subrange_type
    1358                      .dwattr DW$141, DW_AT_upper_bound(0x07)
    1359                      .dwendtag DW$T$21
    1360              
    1361              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
    1362                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    1363              
    1364                      .dwattr DW$77, DW_AT_external(0x01)
    1365                      .dwattr DW$77, DW_AT_type(*DW$T$34)
    1366                      .dwattr DW$70, DW_AT_external(0x01)
    1367                      .dwattr DW$70, DW_AT_type(*DW$T$3)
    1368                      .dwattr DW$28, DW_AT_external(0x01)
    1369                      .dwattr DW$28, DW_AT_type(*DW$T$29)
    1370                      .dwattr DW$60, DW_AT_external(0x01)
    1371                      .dwattr DW$65, DW_AT_external(0x01)
    1372                      .dwattr DW$45, DW_AT_external(0x01)
    1373                      .dwattr DW$54, DW_AT_external(0x01)
    1374                      .dwattr DW$54, DW_AT_type(*DW$T$3)
    1375                      .dwattr DW$38, DW_AT_external(0x01)
    1376                      .dwattr DW$38, DW_AT_type(*DW$T$3)
    1377                      .dwattr DW$91, DW_AT_external(0x01)
    1378                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1379              
    1380              ;***************************************************************
    1381              ;* DWARF CIE ENTRIES                                           *
    1382              ;***************************************************************
    1383              
    1384              DW$CIE  .dwcie 1, 40
    1385                      .dwcfa  0x0c, 20, 0
    1386                      .dwcfa  0x07, 0
    1387                      .dwcfa  0x07, 1
    1388                      .dwcfa  0x07, 2
    1389                      .dwcfa  0x07, 3
    1390                      .dwcfa  0x07, 4
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:04 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1322                            PAGE   29

    1391                      .dwcfa  0x07, 5
    1392                      .dwcfa  0x08, 6
    1393                      .dwcfa  0x08, 7
    1394                      .dwcfa  0x08, 8
    1395                      .dwcfa  0x08, 9
    1396                      .dwcfa  0x08, 10
    1397                      .dwcfa  0x08, 11
    1398                      .dwcfa  0x07, 12
    1399                      .dwcfa  0x07, 13
    1400                      .dwcfa  0x07, 14
    1401                      .dwcfa  0x07, 15
    1402                      .dwcfa  0x07, 16
    1403                      .dwcfa  0x07, 17
    1404                      .dwcfa  0x07, 18
    1405                      .dwcfa  0x07, 19
    1406                      .dwcfa  0x07, 20
    1407                      .dwcfa  0x07, 21
    1408                      .dwcfa  0x07, 22
    1409                      .dwcfa  0x07, 23
    1410                      .dwcfa  0x07, 24
    1411                      .dwcfa  0x07, 25
    1412                      .dwcfa  0x07, 26
    1413                      .dwcfa  0x08, 27
    1414                      .dwcfa  0x07, 28
