TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:05 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8722                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sat Oct 09 16:16:05 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("timer_array.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    1177              DW$100  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
    1178                      .dwendtag DW$T$58
    1179              
    1180              DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t"), DW_AT_type(*DW$T$6)
    1181                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    1182              
    1183              DW$T$60 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$25)
    1184                      .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
    1185              DW$101  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$59)
    1186                      .dwendtag DW$T$60
    1187              
    1188              
    1189              DW$T$62 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$25)
    1190                      .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
    1191              DW$102  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    1192              DW$103  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$46)
    1193                      .dwendtag DW$T$62
    1194              
    1195              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
    1196                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    1197              DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$31)
    1198                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    1199              DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$31)
    1200                      .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    1201              
    1202              DW$T$66 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$65)
    1203                      .dwattr DW$T$66, DW_AT_language(DW_LANG_C)
    1204              DW$104  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
    1205              DW$105  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    1206              DW$106  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
    1207                      .dwendtag DW$T$66
    1208              
    1209              DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t"), DW_AT_type(*DW$T$13)
    1210                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    1211              DW$107  .dwtag  DW_TAG_far_type
    1212                      .dwattr DW$107, DW_AT_type(*DW$T$30)
    1213              DW$T$68 .dwtag  DW_TAG_volatile_type
    1214                      .dwattr DW$T$68, DW_AT_type(*DW$107)
    1215              DW$T$43 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
    1216                      .dwattr DW$T$43, DW_AT_address_class(0x16)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:05 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8722                            PAGE   26

    1217              DW$T$59 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$43)
    1218                      .dwattr DW$T$59, DW_AT_address_class(0x16)
    1219              DW$T$46 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    1220                      .dwattr DW$T$46, DW_AT_address_class(0x16)
    1221              DW$T$47 .dwtag  DW_TAG_typedef, DW_AT_name("log_param"), DW_AT_type(*DW$T$26)
    1222                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
    1223              DW$T$48 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$47)
    1224                      .dwattr DW$T$48, DW_AT_address_class(0x16)
    1225              DW$T$55 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
    1226                      .dwattr DW$T$55, DW_AT_address_class(0x16)
    1227              
    1228              DW$T$69 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$55)
    1229                      .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
    1230              DW$108  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
    1231              DW$109  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
    1232              DW$110  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
    1233              DW$111  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1234                      .dwendtag DW$T$69
    1235              
    1236              DW$T$71 .dwtag  DW_TAG_typedef, DW_AT_name("tmr_array_t"), DW_AT_type(*DW$T$36)
    1237                      .dwattr DW$T$71, DW_AT_language(DW_LANG_C)
    1238              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1239                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1240                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1241              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1242                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1243                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1244              DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t"), DW_AT_type(*DW$T$11)
    1245                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    1246              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    1247                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1248                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    1249              DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("a_lock_t"), DW_AT_type(*DW$T$41)
    1250                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
    1251              DW$T$23 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1252                      .dwattr DW$T$23, DW_AT_encoding(DW_ATE_signed_char)
    1253                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    1254              
    1255              DW$T$26 .dwtag  DW_TAG_structure_type
    1256                      .dwattr DW$T$26, DW_AT_byte_size(0x28)
    1257              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1258                      .dwattr DW$112, DW_AT_name("pram_buf"), DW_AT_symbol_name("_pram_buf")
    1259                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1261              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1262                      .dwattr DW$113, DW_AT_name("cur_off"), DW_AT_symbol_name("_cur_off")
    1263                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1264                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1265              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1266                      .dwattr DW$114, DW_AT_name("parm_0"), DW_AT_symbol_name("_parm_0")
    1267                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1268                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1269              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1270                      .dwattr DW$115, DW_AT_name("parm_1"), DW_AT_symbol_name("_parm_1")
    1271                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:05 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8722                            PAGE   27

    1272                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1273              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1274                      .dwattr DW$116, DW_AT_name("parm_2"), DW_AT_symbol_name("_parm_2")
    1275                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1276                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1277              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1278                      .dwattr DW$117, DW_AT_name("parm_3"), DW_AT_symbol_name("_parm_3")
    1279                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1280                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1281              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1282                      .dwattr DW$118, DW_AT_name("parm_4"), DW_AT_symbol_name("_parm_4")
    1283                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1284                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1285              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1286                      .dwattr DW$119, DW_AT_name("parm_5"), DW_AT_symbol_name("_parm_5")
    1287                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1288                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1289              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1290                      .dwattr DW$120, DW_AT_name("end_pram"), DW_AT_symbol_name("_end_pram")
    1291                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1292                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1293                      .dwendtag DW$T$26
    1294              
    1295              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("tmr_member_t"), DW_AT_type(*DW$T$33)
    1296                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    1297              
    1298              DW$T$36 .dwtag  DW_TAG_structure_type
    1299                      .dwattr DW$T$36, DW_AT_byte_size(0x66)
    1300              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    1301                      .dwattr DW$121, DW_AT_name("ture_size"), DW_AT_symbol_name("_ture_size")
    1302                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1303                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1304              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    1305                      .dwattr DW$122, DW_AT_name("tmr_array"), DW_AT_symbol_name("_tmr_array")
    1306                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1307                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1308                      .dwendtag DW$T$36
    1309              
    1310              DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    1311                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    1312              
    1313              DW$T$24 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    1314                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
    1315                      .dwattr DW$T$24, DW_AT_byte_size(0x18)
    1316              DW$123  .dwtag  DW_TAG_subrange_type
    1317                      .dwattr DW$123, DW_AT_upper_bound(0x17)
    1318                      .dwendtag DW$T$24
    1319              
    1320              
    1321              DW$T$33 .dwtag  DW_TAG_structure_type
    1322                      .dwattr DW$T$33, DW_AT_byte_size(0x0a)
    1323              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1324                      .dwattr DW$124, DW_AT_name("function"), DW_AT_symbol_name("_function")
    1325                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1326                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:05 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8722                            PAGE   28

    1327              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1328                      .dwattr DW$125, DW_AT_name("expires"), DW_AT_symbol_name("_expires")
    1329                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1330                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1331              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    1332                      .dwattr DW$126, DW_AT_name("tmr_state"), DW_AT_symbol_name("_tmr_state")
    1333                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1334                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1335              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    1336                      .dwattr DW$127, DW_AT_name("type"), DW_AT_symbol_name("_type")
    1337                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1338                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1339              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1340                      .dwattr DW$128, DW_AT_name("auto_load_expires"), DW_AT_symbol_name("_auto_load_expires")
    1341                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1342                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1343              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1344                      .dwattr DW$129, DW_AT_name("p_arg"), DW_AT_symbol_name("_p_arg")
    1345                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1346                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1347                      .dwendtag DW$T$33
    1348              
    1349              
    1350              DW$T$35 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$34)
    1351                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
    1352                      .dwattr DW$T$35, DW_AT_byte_size(0x64)
    1353              DW$130  .dwtag  DW_TAG_subrange_type
    1354                      .dwattr DW$130, DW_AT_upper_bound(0x09)
    1355                      .dwendtag DW$T$35
    1356              
    1357              
    1358              DW$T$22 .dwtag  DW_TAG_structure_type
    1359                      .dwattr DW$T$22, DW_AT_name("os_event")
    1360                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    1361              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1362                      .dwattr DW$131, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    1363                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1364                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1365              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1366                      .dwattr DW$132, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    1367                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1368                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1369              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1370                      .dwattr DW$133, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    1371                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1372                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1373              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1374                      .dwattr DW$134, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    1375                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1376                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1377              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1378                      .dwattr DW$135, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    1379                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1380                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1381                      .dwendtag DW$T$22
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:05 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8722                            PAGE   29

    1382              
    1383              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
    1384                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    1385              
    1386              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    1387                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    1388                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    1389              DW$136  .dwtag  DW_TAG_subrange_type
    1390                      .dwattr DW$136, DW_AT_upper_bound(0x07)
    1391                      .dwendtag DW$T$21
    1392              
    1393              
    1394                      .dwattr DW$28, DW_AT_external(0x01)
    1395                      .dwattr DW$30, DW_AT_external(0x01)
    1396                      .dwattr DW$64, DW_AT_external(0x01)
    1397                      .dwattr DW$87, DW_AT_external(0x01)
    1398                      .dwattr DW$29, DW_AT_external(0x01)
    1399                      .dwattr DW$63, DW_AT_external(0x01)
    1400                      .dwattr DW$31, DW_AT_external(0x01)
    1401                      .dwattr DW$31, DW_AT_type(*DW$T$55)
    1402                      .dwattr DW$53, DW_AT_external(0x01)
    1403                      .dwattr DW$44, DW_AT_external(0x01)
    1404                      .dwattr DW$58, DW_AT_external(0x01)
    1405                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1406              
    1407              ;***************************************************************
    1408              ;* DWARF CIE ENTRIES                                           *
    1409              ;***************************************************************
    1410              
    1411              DW$CIE  .dwcie 1, 40
    1412                      .dwcfa  0x0c, 20, 0
    1413                      .dwcfa  0x07, 0
    1414                      .dwcfa  0x07, 1
    1415                      .dwcfa  0x07, 2
    1416                      .dwcfa  0x07, 3
    1417                      .dwcfa  0x07, 4
    1418                      .dwcfa  0x07, 5
    1419                      .dwcfa  0x08, 6
    1420                      .dwcfa  0x08, 7
    1421                      .dwcfa  0x08, 8
    1422                      .dwcfa  0x08, 9
    1423                      .dwcfa  0x08, 10
    1424                      .dwcfa  0x08, 11
    1425                      .dwcfa  0x07, 12
    1426                      .dwcfa  0x07, 13
    1427                      .dwcfa  0x07, 14
    1428                      .dwcfa  0x07, 15
    1429                      .dwcfa  0x07, 16
    1430                      .dwcfa  0x07, 17
    1431                      .dwcfa  0x07, 18
    1432                      .dwcfa  0x07, 19
    1433                      .dwcfa  0x07, 20
    1434                      .dwcfa  0x07, 21
    1435                      .dwcfa  0x07, 22
    1436                      .dwcfa  0x07, 23
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 09 16:16:05 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8722                            PAGE   30

    1437                      .dwcfa  0x07, 24
    1438                      .dwcfa  0x07, 25
    1439                      .dwcfa  0x07, 26
    1440                      .dwcfa  0x08, 27
    1441                      .dwcfa  0x07, 28
    1442                      .dwcfa  0x07, 29
    1443                      .dwcfa  0x07, 30
    1444                      .dwcfa  0x07, 31
    1445                      .dwcfa  0x07, 32
