TMS320C2000 COFF Assembler PC v4.1.3 Fri Sep 10 14:13:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0163                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Fri Sep 10 14:13:16 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("ucshell.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    2732              
    2733              
    2734              DW$T$99 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$32)
    2735                      .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
    2736                      .dwattr DW$T$99, DW_AT_byte_size(0x15)
    2737              DW$201  .dwtag  DW_TAG_subrange_type
    2738                      .dwattr DW$201, DW_AT_upper_bound(0x14)
    2739                      .dwendtag DW$T$99
    2740              
    2741              DW$T$88 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$27)
    2742                      .dwattr DW$T$88, DW_AT_language(DW_LANG_C)
    2743              
    2744              DW$T$89 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$88)
    2745                      .dwattr DW$T$89, DW_AT_language(DW_LANG_C)
    2746              DW$202  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
    2747              DW$203  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
    2748              DW$204  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
    2749                      .dwendtag DW$T$89
TMS320C2000 COFF Assembler PC v4.1.3 Fri Sep 10 14:13:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0163                            PAGE   74

    2750              
    2751              
    2752              DW$T$91 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$88)
    2753                      .dwattr DW$T$91, DW_AT_language(DW_LANG_C)
    2754              DW$205  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
    2755                      .dwendtag DW$T$91
    2756              
    2757              
    2758              DW$T$93 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$88)
    2759                      .dwattr DW$T$93, DW_AT_language(DW_LANG_C)
    2760              DW$206  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$52)
    2761              DW$207  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    2762                      .dwendtag DW$T$93
    2763              
    2764              DW$T$60 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$59)
    2765                      .dwattr DW$T$60, DW_AT_address_class(0x16)
    2766              DW$T$72 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$60)
    2767                      .dwattr DW$T$72, DW_AT_address_class(0x16)
    2768              DW$T$23 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    2769                      .dwattr DW$T$23, DW_AT_encoding(DW_ATE_signed_char)
    2770                      .dwattr DW$T$23, DW_AT_byte_size(0x01)
    2771              DW$T$50 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    2772                      .dwattr DW$T$50, DW_AT_address_class(0x16)
    2773              DW$T$85 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$84)
    2774                      .dwattr DW$T$85, DW_AT_address_class(0x16)
    2775              
    2776              DW$T$103        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    2777                      .dwattr DW$T$103, DW_AT_language(DW_LANG_C)
    2778                      .dwattr DW$T$103, DW_AT_byte_size(0x1e)
    2779              DW$208  .dwtag  DW_TAG_subrange_type
    2780                      .dwattr DW$208, DW_AT_upper_bound(0x1d)
    2781                      .dwendtag DW$T$103
    2782              
    2783              DW$T$64 .dwtag  DW_TAG_typedef, DW_AT_name("log_param"), DW_AT_type(*DW$T$26)
    2784                      .dwattr DW$T$64, DW_AT_language(DW_LANG_C)
    2785              DW$T$65 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$64)
    2786                      .dwattr DW$T$65, DW_AT_address_class(0x16)
    2787              DW$T$105        .dwtag  DW_TAG_typedef, DW_AT_name("ucshell_flag_u"), DW_AT_type(*DW$T$30)
    2788                      .dwattr DW$T$105, DW_AT_language(DW_LANG_C)
    2789              DW$T$109        .dwtag  DW_TAG_typedef, DW_AT_name("os_dirver_maneger_t"), DW_AT_type(*DW$T$49)
    2790                      .dwattr DW$T$109, DW_AT_language(DW_LANG_C)
    2791              
    2792              DW$T$112        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$111)
    2793                      .dwattr DW$T$112, DW_AT_language(DW_LANG_C)
    2794                      .dwattr DW$T$112, DW_AT_byte_size(0x30)
    2795              DW$209  .dwtag  DW_TAG_subrange_type
    2796                      .dwattr DW$209, DW_AT_upper_bound(0x07)
    2797                      .dwendtag DW$T$112
    2798              
    2799              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    2800                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2801                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    2802              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    2803                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2804                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Fri Sep 10 14:13:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0163                            PAGE   75

    2805              DW$T$59 .dwtag  DW_TAG_typedef, DW_AT_name("a_lock_t"), DW_AT_type(*DW$T$58)
    2806                      .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
    2807              DW$210  .dwtag  DW_TAG_far_type
    2808                      .dwattr DW$210, DW_AT_type(*DW$T$23)
    2809              DW$T$84 .dwtag  DW_TAG_const_type
    2810                      .dwattr DW$T$84, DW_AT_type(*DW$210)
    2811              
    2812              DW$T$26 .dwtag  DW_TAG_structure_type
    2813                      .dwattr DW$T$26, DW_AT_byte_size(0x28)
    2814              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    2815                      .dwattr DW$211, DW_AT_name("pram_buf"), DW_AT_symbol_name("_pram_buf")
    2816                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2817                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2818              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    2819                      .dwattr DW$212, DW_AT_name("cur_off"), DW_AT_symbol_name("_cur_off")
    2820                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2821                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2822              DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2823                      .dwattr DW$213, DW_AT_name("parm_0"), DW_AT_symbol_name("_parm_0")
    2824                      .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2825                      .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2826              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2827                      .dwattr DW$214, DW_AT_name("parm_1"), DW_AT_symbol_name("_parm_1")
    2828                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2829                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2830              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2831                      .dwattr DW$215, DW_AT_name("parm_2"), DW_AT_symbol_name("_parm_2")
    2832                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2833                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2834              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2835                      .dwattr DW$216, DW_AT_name("parm_3"), DW_AT_symbol_name("_parm_3")
    2836                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2837                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2838              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2839                      .dwattr DW$217, DW_AT_name("parm_4"), DW_AT_symbol_name("_parm_4")
    2840                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2841                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2842              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2843                      .dwattr DW$218, DW_AT_name("parm_5"), DW_AT_symbol_name("_parm_5")
    2844                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2845                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2846              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2847                      .dwattr DW$219, DW_AT_name("end_pram"), DW_AT_symbol_name("_end_pram")
    2848                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2849                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2850                      .dwendtag DW$T$26
    2851              
    2852              
    2853              DW$T$30 .dwtag  DW_TAG_union_type
    2854                      .dwattr DW$T$30, DW_AT_byte_size(0x01)
    2855              DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2856                      .dwattr DW$220, DW_AT_name("all_bit"), DW_AT_symbol_name("_all_bit")
    2857                      .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2858                      .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2859              DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
TMS320C2000 COFF Assembler PC v4.1.3 Fri Sep 10 14:13:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0163                            PAGE   76

    2860                      .dwattr DW$221, DW_AT_name("bit_flag"), DW_AT_symbol_name("_bit_flag")
    2861                      .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2862                      .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2863                      .dwendtag DW$T$30
    2864              
    2865              
    2866              DW$T$49 .dwtag  DW_TAG_structure_type
    2867                      .dwattr DW$T$49, DW_AT_byte_size(0x2be)
    2868              DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    2869                      .dwattr DW$222, DW_AT_name("real_size"), DW_AT_symbol_name("_real_size")
    2870                      .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2871                      .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2872              DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    2873                      .dwattr DW$223, DW_AT_name("os_driver_member"), DW_AT_symbol_name("_os_driver_member")
    2874                      .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2875                      .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2876                      .dwendtag DW$T$49
    2877              
    2878              DW$224  .dwtag  DW_TAG_far_type
    2879                      .dwattr DW$224, DW_AT_type(*DW$T$110)
    2880              DW$T$111        .dwtag  DW_TAG_const_type
    2881                      .dwattr DW$T$111, DW_AT_type(*DW$224)
    2882              DW$T$58 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    2883                      .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
    2884              
    2885              DW$T$24 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    2886                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
    2887                      .dwattr DW$T$24, DW_AT_byte_size(0x18)
    2888              DW$225  .dwtag  DW_TAG_subrange_type
    2889                      .dwattr DW$225, DW_AT_upper_bound(0x17)
    2890                      .dwendtag DW$T$24
    2891              
    2892              DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("ucshell_flag_t"), DW_AT_type(*DW$T$28)
    2893                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    2894              
    2895              DW$T$48 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$47)
    2896                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
    2897                      .dwattr DW$T$48, DW_AT_byte_size(0x2bc)
    2898              DW$226  .dwtag  DW_TAG_subrange_type
    2899                      .dwattr DW$226, DW_AT_upper_bound(0x18)
    2900                      .dwendtag DW$T$48
    2901              
    2902              DW$T$110        .dwtag  DW_TAG_typedef, DW_AT_name("ucshell_cmd_manege_t"), DW_AT_type(*DW$T$53)
    2903                      .dwattr DW$T$110, DW_AT_language(DW_LANG_C)
    2904              
    2905              DW$T$22 .dwtag  DW_TAG_structure_type
    2906                      .dwattr DW$T$22, DW_AT_name("os_event")
    2907                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    2908              DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2909                      .dwattr DW$227, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    2910                      .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2911                      .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2912              DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2913                      .dwattr DW$228, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    2914                      .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 COFF Assembler PC v4.1.3 Fri Sep 10 14:13:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0163                            PAGE   77

    2915                      .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2916              DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    2917                      .dwattr DW$229, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    2918                      .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2919                      .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2920              DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2921                      .dwattr DW$230, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    2922                      .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2923                      .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2924              DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2925                      .dwattr DW$231, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    2926                      .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2927                      .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2928                      .dwendtag DW$T$22
    2929              
    2930              
    2931              DW$T$28 .dwtag  DW_TAG_structure_type
    2932                      .dwattr DW$T$28, DW_AT_byte_size(0x01)
    2933              DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2934                      .dwattr DW$232, DW_AT_name("eff_flag"), DW_AT_symbol_name("_eff_flag")
    2935                      .dwattr DW$232, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2936                      .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2937                      .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2938              DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2939                      .dwattr DW$233, DW_AT_name("pst_flag"), DW_AT_symbol_name("_pst_flag")
    2940                      .dwattr DW$233, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2941                      .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2942                      .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2943              DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2944                      .dwattr DW$234, DW_AT_name("psd_flag"), DW_AT_symbol_name("_psd_flag")
    2945                      .dwattr DW$234, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2946                      .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2947                      .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2948              DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2949                      .dwattr DW$235, DW_AT_name("reserve_bit"), DW_AT_symbol_name("_reserve_bit")
    2950                      .dwattr DW$235, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    2951                      .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2952                      .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2953                      .dwendtag DW$T$28
    2954              
    2955              DW$T$47 .dwtag  DW_TAG_typedef, DW_AT_name("os_dirver_member_t"), DW_AT_type(*DW$T$46)
    2956                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
    2957              
    2958              DW$T$53 .dwtag  DW_TAG_structure_type
    2959                      .dwattr DW$T$53, DW_AT_byte_size(0x06)
    2960              DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    2961                      .dwattr DW$236, DW_AT_name("cmd"), DW_AT_symbol_name("_cmd")
    2962                      .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2963                      .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2964              DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    2965                      .dwattr DW$237, DW_AT_name("cmd_run_fun"), DW_AT_symbol_name("_cmd_run_fun")
    2966                      .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2967                      .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2968              DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    2969                      .dwattr DW$238, DW_AT_name("cmd_explain"), DW_AT_symbol_name("_cmd_explain")
TMS320C2000 COFF Assembler PC v4.1.3 Fri Sep 10 14:13:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0163                            PAGE   78

    2970                      .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2971                      .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2972                      .dwendtag DW$T$53
    2973              
    2974              
    2975              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    2976                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    2977                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    2978              DW$239  .dwtag  DW_TAG_subrange_type
    2979                      .dwattr DW$239, DW_AT_upper_bound(0x07)
    2980                      .dwendtag DW$T$21
    2981              
    2982              
    2983              DW$T$46 .dwtag  DW_TAG_structure_type
    2984                      .dwattr DW$T$46, DW_AT_byte_size(0x1c)
    2985              DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2986                      .dwattr DW$240, DW_AT_name("id"), DW_AT_symbol_name("_id")
    2987                      .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2988                      .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2989              DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    2990                      .dwattr DW$241, DW_AT_name("os_driver_read"), DW_AT_symbol_name("_os_driver_read")
    2991                      .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2992                      .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2993              DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    2994                      .dwattr DW$242, DW_AT_name("os_driver_write"), DW_AT_symbol_name("_os_driver_write")
    2995                      .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2996                      .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2997              DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    2998                      .dwattr DW$243, DW_AT_name("os_driver_ioctl"), DW_AT_symbol_name("_os_driver_ioctl")
    2999                      .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3000                      .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3001              DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    3002                      .dwattr DW$244, DW_AT_name("os_driver_init"), DW_AT_symbol_name("_os_driver_init")
    3003                      .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3004                      .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3005              DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    3006                      .dwattr DW$245, DW_AT_name("os_driver_uninstall"), DW_AT_symbol_name("_os_driver_uninstall")
    3007                      .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3008                      .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3009              DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    3010                      .dwattr DW$246, DW_AT_name("os_driver_name"), DW_AT_symbol_name("_os_driver_name")
    3011                      .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3012                      .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3013                      .dwendtag DW$T$46
    3014              
    3015              DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_ioctl_t"), DW_AT_type(*DW$T$39)
    3016                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
    3017              DW$T$43 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_init_t"), DW_AT_type(*DW$T$42)
    3018                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
    3019              DW$T$44 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_uninstall_t"), DW_AT_type(*DW$T$42)
    3020                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
    3021              DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("dev_id_t"), DW_AT_type(*DW$T$25)
    3022                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    3023              DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_read_t"), DW_AT_type(*DW$T$35)
    3024                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Fri Sep 10 14:13:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0163                            PAGE   79

    3025              DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_write_t"), DW_AT_type(*DW$T$35)
    3026                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    3027              
    3028              DW$T$45 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    3029                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    3030                      .dwattr DW$T$45, DW_AT_byte_size(0x0f)
    3031              DW$247  .dwtag  DW_TAG_subrange_type
    3032                      .dwattr DW$247, DW_AT_upper_bound(0x0e)
    3033                      .dwendtag DW$T$45
    3034              
    3035              DW$T$39 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
    3036                      .dwattr DW$T$39, DW_AT_address_class(0x16)
    3037              DW$T$42 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$41)
    3038                      .dwattr DW$T$42, DW_AT_address_class(0x16)
    3039              DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
    3040                      .dwattr DW$T$35, DW_AT_address_class(0x16)
    3041              
    3042              DW$T$38 .dwtag  DW_TAG_subroutine_type
    3043                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    3044              DW$248  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    3045              DW$249  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    3046                      .dwendtag DW$T$38
    3047              
    3048              
    3049              DW$T$34 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$32)
    3050                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    3051              DW$250  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
    3052              DW$251  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
    3053              DW$252  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    3054                      .dwendtag DW$T$34
    3055              
    3056              
    3057                      .dwattr DW$70, DW_AT_external(0x01)
    3058                      .dwattr DW$115, DW_AT_external(0x01)
    3059                      .dwattr DW$57, DW_AT_external(0x01)
    3060                      .dwattr DW$135, DW_AT_external(0x01)
    3061                      .dwattr DW$124, DW_AT_external(0x01)
    3062                      .dwattr DW$98, DW_AT_external(0x01)
    3063                      .dwattr DW$141, DW_AT_external(0x01)
    3064                      .dwattr DW$121, DW_AT_external(0x01)
    3065                      .dwattr DW$86, DW_AT_external(0x01)
    3066                      .dwattr DW$118, DW_AT_external(0x01)
