TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8002                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Mon May 09 17:05:30 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("os_cpu_c.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("timer_jiffies_add"), DW_AT_symbol_name("_timer_jiffies_add")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)

     961                      .dwattr DW$39, DW_AT_low_pc(_App_TimeTickHook)
     962                      .dwattr DW$39, DW_AT_high_pc(0x00)
     963                      .dwattr DW$39, DW_AT_begin_file("os_cpu_c.c")
     964                      .dwattr DW$39, DW_AT_begin_line(0xbe)
     965                      .dwattr DW$39, DW_AT_begin_column(0x06)
     966                      .dwpsn  "os_cpu_c.c",191,1
     967              
     968                      .dwfde DW$CIE
     969              
     970              ;***************************************************************
     971              ;* FNAME: _App_TimeTickHook             FR SIZE:   0           *
     972              ;*                                                             *
     973              ;* FUNCTION ENVIRONMENT                                        *
     974              ;*                                                             *
     975              ;* FUNCTION PROPERTIES                                         *
     976              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     977              ;***************************************************************
     978              
     979              _App_TimeTickHook:
     980                      .dwcfa  0x1d, -2
     981                      .dwcfa  0x1c, 26, 0
     982                      .dwcfa  0x09, 40, 26
     983                      .dwpsn  "os_cpu_c.c",192,1
     984 00000104 0006          LRETR
     985                      ; return occurs
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8002                            PAGE   19

     986                      .dwattr DW$39, DW_AT_end_file("os_cpu_c.c")
     987                      .dwattr DW$39, DW_AT_end_line(0xc0)
     988                      .dwattr DW$39, DW_AT_end_column(0x01)
     989                      .dwendentry
     990                      .dwendtag DW$39
     991              
     992              ;***************************************************************
     993              ;* UNDEFINED EXTERNAL REFERENCES                               *
     994              ;***************************************************************
     995                      .global _timer_jiffies_add
     996              
     997              ;***************************************************************
     998              ;* TYPE INFORMATION                                            *
     999              ;***************************************************************
    1000              DW$T$3  .dwtag  DW_TAG_pointer_type
    1001                      .dwattr DW$T$3, DW_AT_address_class(0x16)
    1002              
    1003              DW$T$31 .dwtag  DW_TAG_subroutine_type
    1004                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    1005              DW$T$34 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
    1006                      .dwattr DW$T$34, DW_AT_address_class(0x16)
    1007              
    1008              DW$T$37 .dwtag  DW_TAG_subroutine_type
    1009                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    1010              DW$40   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
    1011                      .dwendtag DW$T$37
    1012              
    1013              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
    1014                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    1015              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("OS_STK"), DW_AT_type(*DW$T$11)
    1016                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    1017              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    1018                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    1019              
    1020              DW$T$38 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
    1021                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    1022              DW$41   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
    1023              DW$42   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1024              DW$43   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
    1025              DW$44   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
    1026                      .dwendtag DW$T$38
    1027              
    1028              DW$T$36 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
    1029                      .dwattr DW$T$36, DW_AT_address_class(0x16)
    1030              
    1031              DW$T$33 .dwtag  DW_TAG_subroutine_type
    1032                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    1033              DW$45   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1034                      .dwendtag DW$T$33
    1035              
    1036              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1037                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1038                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1039              DW$T$35 .dwtag  DW_TAG_typedef, DW_AT_name("OS_TCB"), DW_AT_type(*DW$T$30)
    1040                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8002                            PAGE   20

    1041              
    1042              DW$T$30 .dwtag  DW_TAG_structure_type
    1043                      .dwattr DW$T$30, DW_AT_name("os_tcb")
    1044                      .dwattr DW$T$30, DW_AT_byte_size(0x34)
    1045              DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1046                      .dwattr DW$46, DW_AT_name("OSTCBStkPtr"), DW_AT_symbol_name("_OSTCBStkPtr")
    1047                      .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1048                      .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1049              DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1050                      .dwattr DW$47, DW_AT_name("OSTCBExtPtr"), DW_AT_symbol_name("_OSTCBExtPtr")
    1051                      .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1052                      .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1053              DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1054                      .dwattr DW$48, DW_AT_name("OSTCBStkBottom"), DW_AT_symbol_name("_OSTCBStkBottom")
    1055                      .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1056                      .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1057              DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1058                      .dwattr DW$49, DW_AT_name("OSTCBStkSize"), DW_AT_symbol_name("_OSTCBStkSize")
    1059                      .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1060                      .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1061              DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1062                      .dwattr DW$50, DW_AT_name("OSTCBOpt"), DW_AT_symbol_name("_OSTCBOpt")
    1063                      .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1064                      .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1065              DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1066                      .dwattr DW$51, DW_AT_name("OSTCBId"), DW_AT_symbol_name("_OSTCBId")
    1067                      .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1068                      .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1069              DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1070                      .dwattr DW$52, DW_AT_name("OSTCBNext"), DW_AT_symbol_name("_OSTCBNext")
    1071                      .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1072                      .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1073              DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1074                      .dwattr DW$53, DW_AT_name("OSTCBPrev"), DW_AT_symbol_name("_OSTCBPrev")
    1075                      .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1076                      .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1077              DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1078                      .dwattr DW$54, DW_AT_name("OSTCBEventPtr"), DW_AT_symbol_name("_OSTCBEventPtr")
    1079                      .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1080                      .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1081              DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1082                      .dwattr DW$55, DW_AT_name("OSTCBMsg"), DW_AT_symbol_name("_OSTCBMsg")
    1083                      .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1084                      .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1085              DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1086                      .dwattr DW$56, DW_AT_name("OSTCBDly"), DW_AT_symbol_name("_OSTCBDly")
    1087                      .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1088                      .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1089              DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1090                      .dwattr DW$57, DW_AT_name("OSTCBStat"), DW_AT_symbol_name("_OSTCBStat")
    1091                      .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1092                      .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1093              DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1094                      .dwattr DW$58, DW_AT_name("OSTCBStatPend"), DW_AT_symbol_name("_OSTCBStatPend")
    1095                      .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8002                            PAGE   21

    1096                      .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1097              DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1098                      .dwattr DW$59, DW_AT_name("OSTCBPrio"), DW_AT_symbol_name("_OSTCBPrio")
    1099                      .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1100                      .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1101              DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1102                      .dwattr DW$60, DW_AT_name("OSTCBX"), DW_AT_symbol_name("_OSTCBX")
    1103                      .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1104                      .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1105              DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1106                      .dwattr DW$61, DW_AT_name("OSTCBY"), DW_AT_symbol_name("_OSTCBY")
    1107                      .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1108                      .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1109              DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1110                      .dwattr DW$62, DW_AT_name("OSTCBBitX"), DW_AT_symbol_name("_OSTCBBitX")
    1111                      .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1112                      .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1113              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1114                      .dwattr DW$63, DW_AT_name("OSTCBBitY"), DW_AT_symbol_name("_OSTCBBitY")
    1115                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1116                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1117              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1118                      .dwattr DW$64, DW_AT_name("OSTCBDelReq"), DW_AT_symbol_name("_OSTCBDelReq")
    1119                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1120                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1121              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1122                      .dwattr DW$65, DW_AT_name("OSTCBTaskName"), DW_AT_symbol_name("_OSTCBTaskName")
    1123                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1124                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1125                      .dwendtag DW$T$30
    1126              
    1127              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
    1128                      .dwattr DW$T$26, DW_AT_address_class(0x16)
    1129              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
    1130                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    1131              
    1132              DW$T$29 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    1133                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    1134                      .dwattr DW$T$29, DW_AT_byte_size(0x19)
    1135              DW$66   .dwtag  DW_TAG_subrange_type
    1136                      .dwattr DW$66, DW_AT_upper_bound(0x18)
    1137                      .dwendtag DW$T$29
    1138              
    1139              DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("INT32U"), DW_AT_type(*DW$T$13)
    1140                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    1141              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
    1142                      .dwattr DW$T$28, DW_AT_address_class(0x16)
    1143              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1144                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1145                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1146              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    1147                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1148                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    1149              DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    1150                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8002                            PAGE   22

    1151              
    1152              DW$T$22 .dwtag  DW_TAG_structure_type
    1153                      .dwattr DW$T$22, DW_AT_name("os_event")
    1154                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    1155              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1156                      .dwattr DW$67, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    1157                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1158                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1159              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1160                      .dwattr DW$68, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    1161                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1162                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1163              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1164                      .dwattr DW$69, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    1165                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1166                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1167              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1168                      .dwattr DW$70, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    1169                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1170                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1171              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1172                      .dwattr DW$71, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    1173                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1174                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1175                      .dwendtag DW$T$22
    1176              
    1177              
    1178              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    1179                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    1180                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    1181              DW$72   .dwtag  DW_TAG_subrange_type
    1182                      .dwattr DW$72, DW_AT_upper_bound(0x07)
    1183                      .dwendtag DW$T$21
    1184              
    1185              
    1186                      .dwattr DW$36, DW_AT_external(0x01)
    1187                      .dwattr DW$27, DW_AT_external(0x01)
    1188                      .dwattr DW$30, DW_AT_external(0x01)
    1189                      .dwattr DW$33, DW_AT_external(0x01)
    1190                      .dwattr DW$34, DW_AT_external(0x01)
    1191                      .dwattr DW$35, DW_AT_external(0x01)
    1192                      .dwattr DW$39, DW_AT_external(0x01)
    1193                      .dwattr DW$12, DW_AT_external(0x01)
    1194                      .dwattr DW$13, DW_AT_external(0x01)
    1195                      .dwattr DW$23, DW_AT_external(0x01)
    1196                      .dwattr DW$14, DW_AT_external(0x01)
    1197                      .dwattr DW$17, DW_AT_external(0x01)
    1198                      .dwattr DW$20, DW_AT_external(0x01)
    1199                      .dwattr DW$22, DW_AT_external(0x01)
    1200                      .dwattr DW$21, DW_AT_external(0x01)
    1201                      .dwattr DW$2, DW_AT_external(0x01)
    1202                      .dwattr DW$2, DW_AT_type(*DW$T$24)
    1203                      .dwattr DW$26, DW_AT_external(0x01)
    1204                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1205              
TMS320C2000 COFF Assembler PC v4.1.3 Mon May 09 17:05:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8002                            PAGE   23

    1206              ;***************************************************************
    1207              ;* DWARF CIE ENTRIES                                           *
    1208              ;***************************************************************
    1209              
    1210              DW$CIE  .dwcie 1, 40
    1211                      .dwcfa  0x0c, 20, 0
    1212                      .dwcfa  0x07, 0
    1213                      .dwcfa  0x07, 1
    1214                      .dwcfa  0x07, 2
    1215                      .dwcfa  0x07, 3
    1216                      .dwcfa  0x07, 4
    1217                      .dwcfa  0x07, 5
    1218                      .dwcfa  0x08, 6
    1219                      .dwcfa  0x08, 7
    1220                      .dwcfa  0x08, 8
    1221                      .dwcfa  0x08, 9
    1222                      .dwcfa  0x08, 10
    1223                      .dwcfa  0x08, 11
    1224                      .dwcfa  0x07, 12
    1225                      .dwcfa  0x07, 13
    1226                      .dwcfa  0x07, 14
    1227                      .dwcfa  0x07, 15
    1228                      .dwcfa  0x07, 16
    1229                      .dwcfa  0x07, 17
    1230                      .dwcfa  0x07, 18
    1231                      .dwcfa  0x07, 19
    1232                      .dwcfa  0x07, 20
    1233                      .dwcfa  0x07, 21
    1234                      .dwcfa  0x07, 22
    1235                      .dwcfa  0x07, 23
    1236                      .dwcfa  0x07, 24
    1237                      .dwcfa  0x07, 25
    1238                      .dwcfa  0x07, 26
    1239                      .dwcfa  0x08, 27
    1240                      .dwcfa  0x07, 28
    1241                      .dwcfa  0x07, 29
    1242                      .dwcfa  0x07, 30
