TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 13 14:28:00 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1962                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Sep 13 14:28:00 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("os_connect.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    5313                      .dwattr DW$T$74, DW_AT_address_class(0x16)
    5314              DW$T$112        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$111)
    5315                      .dwattr DW$T$112, DW_AT_address_class(0x16)
    5316              DW$T$113        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$112)
    5317                      .dwattr DW$T$113, DW_AT_address_class(0x16)
    5318              DW$T$131        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$130)
    5319                      .dwattr DW$T$131, DW_AT_address_class(0x16)
    5320              DW$T$142        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$48)
    5321                      .dwattr DW$T$142, DW_AT_address_class(0x16)
    5322              DW$T$160        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$159)
    5323                      .dwattr DW$T$160, DW_AT_address_class(0x16)
    5324              
    5325              DW$T$161        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$160)
    5326                      .dwattr DW$T$161, DW_AT_language(DW_LANG_C)
    5327              
    5328              DW$T$163        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$159)
    5329                      .dwattr DW$T$163, DW_AT_language(DW_LANG_C)
    5330                      .dwattr DW$T$163, DW_AT_byte_size(0x0c)
    5331              DW$448  .dwtag  DW_TAG_subrange_type
    5332                      .dwattr DW$448, DW_AT_upper_bound(0x02)
    5333                      .dwendtag DW$T$163
    5334              
    5335              DW$T$88 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
    5336                      .dwattr DW$T$88, DW_AT_address_class(0x16)
    5337              
    5338              DW$T$151        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$88)
    5339                      .dwattr DW$T$151, DW_AT_language(DW_LANG_C)
    5340              DW$449  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$88)
    5341              DW$450  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$88)
    5342                      .dwendtag DW$T$151
    5343              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 13 14:28:00 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1962                            PAGE  103

    5344              
    5345              DW$T$154        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$42)
    5346                      .dwattr DW$T$154, DW_AT_language(DW_LANG_C)
    5347                      .dwattr DW$T$154, DW_AT_byte_size(0x14)
    5348              DW$451  .dwtag  DW_TAG_subrange_type
    5349                      .dwattr DW$451, DW_AT_upper_bound(0x13)
    5350                      .dwendtag DW$T$154
    5351              
    5352              
    5353              DW$T$156        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$42)
    5354                      .dwattr DW$T$156, DW_AT_language(DW_LANG_C)
    5355                      .dwattr DW$T$156, DW_AT_byte_size(0x0c)
    5356              DW$452  .dwtag  DW_TAG_subrange_type
    5357                      .dwattr DW$452, DW_AT_upper_bound(0x0b)
    5358                      .dwendtag DW$T$156
    5359              
    5360              DW$T$167        .dwtag  DW_TAG_typedef, DW_AT_name("os_dirver_maneger_t"), DW_AT_type(*DW$T$47)
    5361                      .dwattr DW$T$167, DW_AT_language(DW_LANG_C)
    5362              DW$T$169        .dwtag  DW_TAG_typedef, DW_AT_name("app_mod_maneger_t"), DW_AT_type(*DW$T$50)
    5363                      .dwattr DW$T$169, DW_AT_language(DW_LANG_C)
    5364              DW$T$120        .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$6)
    5365                      .dwattr DW$T$120, DW_AT_language(DW_LANG_C)
    5366              DW$T$99 .dwtag  DW_TAG_typedef, DW_AT_name("OS_STK"), DW_AT_type(*DW$T$11)
    5367                      .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
    5368              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    5369                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    5370                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    5371              DW$T$52 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    5372                      .dwattr DW$T$52, DW_AT_language(DW_LANG_C)
    5373              DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("a_lock_t"), DW_AT_type(*DW$T$52)
    5374                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    5375              DW$T$72 .dwtag  DW_TAG_typedef, DW_AT_name("a_q_t"), DW_AT_type(*DW$T$52)
    5376                      .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
    5377              DW$T$111        .dwtag  DW_TAG_typedef, DW_AT_name("a_sem_t"), DW_AT_type(*DW$T$52)
    5378                      .dwattr DW$T$111, DW_AT_language(DW_LANG_C)
    5379              DW$T$130        .dwtag  DW_TAG_typedef, DW_AT_name("os_dirver_operate_t"), DW_AT_type(*DW$T$36)
    5380                      .dwattr DW$T$130, DW_AT_language(DW_LANG_C)
    5381              DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("app_mod_inlet_t"), DW_AT_type(*DW$T$39)
    5382                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
    5383              DW$T$159        .dwtag  DW_TAG_typedef, DW_AT_name("app_mod_handle_msg_t"), DW_AT_type(*DW$T$40)
    5384                      .dwattr DW$T$159, DW_AT_language(DW_LANG_C)
    5385              DW$T$42 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    5386                      .dwattr DW$T$42, DW_AT_encoding(DW_ATE_signed_char)
    5387                      .dwattr DW$T$42, DW_AT_byte_size(0x01)
    5388              
    5389              DW$T$47 .dwtag  DW_TAG_structure_type
    5390                      .dwattr DW$T$47, DW_AT_byte_size(0x2be)
    5391              DW$453  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    5392                      .dwattr DW$453, DW_AT_name("real_size"), DW_AT_symbol_name("_real_size")
    5393                      .dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5394                      .dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
    5395              DW$454  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    5396                      .dwattr DW$454, DW_AT_name("os_driver_member"), DW_AT_symbol_name("_os_driver_member")
    5397                      .dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5398                      .dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 13 14:28:00 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1962                            PAGE  104

    5399                      .dwendtag DW$T$47
    5400              
    5401              
    5402              DW$T$50 .dwtag  DW_TAG_structure_type
    5403                      .dwattr DW$T$50, DW_AT_byte_size(0x5c)
    5404              DW$455  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    5405                      .dwattr DW$455, DW_AT_name("real_mod_num"), DW_AT_symbol_name("_real_mod_num")
    5406                      .dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5407                      .dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
    5408              DW$456  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    5409                      .dwattr DW$456, DW_AT_name("mod_inlet_list"), DW_AT_symbol_name("_mod_inlet_list")
    5410                      .dwattr DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5411                      .dwattr DW$456, DW_AT_accessibility(DW_ACCESS_public)
    5412                      .dwendtag DW$T$50
    5413              
    5414              
    5415              DW$T$22 .dwtag  DW_TAG_structure_type
    5416                      .dwattr DW$T$22, DW_AT_name("os_event")
    5417                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    5418              DW$457  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5419                      .dwattr DW$457, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    5420                      .dwattr DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5421                      .dwattr DW$457, DW_AT_accessibility(DW_ACCESS_public)
    5422              DW$458  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    5423                      .dwattr DW$458, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    5424                      .dwattr DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5425                      .dwattr DW$458, DW_AT_accessibility(DW_ACCESS_public)
    5426              DW$459  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    5427                      .dwattr DW$459, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    5428                      .dwattr DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5429                      .dwattr DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5430              DW$460  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5431                      .dwattr DW$460, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    5432                      .dwattr DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5433                      .dwattr DW$460, DW_AT_accessibility(DW_ACCESS_public)
    5434              DW$461  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    5435                      .dwattr DW$461, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    5436                      .dwattr DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5437                      .dwattr DW$461, DW_AT_accessibility(DW_ACCESS_public)
    5438                      .dwendtag DW$T$22
    5439              
    5440              
    5441              DW$T$36 .dwtag  DW_TAG_structure_type
    5442                      .dwattr DW$T$36, DW_AT_byte_size(0x0a)
    5443              DW$462  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    5444                      .dwattr DW$462, DW_AT_name("os_driver_read"), DW_AT_symbol_name("_os_driver_read")
    5445                      .dwattr DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5446                      .dwattr DW$462, DW_AT_accessibility(DW_ACCESS_public)
    5447              DW$463  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    5448                      .dwattr DW$463, DW_AT_name("os_driver_write"), DW_AT_symbol_name("_os_driver_write")
    5449                      .dwattr DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5450                      .dwattr DW$463, DW_AT_accessibility(DW_ACCESS_public)
    5451              DW$464  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5452                      .dwattr DW$464, DW_AT_name("os_driver_ioctl"), DW_AT_symbol_name("_os_driver_ioctl")
    5453                      .dwattr DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 13 14:28:00 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1962                            PAGE  105

    5454                      .dwattr DW$464, DW_AT_accessibility(DW_ACCESS_public)
    5455              DW$465  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    5456                      .dwattr DW$465, DW_AT_name("os_driver_init"), DW_AT_symbol_name("_os_driver_init")
    5457                      .dwattr DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5458                      .dwattr DW$465, DW_AT_accessibility(DW_ACCESS_public)
    5459              DW$466  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    5460                      .dwattr DW$466, DW_AT_name("os_driver_uninstall"), DW_AT_symbol_name("_os_driver_uninstall")
    5461                      .dwattr DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5462                      .dwattr DW$466, DW_AT_accessibility(DW_ACCESS_public)
    5463                      .dwendtag DW$T$36
    5464              
    5465              
    5466              DW$T$39 .dwtag  DW_TAG_structure_type
    5467                      .dwattr DW$T$39, DW_AT_byte_size(0x06)
    5468              DW$467  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    5469                      .dwattr DW$467, DW_AT_name("mod_id"), DW_AT_symbol_name("_mod_id")
    5470                      .dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5471                      .dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
    5472              DW$468  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    5473                      .dwattr DW$468, DW_AT_name("insmod_fun"), DW_AT_symbol_name("_insmod_fun")
    5474                      .dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5475                      .dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
    5476              DW$469  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    5477                      .dwattr DW$469, DW_AT_name("exitmod_fun"), DW_AT_symbol_name("_exitmod_fun")
    5478                      .dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5479                      .dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
    5480                      .dwendtag DW$T$39
    5481              
    5482              
    5483              DW$T$49 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$48)
    5484                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
    5485                      .dwattr DW$T$49, DW_AT_byte_size(0x5a)
    5486              DW$470  .dwtag  DW_TAG_subrange_type
    5487                      .dwattr DW$470, DW_AT_upper_bound(0x0e)
    5488                      .dwendtag DW$T$49
    5489              
    5490              
    5491              DW$T$40 .dwtag  DW_TAG_structure_type
    5492                      .dwattr DW$T$40, DW_AT_byte_size(0x04)
    5493              DW$471  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    5494                      .dwattr DW$471, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    5495                      .dwattr DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5496                      .dwattr DW$471, DW_AT_accessibility(DW_ACCESS_public)
    5497              DW$472  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    5498                      .dwattr DW$472, DW_AT_name("msg_type"), DW_AT_symbol_name("_msg_type")
    5499                      .dwattr DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5500                      .dwattr DW$472, DW_AT_accessibility(DW_ACCESS_public)
    5501              DW$473  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    5502                      .dwattr DW$473, DW_AT_name("start_mod_id"), DW_AT_symbol_name("_start_mod_id")
    5503                      .dwattr DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5504                      .dwattr DW$473, DW_AT_accessibility(DW_ACCESS_public)
    5505              DW$474  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    5506                      .dwattr DW$474, DW_AT_name("stop_mod_id"), DW_AT_symbol_name("_stop_mod_id")
    5507                      .dwattr DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5508                      .dwattr DW$474, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 13 14:28:00 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1962                            PAGE  106

    5509                      .dwendtag DW$T$40
    5510              
    5511              
    5512              DW$T$46 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$45)
    5513                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
    5514                      .dwattr DW$T$46, DW_AT_byte_size(0x2bc)
    5515              DW$475  .dwtag  DW_TAG_subrange_type
    5516                      .dwattr DW$475, DW_AT_upper_bound(0x18)
    5517                      .dwendtag DW$T$46
    5518              
    5519              DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_ioctl_t"), DW_AT_type(*DW$T$30)
    5520                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    5521              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_init_t"), DW_AT_type(*DW$T$33)
    5522                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    5523              DW$T$35 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_uninstall_t"), DW_AT_type(*DW$T$33)
    5524                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
    5525              DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("app_insmod_t"), DW_AT_type(*DW$T$33)
    5526                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    5527              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("app_exitmod_t"), DW_AT_type(*DW$T$33)
    5528                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    5529              
    5530              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    5531                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    5532                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    5533              DW$476  .dwtag  DW_TAG_subrange_type
    5534                      .dwattr DW$476, DW_AT_upper_bound(0x07)
    5535                      .dwendtag DW$T$21
    5536              
    5537              DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_read_t"), DW_AT_type(*DW$T$26)
    5538                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    5539              DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_write_t"), DW_AT_type(*DW$T$26)
    5540                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    5541              DW$T$45 .dwtag  DW_TAG_typedef, DW_AT_name("os_dirver_member_t"), DW_AT_type(*DW$T$44)
    5542                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    5543              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    5544                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    5545              DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    5546                      .dwattr DW$T$33, DW_AT_address_class(0x16)
    5547              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    5548                      .dwattr DW$T$26, DW_AT_address_class(0x16)
    5549              
    5550              DW$T$44 .dwtag  DW_TAG_structure_type
    5551                      .dwattr DW$T$44, DW_AT_byte_size(0x1c)
    5552              DW$477  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    5553                      .dwattr DW$477, DW_AT_name("id"), DW_AT_symbol_name("_id")
    5554                      .dwattr DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5555                      .dwattr DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5556              DW$478  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    5557                      .dwattr DW$478, DW_AT_name("os_driver_read"), DW_AT_symbol_name("_os_driver_read")
    5558                      .dwattr DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5559                      .dwattr DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5560              DW$479  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    5561                      .dwattr DW$479, DW_AT_name("os_driver_write"), DW_AT_symbol_name("_os_driver_write")
    5562                      .dwattr DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5563                      .dwattr DW$479, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 13 14:28:00 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1962                            PAGE  107

    5564              DW$480  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    5565                      .dwattr DW$480, DW_AT_name("os_driver_ioctl"), DW_AT_symbol_name("_os_driver_ioctl")
    5566                      .dwattr DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5567                      .dwattr DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5568              DW$481  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    5569                      .dwattr DW$481, DW_AT_name("os_driver_init"), DW_AT_symbol_name("_os_driver_init")
    5570                      .dwattr DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5571                      .dwattr DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5572              DW$482  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    5573                      .dwattr DW$482, DW_AT_name("os_driver_uninstall"), DW_AT_symbol_name("_os_driver_uninstall")
    5574                      .dwattr DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5575                      .dwattr DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5576              DW$483  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    5577                      .dwattr DW$483, DW_AT_name("os_driver_name"), DW_AT_symbol_name("_os_driver_name")
    5578                      .dwattr DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5579                      .dwattr DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5580                      .dwendtag DW$T$44
    5581              
    5582              
    5583              DW$T$29 .dwtag  DW_TAG_subroutine_type
    5584                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    5585              DW$484  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    5586              DW$485  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    5587                      .dwendtag DW$T$29
    5588              
    5589              
    5590              DW$T$25 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
    5591                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    5592              DW$486  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
    5593              DW$487  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
    5594              DW$488  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    5595                      .dwendtag DW$T$25
    5596              
    5597              
    5598              DW$T$43 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$42)
    5599                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
    5600                      .dwattr DW$T$43, DW_AT_byte_size(0x0f)
    5601              DW$489  .dwtag  DW_TAG_subrange_type
    5602                      .dwattr DW$489, DW_AT_upper_bound(0x0e)
    5603                      .dwendtag DW$T$43
    5604              
    5605              
    5606                      .dwattr DW$229, DW_AT_external(0x01)
    5607                      .dwattr DW$229, DW_AT_type(*DW$T$23)
    5608                      .dwattr DW$260, DW_AT_external(0x01)
    5609                      .dwattr DW$238, DW_AT_external(0x01)
    5610                      .dwattr DW$219, DW_AT_external(0x01)
    5611                      .dwattr DW$289, DW_AT_external(0x01)
    5612                      .dwattr DW$289, DW_AT_type(*DW$T$23)
    5613                      .dwattr DW$290, DW_AT_external(0x01)
    5614                      .dwattr DW$290, DW_AT_type(*DW$T$23)
    5615                      .dwattr DW$242, DW_AT_external(0x01)
    5616                      .dwattr DW$242, DW_AT_type(*DW$T$160)
    5617                      .dwattr DW$291, DW_AT_external(0x01)
    5618                      .dwattr DW$291, DW_AT_type(*DW$T$23)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 13 14:28:00 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1962                            PAGE  108

    5619                      .dwattr DW$263, DW_AT_external(0x01)
    5620                      .dwattr DW$288, DW_AT_external(0x01)
    5621                      .dwattr DW$285, DW_AT_external(0x01)
    5622                      .dwattr DW$285, DW_AT_type(*DW$T$23)
    5623                      .dwattr DW$282, DW_AT_external(0x01)
    5624                      .dwattr DW$247, DW_AT_external(0x01)
    5625                      .dwattr DW$215, DW_AT_external(0x01)
    5626                      .dwattr DW$209, DW_AT_external(0x01)
    5627                      .dwattr DW$266, DW_AT_external(0x01)
    5628                      .dwattr DW$212, DW_AT_external(0x01)
    5629                      .dwattr DW$223, DW_AT_external(0x01)
    5630                      .dwattr DW$259, DW_AT_external(0x01)
    5631                      .dwattr DW$164, DW_AT_external(0x01)
    5632                      .dwattr DW$165, DW_AT_external(0x01)
    5633                      .dwattr DW$165, DW_AT_type(*DW$T$41)
    5634                      .dwattr DW$174, DW_AT_external(0x01)
    5635                      .dwattr DW$180, DW_AT_external(0x01)
    5636                      .dwattr DW$201, DW_AT_external(0x01)
    5637                      .dwattr DW$208, DW_AT_external(0x01)
    5638                      .dwattr DW$183, DW_AT_external(0x01)
