TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Sep 15 15:05:06 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_WIRmod_fun.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    3618              DW$T$131        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$52)
    3619                      .dwattr DW$T$131, DW_AT_language(DW_LANG_C)
    3620              DW$256  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$52)
    3621              DW$257  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$52)
    3622                      .dwendtag DW$T$131
    3623              
    3624              DW$T$138        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$137)
    3625                      .dwattr DW$T$138, DW_AT_address_class(0x16)
    3626              
    3627              DW$T$146        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$29)
    3628                      .dwattr DW$T$146, DW_AT_language(DW_LANG_C)
    3629                      .dwattr DW$T$146, DW_AT_byte_size(0x06)
    3630              DW$258  .dwtag  DW_TAG_subrange_type
    3631                      .dwattr DW$258, DW_AT_upper_bound(0x05)
    3632                      .dwendtag DW$T$146
    3633              
    3634              DW$T$75 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$74)
    3635                      .dwattr DW$T$75, DW_AT_address_class(0x16)
    3636              DW$T$153        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$152)
    3637                      .dwattr DW$T$153, DW_AT_address_class(0x16)
    3638              DW$T$83 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$82)
    3639                      .dwattr DW$T$83, DW_AT_address_class(0x16)
    3640              DW$T$86 .dwtag  DW_TAG_typedef, DW_AT_name("WIRresult_t"), DW_AT_type(*DW$T$50)
    3641                      .dwattr DW$T$86, DW_AT_language(DW_LANG_C)
    3642              DW$T$87 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$86)
    3643                      .dwattr DW$T$87, DW_AT_address_class(0x16)
    3644              DW$T$160        .dwtag  DW_TAG_typedef, DW_AT_name("module_id_t"), DW_AT_type(*DW$T$51)
    3645                      .dwattr DW$T$160, DW_AT_language(DW_LANG_C)
    3646              
    3647              DW$T$163        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$162)
    3648                      .dwattr DW$T$163, DW_AT_language(DW_LANG_C)
    3649                      .dwattr DW$T$163, DW_AT_byte_size(0x18)
    3650              DW$259  .dwtag  DW_TAG_subrange_type
    3651                      .dwattr DW$259, DW_AT_upper_bound(0x05)
    3652                      .dwendtag DW$T$163
    3653              
    3654              DW$T$151        .dwtag  DW_TAG_typedef, DW_AT_name("FRESULT"), DW_AT_type(*DW$T$150)
    3655                      .dwattr DW$T$151, DW_AT_language(DW_LANG_C)
    3656              
    3657              DW$T$154        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$151)
    3658                      .dwattr DW$T$154, DW_AT_language(DW_LANG_C)
    3659              DW$260  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$153)
    3660              DW$261  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$138)
    3661              DW$262  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
    3662                      .dwendtag DW$T$154
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   76

    3663              
    3664              
    3665              DW$T$156        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$151)
    3666                      .dwattr DW$T$156, DW_AT_language(DW_LANG_C)
    3667              DW$263  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$153)
    3668                      .dwendtag DW$T$156
    3669              
    3670              
    3671              DW$T$158        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$151)
    3672                      .dwattr DW$T$158, DW_AT_language(DW_LANG_C)
    3673              DW$264  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$153)
    3674              DW$265  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$81)
    3675              DW$266  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$127)
    3676              DW$267  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$128)
    3677                      .dwendtag DW$T$158
    3678              
    3679              DW$268  .dwtag  DW_TAG_far_type
    3680              DW$T$80 .dwtag  DW_TAG_const_type
    3681                      .dwattr DW$T$80, DW_AT_type(*DW$268)
    3682              DW$T$99 .dwtag  DW_TAG_typedef, DW_AT_name("a_sem_t"), DW_AT_type(*DW$T$98)
    3683                      .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
    3684              DW$269  .dwtag  DW_TAG_far_type
    3685                      .dwattr DW$269, DW_AT_type(*DW$T$29)
    3686              DW$T$33 .dwtag  DW_TAG_const_type
    3687                      .dwattr DW$T$33, DW_AT_type(*DW$269)
    3688              DW$270  .dwtag  DW_TAG_far_type
    3689                      .dwattr DW$270, DW_AT_type(*DW$T$136)
    3690              DW$T$137        .dwtag  DW_TAG_const_type
    3691                      .dwattr DW$T$137, DW_AT_type(*DW$270)
    3692              DW$T$74 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$36)
    3693                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    3694              DW$T$152        .dwtag  DW_TAG_typedef, DW_AT_name("FIL"), DW_AT_type(*DW$T$45)
    3695                      .dwattr DW$T$152, DW_AT_language(DW_LANG_C)
    3696              DW$T$82 .dwtag  DW_TAG_typedef, DW_AT_name("WIR_ALG_t"), DW_AT_type(*DW$T$47)
    3697                      .dwattr DW$T$82, DW_AT_language(DW_LANG_C)
    3698              
    3699              DW$T$50 .dwtag  DW_TAG_structure_type
    3700                      .dwattr DW$T$50, DW_AT_byte_size(0x19)
    3701              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    3702                      .dwattr DW$271, DW_AT_name("Result_MUa"), DW_AT_symbol_name("_Result_MUa")
    3703                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3704                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3705              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    3706                      .dwattr DW$272, DW_AT_name("Result_MUb"), DW_AT_symbol_name("_Result_MUb")
    3707                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3708                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3709              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    3710                      .dwattr DW$273, DW_AT_name("Result_MUc"), DW_AT_symbol_name("_Result_MUc")
    3711                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3712                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3713              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    3714                      .dwattr DW$274, DW_AT_name("Result_MIa"), DW_AT_symbol_name("_Result_MIa")
    3715                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3716                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3717              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   77

    3718                      .dwattr DW$275, DW_AT_name("Result_MIb"), DW_AT_symbol_name("_Result_MIb")
    3719                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3720                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3721              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    3722                      .dwattr DW$276, DW_AT_name("Result_MIc"), DW_AT_symbol_name("_Result_MIc")
    3723                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3724                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3725              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3726                      .dwattr DW$277, DW_AT_name("phaseDir"), DW_AT_symbol_name("_phaseDir")
    3727                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3728                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3729              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3730                      .dwattr DW$278, DW_AT_name("verdict"), DW_AT_symbol_name("_verdict")
    3731                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3732                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3733              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3734                      .dwattr DW$279, DW_AT_name("jxmod"), DW_AT_symbol_name("_jxmod")
    3735                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3736                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3737              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3738                      .dwattr DW$280, DW_AT_name("WIR_cosoffset"), DW_AT_symbol_name("_WIR_cosoffset")
    3739                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3740                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3741                      .dwendtag DW$T$50
    3742              
    3743              
    3744              DW$T$51 .dwtag  DW_TAG_structure_type
    3745                      .dwattr DW$T$51, DW_AT_byte_size(0x0e)
    3746              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3747                      .dwattr DW$281, DW_AT_name("DL_measure_mod_id"), DW_AT_symbol_name("_DL_measure_mod_id")
    3748                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3749                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3750              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3751                      .dwattr DW$282, DW_AT_name("Sys_setup_mod_id"), DW_AT_symbol_name("_Sys_setup_mod_id")
    3752                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3753                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3754              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3755                      .dwattr DW$283, DW_AT_name("USB_mod_id"), DW_AT_symbol_name("_USB_mod_id")
    3756                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3757                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3758              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3759                      .dwattr DW$284, DW_AT_name("RM_mod_id"), DW_AT_symbol_name("_RM_mod_id")
    3760                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3761                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3762              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3763                      .dwattr DW$285, DW_AT_name("PC_mod_id"), DW_AT_symbol_name("_PC_mod_id")
    3764                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3765                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3766              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3767                      .dwattr DW$286, DW_AT_name("Help_mod_id"), DW_AT_symbol_name("_Help_mod_id")
    3768                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3769                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3770              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3771                      .dwattr DW$287, DW_AT_name("HZ_input_mod_id"), DW_AT_symbol_name("_HZ_input_mod_id")
    3772                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   78

    3773                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3774              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3775                      .dwattr DW$288, DW_AT_name("Err_correct_mod_id"), DW_AT_symbol_name("_Err_correct_mod_id")
    3776                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3777                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3778              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3779                      .dwattr DW$289, DW_AT_name("Wave_mod_id"), DW_AT_symbol_name("_Wave_mod_id")
    3780                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3781                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3782              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3783                      .dwattr DW$290, DW_AT_name("USER_mod_id"), DW_AT_symbol_name("_USER_mod_id")
    3784                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3785                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3786              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3787                      .dwattr DW$291, DW_AT_name("COMR_mod_id"), DW_AT_symbol_name("_COMR_mod_id")
    3788                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3789                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3790              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3791                      .dwattr DW$292, DW_AT_name("WIR_mod_id"), DW_AT_symbol_name("_WIR_mod_id")
    3792                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3793                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3794              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3795                      .dwattr DW$293, DW_AT_name("Save_mod_id"), DW_AT_symbol_name("_Save_mod_id")
    3796                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3797                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3798              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3799                      .dwattr DW$294, DW_AT_name("Iout_mod_id"), DW_AT_symbol_name("_Iout_mod_id")
    3800                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3801                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3802                      .dwendtag DW$T$51
    3803              
    3804              DW$295  .dwtag  DW_TAG_far_type
    3805                      .dwattr DW$295, DW_AT_type(*DW$T$161)
    3806              DW$T$162        .dwtag  DW_TAG_const_type
    3807                      .dwattr DW$T$162, DW_AT_type(*DW$295)
    3808              
    3809              DW$T$150        .dwtag  DW_TAG_enumeration_type
    3810                      .dwattr DW$T$150, DW_AT_byte_size(0x01)
    3811              DW$296  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_OK"), DW_AT_const_value(0x00)
    3812              DW$297  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_DISK_ERR"), DW_AT_const_value(0x01)
    3813              DW$298  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INT_ERR"), DW_AT_const_value(0x02)
    3814              DW$299  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_READY"), DW_AT_const_value(0x03)
    3815              DW$300  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_FILE"), DW_AT_const_value(0x04)
    3816              DW$301  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_PATH"), DW_AT_const_value(0x05)
    3817              DW$302  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_NAME"), DW_AT_const_value(0x06)
    3818              DW$303  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_DENIED"), DW_AT_const_value(0x07)
    3819              DW$304  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_EXIST"), DW_AT_const_value(0x08)
    3820              DW$305  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_OBJECT"), DW_AT_const_value(0x09)
    3821              DW$306  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_WRITE_PROTECTED"), DW_AT_const_value(0x0a)
    3822              DW$307  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_INVALID_DRIVE"), DW_AT_const_value(0x0b)
    3823              DW$308  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENABLED"), DW_AT_const_value(0x0c)
    3824              DW$309  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NO_FILESYSTEM"), DW_AT_const_value(0x0d)
    3825              DW$310  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_MKFS_ABORTED"), DW_AT_const_value(0x0e)
    3826              DW$311  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TIMEOUT"), DW_AT_const_value(0x0f)
    3827              DW$312  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_LOCKED"), DW_AT_const_value(0x10)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   79

    3828              DW$313  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_NOT_ENOUGH_CORE"), DW_AT_const_value(0x11)
    3829              DW$314  .dwtag  DW_TAG_enumerator, DW_AT_name("FR_TOO_MANY_OPEN_FILES"), DW_AT_const_value(0x12)
    3830                      .dwendtag DW$T$150
    3831              
    3832              DW$T$98 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    3833                      .dwattr DW$T$98, DW_AT_language(DW_LANG_C)
    3834              DW$T$136        .dwtag  DW_TAG_typedef, DW_AT_name("TCHAR"), DW_AT_type(*DW$T$29)
    3835                      .dwattr DW$T$136, DW_AT_language(DW_LANG_C)
    3836              
    3837              DW$T$36 .dwtag  DW_TAG_structure_type
    3838                      .dwattr DW$T$36, DW_AT_name("hwin")
    3839                      .dwattr DW$T$36, DW_AT_byte_size(0x42)
    3840              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3841                      .dwattr DW$315, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    3842                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3843                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3844              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3845                      .dwattr DW$316, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    3846                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3847                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3848              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3849                      .dwattr DW$317, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    3850                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3851                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3852              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3853                      .dwattr DW$318, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    3854                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3855                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3856              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3857                      .dwattr DW$319, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    3858                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3859                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3860              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3861                      .dwattr DW$320, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    3862                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3863                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3864              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3865                      .dwattr DW$321, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    3866                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3867                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3868              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3869                      .dwattr DW$322, DW_AT_name("type"), DW_AT_symbol_name("_type")
    3870                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3871                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3872              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    3873                      .dwattr DW$323, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    3874                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3875                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3876              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    3877                      .dwattr DW$324, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    3878                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3879                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3880              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    3881                      .dwattr DW$325, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
    3882                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   80

    3883                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3884              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3885                      .dwattr DW$326, DW_AT_name("nline"), DW_AT_symbol_name("_nline")
    3886                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3887                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3888              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3889                      .dwattr DW$327, DW_AT_name("nrow"), DW_AT_symbol_name("_nrow")
    3890                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3891                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3892              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3893                      .dwattr DW$328, DW_AT_name("grid_wide"), DW_AT_symbol_name("_grid_wide")
    3894                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3895                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3896              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3897                      .dwattr DW$329, DW_AT_name("grid_high"), DW_AT_symbol_name("_grid_high")
    3898                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3899                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3900              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    3901                      .dwattr DW$330, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    3902                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3903                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3904              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    3905                      .dwattr DW$331, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    3906                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3907                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3908              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    3909                      .dwattr DW$332, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    3910                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3911                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3912              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    3913                      .dwattr DW$333, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
    3914                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3915                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3916              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3917                      .dwattr DW$334, DW_AT_name("button_flags"), DW_AT_symbol_name("_button_flags")
    3918                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3919                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3920              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3921                      .dwattr DW$335, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
    3922                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    3923                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3924              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3925                      .dwattr DW$336, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
    3926                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3927                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3928              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    3929                      .dwattr DW$337, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
    3930                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3931                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3932              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    3933                      .dwattr DW$338, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    3934                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3935                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3936              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3937                      .dwattr DW$339, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   81

    3938                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3939                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3940              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3941                      .dwattr DW$340, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    3942                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    3943                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3944              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3945                      .dwattr DW$341, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
    3946                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3947                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3948                      .dwendtag DW$T$36
    3949              
    3950              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
    3951                      .dwattr DW$T$26, DW_AT_address_class(0x16)
    3952              
    3953              DW$T$45 .dwtag  DW_TAG_structure_type
    3954                      .dwattr DW$T$45, DW_AT_byte_size(0x214)
    3955              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    3956                      .dwattr DW$342, DW_AT_name("fs"), DW_AT_symbol_name("_fs")
    3957                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3958                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3959              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3960                      .dwattr DW$343, DW_AT_name("id"), DW_AT_symbol_name("_id")
    3961                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3962                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3963              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3964                      .dwattr DW$344, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    3965                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3966                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3967              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3968                      .dwattr DW$345, DW_AT_name("pad1"), DW_AT_symbol_name("_pad1")
    3969                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3970                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3971              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3972                      .dwattr DW$346, DW_AT_name("fptr"), DW_AT_symbol_name("_fptr")
    3973                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3974                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3975              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3976                      .dwattr DW$347, DW_AT_name("fsize"), DW_AT_symbol_name("_fsize")
    3977                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3978                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3979              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3980                      .dwattr DW$348, DW_AT_name("sclust"), DW_AT_symbol_name("_sclust")
    3981                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3982                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3983              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3984                      .dwattr DW$349, DW_AT_name("clust"), DW_AT_symbol_name("_clust")
    3985                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3986                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3987              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3988                      .dwattr DW$350, DW_AT_name("dsect"), DW_AT_symbol_name("_dsect")
    3989                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3990                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3991              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3992                      .dwattr DW$351, DW_AT_name("dir_sect"), DW_AT_symbol_name("_dir_sect")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   82

    3993                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3994                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3995              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    3996                      .dwattr DW$352, DW_AT_name("dir_ptr"), DW_AT_symbol_name("_dir_ptr")
    3997                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3998                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3999              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    4000                      .dwattr DW$353, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
    4001                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4002                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4003                      .dwendtag DW$T$45
    4004              
    4005              
    4006              DW$T$47 .dwtag  DW_TAG_structure_type
    4007                      .dwattr DW$T$47, DW_AT_byte_size(0x45)
    4008              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4009                      .dwattr DW$354, DW_AT_name("is_lost_UI"), DW_AT_symbol_name("_is_lost_UI")
    4010                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4011                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4012              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4013                      .dwattr DW$355, DW_AT_name("Ua_lost"), DW_AT_symbol_name("_Ua_lost")
    4014                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4015                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4016              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4017                      .dwattr DW$356, DW_AT_name("Ub_lost"), DW_AT_symbol_name("_Ub_lost")
    4018                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4019                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4020              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4021                      .dwattr DW$357, DW_AT_name("Uc_lost"), DW_AT_symbol_name("_Uc_lost")
    4022                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4023                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4024              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4025                      .dwattr DW$358, DW_AT_name("Ia_lost"), DW_AT_symbol_name("_Ia_lost")
    4026                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4027                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4028              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4029                      .dwattr DW$359, DW_AT_name("Ib_lost"), DW_AT_symbol_name("_Ib_lost")
    4030                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4031                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4032              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4033                      .dwattr DW$360, DW_AT_name("Ic_lost"), DW_AT_symbol_name("_Ic_lost")
    4034                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4035                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4036              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4037                      .dwattr DW$361, DW_AT_name("phaseDir"), DW_AT_symbol_name("_phaseDir")
    4038                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4039                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4040              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    4041                      .dwattr DW$362, DW_AT_name("c_cos"), DW_AT_symbol_name("_c_cos")
    4042                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4043                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4044              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    4045                      .dwattr DW$363, DW_AT_name("c_U"), DW_AT_symbol_name("_c_U")
    4046                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4047                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   83

    4048              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    4049                      .dwattr DW$364, DW_AT_name("c_I"), DW_AT_symbol_name("_c_I")
    4050                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4051                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4052              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4053                      .dwattr DW$365, DW_AT_name("jxmod"), DW_AT_symbol_name("_jxmod")
    4054                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4055                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4056                      .dwendtag DW$T$47
    4057              
    4058              DW$T$161        .dwtag  DW_TAG_typedef, DW_AT_name("WIR_move_step_t"), DW_AT_type(*DW$T$53)
    4059                      .dwattr DW$T$161, DW_AT_language(DW_LANG_C)
    4060              
    4061              DW$T$40 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$37)
    4062                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
    4063                      .dwattr DW$T$40, DW_AT_byte_size(0x200)
    4064              DW$366  .dwtag  DW_TAG_subrange_type
    4065                      .dwattr DW$366, DW_AT_upper_bound(0x1ff)
    4066                      .dwendtag DW$T$40
    4067              
    4068              DW$T$44 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
    4069                      .dwattr DW$T$44, DW_AT_address_class(0x16)
    4070              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("WORD"), DW_AT_type(*DW$T$9)
    4071                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    4072              DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("DWORD"), DW_AT_type(*DW$T$13)
    4073                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    4074              
    4075              DW$T$22 .dwtag  DW_TAG_structure_type
    4076                      .dwattr DW$T$22, DW_AT_name("os_event")
    4077                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    4078              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4079                      .dwattr DW$367, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    4080                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4081                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4082              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    4083                      .dwattr DW$368, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    4084                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4085                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4086              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    4087                      .dwattr DW$369, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    4088                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4089                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4090              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4091                      .dwattr DW$370, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    4092                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4093                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4094              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    4095                      .dwattr DW$371, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    4096                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4097                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4098                      .dwendtag DW$T$22
    4099              
    4100              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
    4101                      .dwattr DW$T$28, DW_AT_address_class(0x16)
    4102              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   84

    4103              DW$T$30 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$29)
    4104                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    4105                      .dwattr DW$T$30, DW_AT_byte_size(0x1e)
    4106              DW$372  .dwtag  DW_TAG_subrange_type
    4107                      .dwattr DW$372, DW_AT_upper_bound(0x1d)
    4108                      .dwendtag DW$T$30
    4109              
    4110              DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
    4111                      .dwattr DW$T$35, DW_AT_address_class(0x16)
    4112              
    4113              DW$T$46 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$29)
    4114                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
    4115                      .dwattr DW$T$46, DW_AT_byte_size(0x14)
    4116              DW$373  .dwtag  DW_TAG_subrange_type
    4117                      .dwattr DW$373, DW_AT_upper_bound(0x13)
    4118                      .dwendtag DW$T$46
    4119              
    4120              DW$T$43 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
    4121                      .dwattr DW$T$43, DW_AT_address_class(0x16)
    4122              
    4123              DW$T$53 .dwtag  DW_TAG_structure_type
    4124                      .dwattr DW$T$53, DW_AT_byte_size(0x04)
    4125              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    4126                      .dwattr DW$374, DW_AT_name("pmove"), DW_AT_symbol_name("_pmove")
    4127                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4128                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4129              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    4130                      .dwattr DW$375, DW_AT_name("step"), DW_AT_symbol_name("_step")
    4131                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4132                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4133                      .dwendtag DW$T$53
    4134              
    4135              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
    4136                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    4137              
    4138              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    4139                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    4140                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    4141              DW$376  .dwtag  DW_TAG_subrange_type
    4142                      .dwattr DW$376, DW_AT_upper_bound(0x07)
    4143                      .dwendtag DW$T$21
    4144              
    4145              DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
    4146                      .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4147                      .dwattr DW$T$9, DW_AT_byte_size(0x01)
    4148              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    4149                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4150                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    4151              DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$25)
    4152                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    4153              DW$T$34 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
    4154                      .dwattr DW$T$34, DW_AT_address_class(0x16)
    4155              DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("FATFS"), DW_AT_type(*DW$T$41)
    4156                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
    4157              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   85

    4158              DW$T$25 .dwtag  DW_TAG_structure_type
    4159                      .dwattr DW$T$25, DW_AT_name("edit_mem")
    4160                      .dwattr DW$T$25, DW_AT_byte_size(0x08)
    4161              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4162                      .dwattr DW$377, DW_AT_name("x"), DW_AT_symbol_name("_x")
    4163                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4164                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4165              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4166                      .dwattr DW$378, DW_AT_name("y"), DW_AT_symbol_name("_y")
    4167                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4168                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4169              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    4170                      .dwattr DW$379, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    4171                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4172                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4173              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    4174                      .dwattr DW$380, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    4175                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4176                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4177              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    4178                      .dwattr DW$381, DW_AT_name("id"), DW_AT_symbol_name("_id")
    4179                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4180                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4181              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4182                      .dwattr DW$382, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    4183                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4184                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4185              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    4186                      .dwattr DW$383, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    4187                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4188                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4189                      .dwendtag DW$T$25
    4190              
    4191              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    4192                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    4193              
    4194              DW$T$41 .dwtag  DW_TAG_structure_type
    4195                      .dwattr DW$T$41, DW_AT_byte_size(0x21a)
    4196              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    4197                      .dwattr DW$384, DW_AT_name("fs_type"), DW_AT_symbol_name("_fs_type")
    4198                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4199                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4200              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    4201                      .dwattr DW$385, DW_AT_name("drv"), DW_AT_symbol_name("_drv")
    4202                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4203                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4204              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    4205                      .dwattr DW$386, DW_AT_name("csize"), DW_AT_symbol_name("_csize")
    4206                      .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4207                      .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4208              DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    4209                      .dwattr DW$387, DW_AT_name("n_fats"), DW_AT_symbol_name("_n_fats")
    4210                      .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4211                      .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4212              DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   86

    4213                      .dwattr DW$388, DW_AT_name("wflag"), DW_AT_symbol_name("_wflag")
    4214                      .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4215                      .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4216              DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    4217                      .dwattr DW$389, DW_AT_name("fsi_flag"), DW_AT_symbol_name("_fsi_flag")
    4218                      .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4219                      .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4220              DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    4221                      .dwattr DW$390, DW_AT_name("id"), DW_AT_symbol_name("_id")
    4222                      .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4223                      .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4224              DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    4225                      .dwattr DW$391, DW_AT_name("n_rootdir"), DW_AT_symbol_name("_n_rootdir")
    4226                      .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4227                      .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4228              DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    4229                      .dwattr DW$392, DW_AT_name("last_clust"), DW_AT_symbol_name("_last_clust")
    4230                      .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4231                      .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4232              DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    4233                      .dwattr DW$393, DW_AT_name("free_clust"), DW_AT_symbol_name("_free_clust")
    4234                      .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4235                      .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4236              DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    4237                      .dwattr DW$394, DW_AT_name("fsi_sector"), DW_AT_symbol_name("_fsi_sector")
    4238                      .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4239                      .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4240              DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    4241                      .dwattr DW$395, DW_AT_name("n_fatent"), DW_AT_symbol_name("_n_fatent")
    4242                      .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4243                      .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4244              DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    4245                      .dwattr DW$396, DW_AT_name("fsize"), DW_AT_symbol_name("_fsize")
    4246                      .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4247                      .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4248              DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    4249                      .dwattr DW$397, DW_AT_name("fatbase"), DW_AT_symbol_name("_fatbase")
    4250                      .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4251                      .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4252              DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    4253                      .dwattr DW$398, DW_AT_name("dirbase"), DW_AT_symbol_name("_dirbase")
    4254                      .dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4255                      .dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4256              DW$399  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    4257                      .dwattr DW$399, DW_AT_name("database"), DW_AT_symbol_name("_database")
    4258                      .dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4259                      .dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4260              DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    4261                      .dwattr DW$400, DW_AT_name("winsect"), DW_AT_symbol_name("_winsect")
    4262                      .dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4263                      .dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4264              DW$401  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    4265                      .dwattr DW$401, DW_AT_name("win"), DW_AT_symbol_name("_win")
    4266                      .dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4267                      .dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   87

    4268                      .dwendtag DW$T$41
    4269              
    4270              
    4271                      .dwattr DW$204, DW_AT_external(0x01)
    4272                      .dwattr DW$205, DW_AT_external(0x01)
    4273                      .dwattr DW$146, DW_AT_external(0x01)
    4274                      .dwattr DW$134, DW_AT_external(0x01)
    4275                      .dwattr DW$159, DW_AT_external(0x01)
    4276                      .dwattr DW$184, DW_AT_external(0x01)
    4277                      .dwattr DW$187, DW_AT_external(0x01)
    4278                      .dwattr DW$164, DW_AT_external(0x01)
    4279                      .dwattr DW$164, DW_AT_type(*DW$T$23)
    4280                      .dwattr DW$139, DW_AT_external(0x01)
    4281                      .dwattr DW$154, DW_AT_external(0x01)
    4282                      .dwattr DW$130, DW_AT_external(0x01)
    4283                      .dwattr DW$130, DW_AT_type(*DW$T$109)
    4284                      .dwattr DW$124, DW_AT_external(0x01)
    4285                      .dwattr DW$106, DW_AT_external(0x01)
    4286                      .dwattr DW$106, DW_AT_type(*DW$T$23)
    4287                      .dwattr DW$171, DW_AT_external(0x01)
    4288                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    4289              
    4290              ;***************************************************************
    4291              ;* DWARF CIE ENTRIES                                           *
    4292              ;***************************************************************
    4293              
    4294              DW$CIE  .dwcie 1, 40
    4295                      .dwcfa  0x0c, 20, 0
    4296                      .dwcfa  0x07, 0
    4297                      .dwcfa  0x07, 1
    4298                      .dwcfa  0x07, 2
    4299                      .dwcfa  0x07, 3
    4300                      .dwcfa  0x07, 4
    4301                      .dwcfa  0x07, 5
    4302                      .dwcfa  0x08, 6
    4303                      .dwcfa  0x08, 7
    4304                      .dwcfa  0x08, 8
    4305                      .dwcfa  0x08, 9
    4306                      .dwcfa  0x08, 10
    4307                      .dwcfa  0x08, 11
    4308                      .dwcfa  0x07, 12
    4309                      .dwcfa  0x07, 13
    4310                      .dwcfa  0x07, 14
    4311                      .dwcfa  0x07, 15
    4312                      .dwcfa  0x07, 16
    4313                      .dwcfa  0x07, 17
    4314                      .dwcfa  0x07, 18
    4315                      .dwcfa  0x07, 19
    4316                      .dwcfa  0x07, 20
    4317                      .dwcfa  0x07, 21
    4318                      .dwcfa  0x07, 22
    4319                      .dwcfa  0x07, 23
    4320                      .dwcfa  0x07, 24
    4321                      .dwcfa  0x07, 25
    4322                      .dwcfa  0x07, 26
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:07 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   88

    4323                      .dwcfa  0x08, 27
    4324                      .dwcfa  0x07, 28
    4325                      .dwcfa  0x07, 29
    4326                      .dwcfa  0x07, 30
    4327                      .dwcfa  0x07, 31
    4328                      .dwcfa  0x07, 32
    4329                      .dwcfa  0x07, 33
    4330                      .dwcfa  0x07, 34
    4331                      .dwcfa  0x07, 35
    4332                      .dwcfa  0x07, 36
