TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:32 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sat Oct 08 14:42:31 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_WIRmod_alg.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    5394                      .dwattr DW$T$103, DW_AT_language(DW_LANG_C)
    5395              DW$326  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$17)
    5396                      .dwendtag DW$T$103
    5397              
    5398              DW$T$70 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$69)
    5399                      .dwattr DW$T$70, DW_AT_address_class(0x16)
    5400              DW$T$74 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$73)
    5401                      .dwattr DW$T$74, DW_AT_address_class(0x16)
    5402              DW$T$75 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$74)
    5403                      .dwattr DW$T$75, DW_AT_address_class(0x16)
    5404              DW$T$86 .dwtag  DW_TAG_typedef, DW_AT_name("UIDang_t"), DW_AT_type(*DW$T$26)
    5405                      .dwattr DW$T$86, DW_AT_language(DW_LANG_C)
    5406              DW$T$87 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$86)
    5407                      .dwattr DW$T$87, DW_AT_address_class(0x16)
    5408              DW$T$115        .dwtag  DW_TAG_typedef, DW_AT_name("measure_param_t"), DW_AT_type(*DW$T$30)
    5409                      .dwattr DW$T$115, DW_AT_language(DW_LANG_C)
    5410              DW$T$31 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    5411                      .dwattr DW$T$31, DW_AT_encoding(DW_ATE_signed_char)
    5412                      .dwattr DW$T$31, DW_AT_byte_size(0x01)
    5413              DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
    5414                      .dwattr DW$T$32, DW_AT_address_class(0x16)
    5415              
    5416              DW$T$105        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$32)
    5417                      .dwattr DW$T$105, DW_AT_language(DW_LANG_C)
    5418              DW$327  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
    5419              DW$328  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
    5420                      .dwendtag DW$T$105
    5421              
    5422              
    5423              DW$T$107        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$32)
    5424                      .dwattr DW$T$107, DW_AT_language(DW_LANG_C)
    5425              DW$329  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
    5426              DW$330  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
    5427              DW$331  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    5428                      .dwendtag DW$T$107
    5429              
    5430              
    5431              DW$T$35 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$31)
    5432                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
    5433                      .dwattr DW$T$35, DW_AT_byte_size(0x14)
    5434              DW$332  .dwtag  DW_TAG_subrange_type
    5435                      .dwattr DW$332, DW_AT_upper_bound(0x13)
    5436                      .dwendtag DW$T$35
    5437              
    5438              DW$T$100        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$99)
    5439                      .dwattr DW$T$100, DW_AT_address_class(0x16)
    5440              
    5441              DW$T$118        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$117)
    5442                      .dwattr DW$T$118, DW_AT_language(DW_LANG_C)
    5443                      .dwattr DW$T$118, DW_AT_byte_size(0x180)
    5444              DW$333  .dwtag  DW_TAG_subrange_type
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:32 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE  127

    5445                      .dwattr DW$333, DW_AT_upper_bound(0x2f)
    5446                      .dwendtag DW$T$118
    5447              
    5448              
    5449              DW$T$121        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$120)
    5450                      .dwattr DW$T$121, DW_AT_language(DW_LANG_C)
    5451                      .dwattr DW$T$121, DW_AT_byte_size(0x308)
    5452              DW$334  .dwtag  DW_TAG_subrange_type
    5453                      .dwattr DW$334, DW_AT_upper_bound(0x60)
    5454                      .dwendtag DW$T$121
    5455              
    5456              DW$T$124        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$123)
    5457                      .dwattr DW$T$124, DW_AT_address_class(0x16)
    5458              DW$T$125        .dwtag  DW_TAG_typedef, DW_AT_name("DL_reflag_u"), DW_AT_type(*DW$T$39)
    5459                      .dwattr DW$T$125, DW_AT_language(DW_LANG_C)
    5460              
    5461              DW$T$54 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    5462                      .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    5463                      .dwattr DW$T$54, DW_AT_byte_size(0x20)
    5464              DW$335  .dwtag  DW_TAG_subrange_type
    5465                      .dwattr DW$335, DW_AT_upper_bound(0x1f)
    5466                      .dwendtag DW$T$54
    5467              
    5468              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    5469                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    5470                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    5471              DW$T$69 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    5472                      .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
    5473              DW$T$73 .dwtag  DW_TAG_typedef, DW_AT_name("a_sem_t"), DW_AT_type(*DW$T$69)
    5474                      .dwattr DW$T$73, DW_AT_language(DW_LANG_C)
    5475              
    5476              DW$T$26 .dwtag  DW_TAG_structure_type
    5477                      .dwattr DW$T$26, DW_AT_name("UIDang")
    5478                      .dwattr DW$T$26, DW_AT_byte_size(0x03)
    5479              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    5480                      .dwattr DW$336, DW_AT_name("UIDangN"), DW_AT_symbol_name("_UIDangN")
    5481                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5482                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5483              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5484                      .dwattr DW$337, DW_AT_name("all"), DW_AT_symbol_name("_all")
    5485                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5486                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    5487                      .dwendtag DW$T$26
    5488              
    5489              
    5490              DW$T$30 .dwtag  DW_TAG_structure_type
    5491                      .dwattr DW$T$30, DW_AT_name("_measure_param_t")
    5492                      .dwattr DW$T$30, DW_AT_byte_size(0x48)
    5493              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    5494                      .dwattr DW$338, DW_AT_name("phase_a"), DW_AT_symbol_name("_phase_a")
    5495                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5496                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5497              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    5498                      .dwattr DW$339, DW_AT_name("phase_b"), DW_AT_symbol_name("_phase_b")
    5499                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:32 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE  128

    5500                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    5501              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    5502                      .dwattr DW$340, DW_AT_name("phase_c"), DW_AT_symbol_name("_phase_c")
    5503                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5504                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    5505              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5506                      .dwattr DW$341, DW_AT_name("f_Uab"), DW_AT_symbol_name("_f_Uab")
    5507                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5508                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5509              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5510                      .dwattr DW$342, DW_AT_name("f_Ubc"), DW_AT_symbol_name("_f_Ubc")
    5511                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5512                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    5513              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5514                      .dwattr DW$343, DW_AT_name("f_Uac"), DW_AT_symbol_name("_f_Uac")
    5515                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5516                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    5517              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5518                      .dwattr DW$344, DW_AT_name("f_JIac"), DW_AT_symbol_name("_f_JIac")
    5519                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5520                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    5521              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5522                      .dwattr DW$345, DW_AT_name("f_JIbc"), DW_AT_symbol_name("_f_JIbc")
    5523                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    5524                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    5525              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5526                      .dwattr DW$346, DW_AT_name("f_JIab"), DW_AT_symbol_name("_f_JIab")
    5527                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5528                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    5529              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5530                      .dwattr DW$347, DW_AT_name("f_JUac"), DW_AT_symbol_name("_f_JUac")
    5531                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    5532                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    5533              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5534                      .dwattr DW$348, DW_AT_name("f_JUbc"), DW_AT_symbol_name("_f_JUbc")
    5535                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5536                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    5537              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5538                      .dwattr DW$349, DW_AT_name("f_JUab"), DW_AT_symbol_name("_f_JUab")
    5539                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    5540                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    5541              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5542                      .dwattr DW$350, DW_AT_name("f_Cos"), DW_AT_symbol_name("_f_Cos")
    5543                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5544                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    5545              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5546                      .dwattr DW$351, DW_AT_name("f_Pabc"), DW_AT_symbol_name("_f_Pabc")
    5547                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5548                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    5549              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5550                      .dwattr DW$352, DW_AT_name("f_Qabc"), DW_AT_symbol_name("_f_Qabc")
    5551                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5552                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    5553              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    5554                      .dwattr DW$353, DW_AT_name("f_err"), DW_AT_symbol_name("_f_err")
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:32 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE  129

    5555                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    5556                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    5557              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    5558                      .dwattr DW$354, DW_AT_name("f_err_Q"), DW_AT_symbol_name("_f_err_Q")
    5559                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    5560                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    5561              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5562                      .dwattr DW$355, DW_AT_name("f_Feq"), DW_AT_symbol_name("_f_Feq")
    5563                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5564                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    5565                      .dwendtag DW$T$30
    5566              
    5567              DW$356  .dwtag  DW_TAG_far_type
    5568                      .dwattr DW$356, DW_AT_type(*DW$T$31)
    5569              DW$T$99 .dwtag  DW_TAG_const_type
    5570                      .dwattr DW$T$99, DW_AT_type(*DW$356)
    5571              DW$357  .dwtag  DW_TAG_far_type
    5572                      .dwattr DW$357, DW_AT_type(*DW$T$33)
    5573              DW$T$117        .dwtag  DW_TAG_const_type
    5574                      .dwattr DW$T$117, DW_AT_type(*DW$357)
    5575              DW$358  .dwtag  DW_TAG_far_type
    5576                      .dwattr DW$358, DW_AT_type(*DW$T$34)
    5577              DW$T$120        .dwtag  DW_TAG_const_type
    5578                      .dwattr DW$T$120, DW_AT_type(*DW$358)
    5579              DW$T$123        .dwtag  DW_TAG_typedef, DW_AT_name("WIR_ALG_t"), DW_AT_type(*DW$T$36)
    5580                      .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
    5581              
    5582              DW$T$39 .dwtag  DW_TAG_union_type
    5583                      .dwattr DW$T$39, DW_AT_byte_size(0x01)
    5584              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5585                      .dwattr DW$359, DW_AT_name("reflag"), DW_AT_symbol_name("_reflag")
    5586                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5587                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    5588              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    5589                      .dwattr DW$360, DW_AT_name("reflag_bits"), DW_AT_symbol_name("_reflag_bits")
    5590                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5591                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    5592                      .dwendtag DW$T$39
    5593              
    5594              
    5595              DW$T$29 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$16)
    5596                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    5597                      .dwattr DW$T$29, DW_AT_byte_size(0x08)
    5598              DW$361  .dwtag  DW_TAG_subrange_type
    5599                      .dwattr DW$361, DW_AT_upper_bound(0x03)
    5600                      .dwendtag DW$T$29
    5601              
    5602              
    5603              DW$T$22 .dwtag  DW_TAG_structure_type
    5604                      .dwattr DW$T$22, DW_AT_name("os_event")
    5605                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    5606              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5607                      .dwattr DW$362, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    5608                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5609                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:32 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE  130

    5610              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    5611                      .dwattr DW$363, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    5612                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5613                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    5614              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    5615                      .dwattr DW$364, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    5616                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5617                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    5618              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    5619                      .dwattr DW$365, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    5620                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5621                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    5622              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    5623                      .dwattr DW$366, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    5624                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5625                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    5626                      .dwendtag DW$T$22
    5627              
    5628              
    5629              DW$T$25 .dwtag  DW_TAG_union_type
    5630                      .dwattr DW$T$25, DW_AT_name("UIDangUnion")
    5631                      .dwattr DW$T$25, DW_AT_byte_size(0x02)
    5632              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5633                      .dwattr DW$367, DW_AT_name("all"), DW_AT_symbol_name("_all")
    5634                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5635                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    5636              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    5637                      .dwattr DW$368, DW_AT_name("bit2"), DW_AT_symbol_name("_bit2")
    5638                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5639                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    5640              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    5641                      .dwattr DW$369, DW_AT_name("bit1"), DW_AT_symbol_name("_bit1")
    5642                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5643                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    5644                      .dwendtag DW$T$25
    5645              
    5646              DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("phase_param_t"), DW_AT_type(*DW$T$27)
    5647                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    5648              
    5649              DW$T$33 .dwtag  DW_TAG_structure_type
    5650                      .dwattr DW$T$33, DW_AT_name("cha")
    5651                      .dwattr DW$T$33, DW_AT_byte_size(0x08)
    5652              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5653                      .dwattr DW$370, DW_AT_name("cfuac"), DW_AT_symbol_name("_cfuac")
    5654                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5655                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    5656              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5657                      .dwattr DW$371, DW_AT_name("cfiac"), DW_AT_symbol_name("_cfiac")
    5658                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5659                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    5660              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5661                      .dwattr DW$372, DW_AT_name("cfa"), DW_AT_symbol_name("_cfa")
    5662                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5663                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    5664              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:32 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE  131

    5665                      .dwattr DW$373, DW_AT_name("cfc"), DW_AT_symbol_name("_cfc")
    5666                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5667                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    5668              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    5669                      .dwattr DW$374, DW_AT_name("uxian"), DW_AT_symbol_name("_uxian")
    5670                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5671                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    5672              DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    5673                      .dwattr DW$375, DW_AT_name("ixian"), DW_AT_symbol_name("_ixian")
    5674                      .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5675                      .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    5676                      .dwendtag DW$T$33
    5677              
    5678              
    5679              DW$T$34 .dwtag  DW_TAG_structure_type
    5680                      .dwattr DW$T$34, DW_AT_name("cha2")
    5681                      .dwattr DW$T$34, DW_AT_byte_size(0x08)
    5682              DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5683                      .dwattr DW$376, DW_AT_name("czhen"), DW_AT_symbol_name("_czhen")
    5684                      .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5685                      .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    5686              DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5687                      .dwattr DW$377, DW_AT_name("cfa"), DW_AT_symbol_name("_cfa")
    5688                      .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5689                      .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    5690              DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5691                      .dwattr DW$378, DW_AT_name("cfb"), DW_AT_symbol_name("_cfb")
    5692                      .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5693                      .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    5694              DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5695                      .dwattr DW$379, DW_AT_name("cfc"), DW_AT_symbol_name("_cfc")
    5696                      .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5697                      .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    5698              DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    5699                      .dwattr DW$380, DW_AT_name("uxian"), DW_AT_symbol_name("_uxian")
    5700                      .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5701                      .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    5702              DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    5703                      .dwattr DW$381, DW_AT_name("ixian"), DW_AT_symbol_name("_ixian")
    5704                      .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5705                      .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    5706                      .dwendtag DW$T$34
    5707              
    5708              
    5709              DW$T$36 .dwtag  DW_TAG_structure_type
    5710                      .dwattr DW$T$36, DW_AT_byte_size(0x45)
    5711              DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5712                      .dwattr DW$382, DW_AT_name("is_lost_UI"), DW_AT_symbol_name("_is_lost_UI")
    5713                      .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5714                      .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    5715              DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5716                      .dwattr DW$383, DW_AT_name("Ua_lost"), DW_AT_symbol_name("_Ua_lost")
    5717                      .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5718                      .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    5719              DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:32 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE  132

    5720                      .dwattr DW$384, DW_AT_name("Ub_lost"), DW_AT_symbol_name("_Ub_lost")
    5721                      .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5722                      .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    5723              DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5724                      .dwattr DW$385, DW_AT_name("Uc_lost"), DW_AT_symbol_name("_Uc_lost")
    5725                      .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5726                      .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    5727              DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5728                      .dwattr DW$386, DW_AT_name("Ia_lost"), DW_AT_symbol_name("_Ia_lost")
    5729                      .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5730                      .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    5731              DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5732                      .dwattr DW$387, DW_AT_name("Ib_lost"), DW_AT_symbol_name("_Ib_lost")
    5733                      .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5734                      .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    5735              DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5736                      .dwattr DW$388, DW_AT_name("Ic_lost"), DW_AT_symbol_name("_Ic_lost")
    5737                      .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5738                      .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    5739              DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5740                      .dwattr DW$389, DW_AT_name("phaseDir"), DW_AT_symbol_name("_phaseDir")
    5741                      .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5742                      .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    5743              DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    5744                      .dwattr DW$390, DW_AT_name("c_cos"), DW_AT_symbol_name("_c_cos")
    5745                      .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5746                      .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    5747              DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    5748                      .dwattr DW$391, DW_AT_name("c_U"), DW_AT_symbol_name("_c_U")
    5749                      .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5750                      .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    5751              DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    5752                      .dwattr DW$392, DW_AT_name("c_I"), DW_AT_symbol_name("_c_I")
    5753                      .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5754                      .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    5755              DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5756                      .dwattr DW$393, DW_AT_name("jxmod"), DW_AT_symbol_name("_jxmod")
    5757                      .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5758                      .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    5759                      .dwendtag DW$T$36
    5760              
    5761              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("reflag_bits_t"), DW_AT_type(*DW$T$37)
    5762                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    5763              
    5764              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    5765                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    5766                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    5767              DW$394  .dwtag  DW_TAG_subrange_type
    5768                      .dwattr DW$394, DW_AT_upper_bound(0x07)
    5769                      .dwendtag DW$T$21
    5770              
    5771              
    5772              DW$T$23 .dwtag  DW_TAG_structure_type
    5773                      .dwattr DW$T$23, DW_AT_name("UIDangBit2")
    5774                      .dwattr DW$T$23, DW_AT_byte_size(0x02)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:32 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE  133

    5775              DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5776                      .dwattr DW$395, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    5777                      .dwattr DW$395, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
    5778                      .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5779                      .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    5780              DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5781                      .dwattr DW$396, DW_AT_name("UIa"), DW_AT_symbol_name("_UIa")
    5782                      .dwattr DW$396, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x02)
    5783                      .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5784                      .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    5785              DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5786                      .dwattr DW$397, DW_AT_name("UIb"), DW_AT_symbol_name("_UIb")
    5787                      .dwattr DW$397, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x02)
    5788                      .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5789                      .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    5790              DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5791                      .dwattr DW$398, DW_AT_name("UIc"), DW_AT_symbol_name("_UIc")
    5792                      .dwattr DW$398, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x02)
    5793                      .dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5794                      .dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
    5795              DW$399  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5796                      .dwattr DW$399, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    5797                      .dwattr DW$399, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    5798                      .dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5799                      .dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
    5800                      .dwendtag DW$T$23
    5801              
    5802              
    5803              DW$T$24 .dwtag  DW_TAG_structure_type
    5804                      .dwattr DW$T$24, DW_AT_name("UIDangBit1")
    5805                      .dwattr DW$T$24, DW_AT_byte_size(0x01)
    5806              DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5807                      .dwattr DW$400, DW_AT_name("UDangFlag"), DW_AT_symbol_name("_UDangFlag")
    5808                      .dwattr DW$400, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    5809                      .dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5810                      .dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
    5811              DW$401  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5812                      .dwattr DW$401, DW_AT_name("IDangFlag"), DW_AT_symbol_name("_IDangFlag")
    5813                      .dwattr DW$401, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x04)
    5814                      .dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5815                      .dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
    5816              DW$402  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5817                      .dwattr DW$402, DW_AT_name("Ia"), DW_AT_symbol_name("_Ia")
    5818                      .dwattr DW$402, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5819                      .dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5820                      .dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
    5821              DW$403  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5822                      .dwattr DW$403, DW_AT_name("Ua"), DW_AT_symbol_name("_Ua")
    5823                      .dwattr DW$403, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    5824                      .dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5825                      .dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
    5826              DW$404  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5827                      .dwattr DW$404, DW_AT_name("Ib"), DW_AT_symbol_name("_Ib")
    5828                      .dwattr DW$404, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    5829                      .dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:32 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE  134

    5830                      .dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
    5831              DW$405  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5832                      .dwattr DW$405, DW_AT_name("Ub"), DW_AT_symbol_name("_Ub")
    5833                      .dwattr DW$405, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    5834                      .dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5835                      .dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
    5836              DW$406  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5837                      .dwattr DW$406, DW_AT_name("Ic"), DW_AT_symbol_name("_Ic")
    5838                      .dwattr DW$406, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    5839                      .dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5840                      .dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
    5841              DW$407  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5842                      .dwattr DW$407, DW_AT_name("Uc"), DW_AT_symbol_name("_Uc")
    5843                      .dwattr DW$407, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    5844                      .dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5845                      .dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
    5846              DW$408  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5847                      .dwattr DW$408, DW_AT_name("Flag3or4Phase"), DW_AT_symbol_name("_Flag3or4Phase")
    5848                      .dwattr DW$408, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    5849                      .dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5850                      .dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
    5851              DW$409  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5852                      .dwattr DW$409, DW_AT_name("SiglePhaseDL"), DW_AT_symbol_name("_SiglePhaseDL")
    5853                      .dwattr DW$409, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    5854                      .dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5855                      .dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
    5856                      .dwendtag DW$T$24
    5857              
    5858              
    5859              DW$T$27 .dwtag  DW_TAG_structure_type
    5860                      .dwattr DW$T$27, DW_AT_name("_phase_param_t")
    5861                      .dwattr DW$T$27, DW_AT_byte_size(0x0a)
    5862              DW$410  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5863                      .dwattr DW$410, DW_AT_name("f_U"), DW_AT_symbol_name("_f_U")
    5864                      .dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5865                      .dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
    5866              DW$411  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5867                      .dwattr DW$411, DW_AT_name("f_I"), DW_AT_symbol_name("_f_I")
    5868                      .dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5869                      .dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
    5870              DW$412  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5871                      .dwattr DW$412, DW_AT_name("f_J"), DW_AT_symbol_name("_f_J")
    5872                      .dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5873                      .dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
    5874              DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5875                      .dwattr DW$413, DW_AT_name("f_P"), DW_AT_symbol_name("_f_P")
    5876                      .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5877                      .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    5878              DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    5879                      .dwattr DW$414, DW_AT_name("f_Q"), DW_AT_symbol_name("_f_Q")
    5880                      .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5881                      .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
    5882                      .dwendtag DW$T$27
    5883              
    5884              
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:32 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE  135

    5885              DW$T$37 .dwtag  DW_TAG_structure_type
    5886                      .dwattr DW$T$37, DW_AT_byte_size(0x01)
    5887              DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5888                      .dwattr DW$415, DW_AT_name("Mdata_reflag"), DW_AT_symbol_name("_Mdata_reflag")
    5889                      .dwattr DW$415, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5890                      .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5891                      .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    5892              DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5893                      .dwattr DW$416, DW_AT_name("Edata_reflag"), DW_AT_symbol_name("_Edata_reflag")
    5894                      .dwattr DW$416, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    5895                      .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5896                      .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    5897              DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5898                      .dwattr DW$417, DW_AT_name("Edata_Ireflag"), DW_AT_symbol_name("_Edata_Ireflag")
    5899                      .dwattr DW$417, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    5900                      .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5901                      .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    5902              DW$418  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5903                      .dwattr DW$418, DW_AT_name("Edata_Preflag"), DW_AT_symbol_name("_Edata_Preflag")
    5904                      .dwattr DW$418, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5905                      .dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5906                      .dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
    5907              DW$419  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5908                      .dwattr DW$419, DW_AT_name("Edata_Qreflag"), DW_AT_symbol_name("_Edata_Qreflag")
    5909                      .dwattr DW$419, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    5910                      .dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5911                      .dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
    5912              DW$420  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5913                      .dwattr DW$420, DW_AT_name("Edata_Jreflag"), DW_AT_symbol_name("_Edata_Jreflag")
    5914                      .dwattr DW$420, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5915                      .dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5916                      .dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
    5917              DW$421  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5918                      .dwattr DW$421, DW_AT_name("DLerrdata_reflag"), DW_AT_symbol_name("_DLerrdata_reflag")
    5919                      .dwattr DW$421, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5920                      .dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5921                      .dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
    5922              DW$422  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5923                      .dwattr DW$422, DW_AT_name("AU_OV"), DW_AT_symbol_name("_AU_OV")
    5924                      .dwattr DW$422, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5925                      .dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5926                      .dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
    5927              DW$423  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5928                      .dwattr DW$423, DW_AT_name("BU_OV"), DW_AT_symbol_name("_BU_OV")
    5929                      .dwattr DW$423, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    5930                      .dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5931                      .dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
    5932              DW$424  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5933                      .dwattr DW$424, DW_AT_name("CU_OV"), DW_AT_symbol_name("_CU_OV")
    5934                      .dwattr DW$424, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    5935                      .dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5936                      .dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
    5937              DW$425  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5938                      .dwattr DW$425, DW_AT_name("AI_OV"), DW_AT_symbol_name("_AI_OV")
    5939                      .dwattr DW$425, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:32 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE  136

    5940                      .dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5941                      .dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
    5942              DW$426  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5943                      .dwattr DW$426, DW_AT_name("BI_OV"), DW_AT_symbol_name("_BI_OV")
    5944                      .dwattr DW$426, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    5945                      .dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5946                      .dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
    5947              DW$427  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5948                      .dwattr DW$427, DW_AT_name("CI_OV"), DW_AT_symbol_name("_CI_OV")
    5949                      .dwattr DW$427, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    5950                      .dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5951                      .dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5952              DW$428  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5953                      .dwattr DW$428, DW_AT_name("RES"), DW_AT_symbol_name("_RES")
    5954                      .dwattr DW$428, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x02)
    5955                      .dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5956                      .dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5957                      .dwendtag DW$T$37
    5958              
    5959              
    5960                      .dwattr DW$224, DW_AT_external(0x01)
    5961                      .dwattr DW$227, DW_AT_external(0x01)
    5962                      .dwattr DW$220, DW_AT_external(0x01)
    5963                      .dwattr DW$220, DW_AT_type(*DW$T$85)
    5964                      .dwattr DW$228, DW_AT_external(0x01)
    5965                      .dwattr DW$283, DW_AT_external(0x01)
    5966                      .dwattr DW$284, DW_AT_external(0x01)
    5967                      .dwattr DW$229, DW_AT_external(0x01)
    5968                      .dwattr DW$95, DW_AT_external(0x01)
    5969                      .dwattr DW$149, DW_AT_external(0x01)
    5970                      .dwattr DW$83, DW_AT_external(0x01)
    5971                      .dwattr DW$83, DW_AT_type(*DW$T$10)
    5972                      .dwattr DW$68, DW_AT_external(0x01)
    5973                      .dwattr DW$68, DW_AT_type(*DW$T$32)
    5974                      .dwattr DW$86, DW_AT_external(0x01)
    5975                      .dwattr DW$215, DW_AT_external(0x01)
    5976                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    5977              
    5978              ;***************************************************************
    5979              ;* DWARF CIE ENTRIES                                           *
    5980              ;***************************************************************
    5981              
    5982              DW$CIE  .dwcie 1, 40
    5983                      .dwcfa  0x0c, 20, 0
    5984                      .dwcfa  0x07, 0
    5985                      .dwcfa  0x07, 1
    5986                      .dwcfa  0x07, 2
    5987                      .dwcfa  0x07, 3
    5988                      .dwcfa  0x07, 4
    5989                      .dwcfa  0x07, 5
    5990                      .dwcfa  0x08, 6
    5991                      .dwcfa  0x08, 7
    5992                      .dwcfa  0x08, 8
    5993                      .dwcfa  0x08, 9
    5994                      .dwcfa  0x08, 10
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:32 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE  137

    5995                      .dwcfa  0x08, 11
    5996                      .dwcfa  0x07, 12
    5997                      .dwcfa  0x07, 13
    5998                      .dwcfa  0x07, 14
    5999                      .dwcfa  0x07, 15
    6000                      .dwcfa  0x07, 16
    6001                      .dwcfa  0x07, 17
    6002                      .dwcfa  0x07, 18
    6003                      .dwcfa  0x07, 19
    6004                      .dwcfa  0x07, 20
    6005                      .dwcfa  0x07, 21
    6006                      .dwcfa  0x07, 22
    6007                      .dwcfa  0x07, 23
    6008                      .dwcfa  0x07, 24
    6009                      .dwcfa  0x07, 25
    6010                      .dwcfa  0x07, 26
    6011                      .dwcfa  0x08, 27
    6012                      .dwcfa  0x07, 28
    6013                      .dwcfa  0x07, 29
    6014                      .dwcfa  0x07, 30
    6015                      .dwcfa  0x07, 31
    6016                      .dwcfa  0x07, 32
    6017                      .dwcfa  0x07, 33
    6018                      .dwcfa  0x07, 34
    6019                      .dwcfa  0x07, 35
    6020                      .dwcfa  0x07, 36
    6021                      .dwcfa  0x07, 37
    6022                      .dwcfa  0x07, 38
    6023                      .dwcfa  0x07, 39
    6024                      .dwcfa  0x07, 40
    6025              
    6026              ;***************************************************************
