TMS320C2000 COFF Assembler PC v4.1.3 Tue Dec 21 14:39:05 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Tue Dec 21 14:39:05 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_USBmod_connect.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("app_USBmod_fun_exit"), DW_AT_symbol_name("_app_USBmod_fun_exit
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              

     255                      .dwattr DW$17, DW_AT_end_file("app_USBmod_connect.c")
     256                      .dwattr DW$17, DW_AT_end_line(0x49)
     257                      .dwattr DW$17, DW_AT_end_column(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Dec 21 14:39:05 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE    6

     258                      .dwendentry
     259                      .dwendtag DW$17
     260              
     261              ;***************************************************************
     262              ;* FAR STRINGS                                                 *
     263              ;***************************************************************
     264 00000000               .sect   ".econst"
     265                      .align  2
     266 00000000 0055  FSL1:   .string "USBmod....",10,0
         00000001 0053 
         00000002 0042 
         00000003 006D 
         00000004 006F 
         00000005 0064 
         00000006 002E 
         00000007 002E 
         00000008 002E 
         00000009 002E 
         0000000a 000A 
         0000000b 0000 
     267                      .align  2
     268 0000000c 0055  FSL2:   .string "USBmod=>",0
         0000000d 0053 
         0000000e 0042 
         0000000f 006D 
         00000010 006F 
         00000011 0064 
         00000012 003D 
         00000013 003E 
         00000014 0000 
     269              ;***************************************************************
     270              ;* UNDEFINED EXTERNAL REFERENCES                               *
     271              ;***************************************************************
     272                      .global _app_USBmod_fun_exit
     273                      .global _app_USBmod_fun_entry
     274                      .global _app_global_resouce_req
     275                      .global _log_printf
     276                      .global _app_global_resouce_release
     277                      .global _m_null_pram
     278                      .global _app_module_add
     279                      .global _m_log_pram
     280              
     281              ;***************************************************************
     282              ;* TYPE INFORMATION                                            *
     283              ;***************************************************************
     284              DW$T$3  .dwtag  DW_TAG_pointer_type
     285                      .dwattr DW$T$3, DW_AT_address_class(0x16)
     286              
     287              DW$T$20 .dwtag  DW_TAG_subroutine_type
     288                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     289              
     290              DW$T$31 .dwtag  DW_TAG_subroutine_type
     291                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     292              DW$20   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     293              DW$21   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Dec 21 14:39:05 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE    7

     294                      .dwendtag DW$T$31
     295              
     296              
     297              DW$T$33 .dwtag  DW_TAG_subroutine_type
     298                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
     299              DW$22   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     300                      .dwendtag DW$T$33
     301              
     302              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     303                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     304                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
     305              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
     306                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     307              
     308              DW$T$38 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     309                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     310              DW$23   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
     311                      .dwendtag DW$T$38
     312              
     313              
     314              DW$T$40 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     315                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     316              DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("app_mod_inlet_t"), DW_AT_type(*DW$T$24)
     317                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
     318              DW$T$37 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
     319                      .dwattr DW$T$37, DW_AT_address_class(0x16)
     320              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
     321                      .dwattr DW$T$28, DW_AT_address_class(0x16)
     322              DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("log_param"), DW_AT_type(*DW$T$27)
     323                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
     324              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
     325                      .dwattr DW$T$30, DW_AT_address_class(0x16)
     326              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     327                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     328                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     329              
     330              DW$T$24 .dwtag  DW_TAG_structure_type
     331                      .dwattr DW$T$24, DW_AT_byte_size(0x06)
     332              DW$24   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     333                      .dwattr DW$24, DW_AT_name("mod_id"), DW_AT_symbol_name("_mod_id")
     334                      .dwattr DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     335                      .dwattr DW$24, DW_AT_accessibility(DW_ACCESS_public)
     336              DW$25   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     337                      .dwattr DW$25, DW_AT_name("insmod_fun"), DW_AT_symbol_name("_insmod_fun")
     338                      .dwattr DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     339                      .dwattr DW$25, DW_AT_accessibility(DW_ACCESS_public)
     340              DW$26   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     341                      .dwattr DW$26, DW_AT_name("exitmod_fun"), DW_AT_symbol_name("_exitmod_fun")
     342                      .dwattr DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     343                      .dwattr DW$26, DW_AT_accessibility(DW_ACCESS_public)
     344                      .dwendtag DW$T$24
     345              
     346              DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     347                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
     348                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Dec 21 14:39:05 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE    8

     349              
     350              DW$T$27 .dwtag  DW_TAG_structure_type
     351                      .dwattr DW$T$27, DW_AT_byte_size(0x28)
     352              DW$27   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     353                      .dwattr DW$27, DW_AT_name("pram_buf"), DW_AT_symbol_name("_pram_buf")
     354                      .dwattr DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     355                      .dwattr DW$27, DW_AT_accessibility(DW_ACCESS_public)
     356              DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
     357                      .dwattr DW$28, DW_AT_name("cur_off"), DW_AT_symbol_name("_cur_off")
     358                      .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     359                      .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     360              DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     361                      .dwattr DW$29, DW_AT_name("parm_0"), DW_AT_symbol_name("_parm_0")
     362                      .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     363                      .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     364              DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     365                      .dwattr DW$30, DW_AT_name("parm_1"), DW_AT_symbol_name("_parm_1")
     366                      .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     367                      .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     368              DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     369                      .dwattr DW$31, DW_AT_name("parm_2"), DW_AT_symbol_name("_parm_2")
     370                      .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     371                      .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     372              DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     373                      .dwattr DW$32, DW_AT_name("parm_3"), DW_AT_symbol_name("_parm_3")
     374                      .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     375                      .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     376              DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     377                      .dwattr DW$33, DW_AT_name("parm_4"), DW_AT_symbol_name("_parm_4")
     378                      .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     379                      .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     380              DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     381                      .dwattr DW$34, DW_AT_name("parm_5"), DW_AT_symbol_name("_parm_5")
     382                      .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     383                      .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     384              DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     385                      .dwattr DW$35, DW_AT_name("end_pram"), DW_AT_symbol_name("_end_pram")
     386                      .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     387                      .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     388                      .dwendtag DW$T$27
     389              
     390              DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("app_insmod_t"), DW_AT_type(*DW$T$21)
     391                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
     392              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("app_exitmod_t"), DW_AT_type(*DW$T$21)
     393                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     394              
     395              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
     396                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
     397                      .dwattr DW$T$26, DW_AT_byte_size(0x18)
     398              DW$36   .dwtag  DW_TAG_subrange_type
     399                      .dwattr DW$36, DW_AT_upper_bound(0x17)
     400                      .dwendtag DW$T$26
     401              
     402              DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
     403                      .dwattr DW$T$21, DW_AT_address_class(0x16)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Dec 21 14:39:05 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8522                            PAGE    9

     404              
     405                      .dwattr DW$17, DW_AT_external(0x01)
     406                      .dwattr DW$17, DW_AT_type(*DW$T$19)
     407                      .dwattr DW$16, DW_AT_external(0x01)
     408                      .dwattr DW$15, DW_AT_external(0x01)
     409                      .dwattr DW$14, DW_AT_external(0x01)
     410                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     411              
     412              ;***************************************************************
     413              ;* DWARF CIE ENTRIES                                           *
     414              ;***************************************************************
     415              
     416              DW$CIE  .dwcie 1, 40
     417                      .dwcfa  0x0c, 20, 0
     418                      .dwcfa  0x07, 0
     419                      .dwcfa  0x07, 1
     420                      .dwcfa  0x07, 2
     421                      .dwcfa  0x07, 3
     422                      .dwcfa  0x07, 4
     423                      .dwcfa  0x07, 5
     424                      .dwcfa  0x08, 6
     425                      .dwcfa  0x08, 7
     426                      .dwcfa  0x08, 8
     427                      .dwcfa  0x08, 9
     428                      .dwcfa  0x08, 10
     429                      .dwcfa  0x08, 11
     430                      .dwcfa  0x07, 12
     431                      .dwcfa  0x07, 13
     432                      .dwcfa  0x07, 14
     433                      .dwcfa  0x07, 15
     434                      .dwcfa  0x07, 16
     435                      .dwcfa  0x07, 17
     436                      .dwcfa  0x07, 18
     437                      .dwcfa  0x07, 19
     438                      .dwcfa  0x07, 20
     439                      .dwcfa  0x07, 21
     440                      .dwcfa  0x07, 22
     441                      .dwcfa  0x07, 23
     442                      .dwcfa  0x07, 24
     443                      .dwcfa  0x07, 25
     444                      .dwcfa  0x07, 26
     445                      .dwcfa  0x08, 27
     446                      .dwcfa  0x07, 28
     447                      .dwcfa  0x07, 29
     448                      .dwcfa  0x07, 30
     449                      .dwcfa  0x07, 31
     450                      .dwcfa  0x07, 32
     451                      .dwcfa  0x07, 33
     452                      .dwcfa  0x07, 34
     453                      .dwcfa  0x07, 35
     454                      .dwcfa  0x07, 36
     455                      .dwcfa  0x07, 37
