TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:17 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6482                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Fri Dec 17 15:39:17 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_USBmod_interface.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

     408                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     409              
     410              DW$T$44 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$42)
     411                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
     412              DW$46   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
     413              DW$47   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$43)
     414                      .dwendtag DW$T$44
     415              
     416              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     417                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     418                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     419              
     420              DW$T$46 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     421                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
     422              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     423                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     424                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     425              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
     426                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     427              DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     428                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
     429                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
     430              
     431              DW$T$48 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$30)
     432                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
     433                      .dwattr DW$T$48, DW_AT_byte_size(0x04)
     434              DW$48   .dwtag  DW_TAG_subrange_type
     435                      .dwattr DW$48, DW_AT_upper_bound(0x01)
     436                      .dwendtag DW$T$48
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:17 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6482                            PAGE   13

     437              
     438              
     439              DW$T$49 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$30)
     440                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
     441                      .dwattr DW$T$49, DW_AT_byte_size(0x10)
     442              DW$49   .dwtag  DW_TAG_subrange_type
     443                      .dwattr DW$49, DW_AT_upper_bound(0x03)
     444              DW$50   .dwtag  DW_TAG_subrange_type
     445                      .dwattr DW$50, DW_AT_upper_bound(0x01)
     446                      .dwendtag DW$T$49
     447              
     448              DW$T$43 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
     449                      .dwattr DW$T$43, DW_AT_address_class(0x16)
     450              DW$T$36 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
     451                      .dwattr DW$T$36, DW_AT_address_class(0x16)
     452              
     453              DW$T$65 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$36)
     454                      .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
     455              
     456              DW$T$67 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$36)
     457                      .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
     458              DW$51   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     459              DW$52   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     460              DW$53   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     461              DW$54   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     462              DW$55   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     463              DW$56   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
     464                      .dwendtag DW$T$67
     465              
     466              
     467              DW$T$69 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$36)
     468                      .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
     469              DW$57   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     470              DW$58   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     471              DW$59   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     472              DW$60   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     473              DW$61   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$43)
     474              DW$62   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     475              DW$63   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
     476                      .dwendtag DW$T$69
     477              
     478              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
     479                      .dwattr DW$T$30, DW_AT_address_class(0x16)
     480              DW$T$35 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$32)
     481                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
     482              DW$64   .dwtag  DW_TAG_far_type
     483                      .dwattr DW$64, DW_AT_type(*DW$T$25)
     484              DW$T$29 .dwtag  DW_TAG_const_type
     485                      .dwattr DW$T$29, DW_AT_type(*DW$64)
     486              
     487              DW$T$32 .dwtag  DW_TAG_structure_type
     488                      .dwattr DW$T$32, DW_AT_name("hwin")
     489                      .dwattr DW$T$32, DW_AT_byte_size(0x42)
     490              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     491                      .dwattr DW$65, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:17 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6482                            PAGE   14

     492                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     493                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     494              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     495                      .dwattr DW$66, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
     496                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     497                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     498              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     499                      .dwattr DW$67, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
     500                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     501                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     502              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     503                      .dwattr DW$68, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
     504                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     505                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     506              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     507                      .dwattr DW$69, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
     508                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     509                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     510              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     511                      .dwattr DW$70, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
     512                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     513                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     514              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     515                      .dwattr DW$71, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
     516                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     517                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     518              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     519                      .dwattr DW$72, DW_AT_name("type"), DW_AT_symbol_name("_type")
     520                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     521                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     522              DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     523                      .dwattr DW$73, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
     524                      .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     525                      .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     526              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     527                      .dwattr DW$74, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
     528                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     529                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     530              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     531                      .dwattr DW$75, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
     532                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     533                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     534              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     535                      .dwattr DW$76, DW_AT_name("nline"), DW_AT_symbol_name("_nline")
     536                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     537                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     538              DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     539                      .dwattr DW$77, DW_AT_name("nrow"), DW_AT_symbol_name("_nrow")
     540                      .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     541                      .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     542              DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     543                      .dwattr DW$78, DW_AT_name("grid_wide"), DW_AT_symbol_name("_grid_wide")
     544                      .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     545                      .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     546              DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:17 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6482                            PAGE   15

     547                      .dwattr DW$79, DW_AT_name("grid_high"), DW_AT_symbol_name("_grid_high")
     548                      .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     549                      .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     550              DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     551                      .dwattr DW$80, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
     552                      .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     553                      .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
     554              DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     555                      .dwattr DW$81, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
     556                      .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     557                      .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
     558              DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     559                      .dwattr DW$82, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
     560                      .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     561                      .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
     562              DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     563                      .dwattr DW$83, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
     564                      .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     565                      .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
     566              DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     567                      .dwattr DW$84, DW_AT_name("button_flags"), DW_AT_symbol_name("_button_flags")
     568                      .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     569                      .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
     570              DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     571                      .dwattr DW$85, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
     572                      .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
     573                      .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
     574              DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     575                      .dwattr DW$86, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
     576                      .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     577                      .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
     578              DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     579                      .dwattr DW$87, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
     580                      .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     581                      .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
     582              DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
     583                      .dwattr DW$88, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
     584                      .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     585                      .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
     586              DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
     587                      .dwattr DW$89, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
     588                      .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     589                      .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
     590              DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
     591                      .dwattr DW$90, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
     592                      .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
     593                      .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
     594              DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     595                      .dwattr DW$91, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
     596                      .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     597                      .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
     598                      .dwendtag DW$T$32
     599              
     600              DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
     601                      .dwattr DW$T$22, DW_AT_address_class(0x16)
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:17 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6482                            PAGE   16

     602              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
     603                      .dwattr DW$T$28, DW_AT_address_class(0x16)
     604              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
     605                      .dwattr DW$T$24, DW_AT_address_class(0x16)
     606              
     607              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
     608                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
     609                      .dwattr DW$T$26, DW_AT_byte_size(0x1e)
     610              DW$92   .dwtag  DW_TAG_subrange_type
     611                      .dwattr DW$92, DW_AT_upper_bound(0x1d)
     612                      .dwendtag DW$T$26
     613              
     614              DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
     615                      .dwattr DW$T$31, DW_AT_address_class(0x16)
     616              
     617              DW$T$27 .dwtag  DW_TAG_subroutine_type
     618                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     619              DW$93   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     620                      .dwendtag DW$T$27
     621              
     622              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$21)
     623                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     624              DW$T$3  .dwtag  DW_TAG_pointer_type
     625                      .dwattr DW$T$3, DW_AT_address_class(0x16)
     626              
     627              DW$T$21 .dwtag  DW_TAG_structure_type
     628                      .dwattr DW$T$21, DW_AT_name("edit_mem")
     629                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
     630              DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     631                      .dwattr DW$94, DW_AT_name("x"), DW_AT_symbol_name("_x")
     632                      .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     633                      .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
     634              DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     635                      .dwattr DW$95, DW_AT_name("y"), DW_AT_symbol_name("_y")
     636                      .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     637                      .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
     638              DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     639                      .dwattr DW$96, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
     640                      .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     641                      .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
     642              DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     643                      .dwattr DW$97, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
     644                      .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     645                      .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
     646              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     647                      .dwattr DW$98, DW_AT_name("id"), DW_AT_symbol_name("_id")
     648                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     649                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
     650              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     651                      .dwattr DW$99, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
     652                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     653                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
     654                      .dwendtag DW$T$21
     655              
     656              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:17 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6482                            PAGE   17

     657                      .dwattr DW$T$20, DW_AT_address_class(0x16)
     658              
     659                      .dwattr DW$37, DW_AT_external(0x01)
     660                      .dwattr DW$42, DW_AT_external(0x01)
     661                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     662              
     663              ;***************************************************************
     664              ;* DWARF CIE ENTRIES                                           *
     665              ;***************************************************************
     666              
     667              DW$CIE  .dwcie 1, 40
     668                      .dwcfa  0x0c, 20, 0
     669                      .dwcfa  0x07, 0
     670                      .dwcfa  0x07, 1
     671                      .dwcfa  0x07, 2
     672                      .dwcfa  0x07, 3
     673                      .dwcfa  0x07, 4
     674                      .dwcfa  0x07, 5
     675                      .dwcfa  0x08, 6
     676                      .dwcfa  0x08, 7
     677                      .dwcfa  0x08, 8
     678                      .dwcfa  0x08, 9
     679                      .dwcfa  0x08, 10
     680                      .dwcfa  0x08, 11
     681                      .dwcfa  0x07, 12
     682                      .dwcfa  0x07, 13
     683                      .dwcfa  0x07, 14
     684                      .dwcfa  0x07, 15
     685                      .dwcfa  0x07, 16
     686                      .dwcfa  0x07, 17
     687                      .dwcfa  0x07, 18
     688                      .dwcfa  0x07, 19
     689                      .dwcfa  0x07, 20
     690                      .dwcfa  0x07, 21
     691                      .dwcfa  0x07, 22
     692                      .dwcfa  0x07, 23
     693                      .dwcfa  0x07, 24
     694                      .dwcfa  0x07, 25
     695                      .dwcfa  0x07, 26
     696                      .dwcfa  0x08, 27
     697                      .dwcfa  0x07, 28
     698                      .dwcfa  0x07, 29
     699                      .dwcfa  0x07, 30
     700                      .dwcfa  0x07, 31
     701                      .dwcfa  0x07, 32
     702                      .dwcfa  0x07, 33
     703                      .dwcfa  0x07, 34
     704                      .dwcfa  0x07, 35
     705                      .dwcfa  0x07, 36
     706                      .dwcfa  0x07, 37
     707                      .dwcfa  0x07, 38
     708                      .dwcfa  0x07, 39
     709                      .dwcfa  0x07, 40
     710              
     711              ;***************************************************************
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:17 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6482                            PAGE   18

     712              ;* DWARF REGISTER MAP                                          *
     713              ;***************************************************************
     714              
     715              DW$100  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
     716                      .dwattr DW$100, DW_AT_location[DW_OP_reg0]
     717              DW$101  .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
     718                      .dwattr DW$101, DW_AT_location[DW_OP_reg1]
     719              DW$102  .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
