TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:34 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7002                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sat Oct 08 14:42:33 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_WIRmod_connect.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("app_WIRmod_result_display"), DW_AT_symbol_name("_app_WIRmod_re
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7002                            PAGE   27

    1208              DW$88   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$49)
    1209                      .dwendtag DW$T$50
    1210              
    1211              
    1212              DW$T$52 .dwtag  DW_TAG_subroutine_type
    1213                      .dwattr DW$T$52, DW_AT_language(DW_LANG_C)
    1214              DW$89   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$49)
    1215              DW$90   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1216                      .dwendtag DW$T$52
    1217              
    1218              
    1219              DW$T$56 .dwtag  DW_TAG_subroutine_type
    1220                      .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
    1221              DW$91   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$55)
    1222                      .dwendtag DW$T$56
    1223              
    1224              
    1225              DW$T$58 .dwtag  DW_TAG_subroutine_type
    1226                      .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
    1227              DW$92   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    1228                      .dwendtag DW$T$58
    1229              
    1230              
    1231              DW$T$60 .dwtag  DW_TAG_subroutine_type
    1232                      .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
    1233              DW$93   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1234                      .dwendtag DW$T$60
    1235              
    1236              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1237                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1238                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1239              DW$T$62 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
    1240                      .dwattr DW$T$62, DW_AT_address_class(0x16)
    1241              
    1242              DW$T$63 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
    1243                      .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    1244              DW$94   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$62)
    1245              DW$95   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1246                      .dwendtag DW$T$63
    1247              
    1248              DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$6)
    1249                      .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    1250              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    1251                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1252                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
    1253              
    1254              DW$T$66 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1255                      .dwattr DW$T$66, DW_AT_language(DW_LANG_C)
    1256              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1257                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1258                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1259              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
    1260                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    1261              
    1262              DW$T$70 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:34 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7002                            PAGE   28

    1263                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    1264              DW$96   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$69)
    1265                      .dwendtag DW$T$70
    1266              
    1267              
    1268              DW$T$72 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
    1269                      .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
    1270              DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
    1271                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    1272              DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("app_mod_inlet_t"), DW_AT_type(*DW$T$24)
    1273                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    1274              DW$T$69 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$68)
    1275                      .dwattr DW$T$69, DW_AT_address_class(0x16)
    1276              DW$T$73 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
    1277                      .dwattr DW$T$73, DW_AT_address_class(0x16)
    1278              
    1279              DW$T$74 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$73)
    1280                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    1281              DW$97   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$73)
    1282              DW$98   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$73)
    1283                      .dwendtag DW$T$74
    1284              
    1285              DW$T$49 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$48)
    1286                      .dwattr DW$T$49, DW_AT_address_class(0x16)
    1287              DW$T$54 .dwtag  DW_TAG_typedef, DW_AT_name("WIRresult_t"), DW_AT_type(*DW$T$40)
    1288                      .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    1289              DW$T$55 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$54)
    1290                      .dwattr DW$T$55, DW_AT_address_class(0x16)
    1291              
    1292              DW$T$24 .dwtag  DW_TAG_structure_type
    1293                      .dwattr DW$T$24, DW_AT_byte_size(0x06)
    1294              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1295                      .dwattr DW$99, DW_AT_name("mod_id"), DW_AT_symbol_name("_mod_id")
    1296                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1298              DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1299                      .dwattr DW$100, DW_AT_name("insmod_fun"), DW_AT_symbol_name("_insmod_fun")
    1300                      .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1301                      .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1302              DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1303                      .dwattr DW$101, DW_AT_name("exitmod_fun"), DW_AT_symbol_name("_exitmod_fun")
    1304                      .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1305                      .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1306                      .dwendtag DW$T$24
    1307              
    1308              DW$T$30 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1309                      .dwattr DW$T$30, DW_AT_encoding(DW_ATE_signed_char)
    1310                      .dwattr DW$T$30, DW_AT_byte_size(0x01)
    1311              DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$37)
    1312                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
    1313              
    1314              DW$T$40 .dwtag  DW_TAG_structure_type
    1315                      .dwattr DW$T$40, DW_AT_byte_size(0x19)
    1316              DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    1317                      .dwattr DW$102, DW_AT_name("Result_MUa"), DW_AT_symbol_name("_Result_MUa")
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:34 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7002                            PAGE   29

    1318                      .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1319                      .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1320              DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    1321                      .dwattr DW$103, DW_AT_name("Result_MUb"), DW_AT_symbol_name("_Result_MUb")
    1322                      .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1323                      .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1324              DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    1325                      .dwattr DW$104, DW_AT_name("Result_MUc"), DW_AT_symbol_name("_Result_MUc")
    1326                      .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1327                      .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1328              DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    1329                      .dwattr DW$105, DW_AT_name("Result_MIa"), DW_AT_symbol_name("_Result_MIa")
    1330                      .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1331                      .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1332              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    1333                      .dwattr DW$106, DW_AT_name("Result_MIb"), DW_AT_symbol_name("_Result_MIb")
    1334                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1335                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1336              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    1337                      .dwattr DW$107, DW_AT_name("Result_MIc"), DW_AT_symbol_name("_Result_MIc")
    1338                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1339                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1340              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1341                      .dwattr DW$108, DW_AT_name("phaseDir"), DW_AT_symbol_name("_phaseDir")
    1342                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1343                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1344              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1345                      .dwattr DW$109, DW_AT_name("verdict"), DW_AT_symbol_name("_verdict")
    1346                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1347                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1348              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1349                      .dwattr DW$110, DW_AT_name("jxmod"), DW_AT_symbol_name("_jxmod")
    1350                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1351                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1352              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1353                      .dwattr DW$111, DW_AT_name("WIR_cosoffset"), DW_AT_symbol_name("_WIR_cosoffset")
    1354                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1355                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1356                      .dwendtag DW$T$40
    1357              
    1358              DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("app_insmod_t"), DW_AT_type(*DW$T$21)
    1359                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    1360              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("app_exitmod_t"), DW_AT_type(*DW$T$21)
    1361                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    1362              
    1363              DW$T$38 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$30)
    1364                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    1365                      .dwattr DW$T$38, DW_AT_byte_size(0x03)
    1366              DW$112  .dwtag  DW_TAG_subrange_type
    1367                      .dwattr DW$112, DW_AT_upper_bound(0x02)
    1368                      .dwendtag DW$T$38
    1369              
    1370              
    1371              DW$T$39 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$30)
    1372                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:34 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7002                            PAGE   30

    1373                      .dwattr DW$T$39, DW_AT_byte_size(0x04)
    1374              DW$113  .dwtag  DW_TAG_subrange_type
    1375                      .dwattr DW$113, DW_AT_upper_bound(0x03)
    1376                      .dwendtag DW$T$39
    1377              
    1378              
    1379              DW$T$37 .dwtag  DW_TAG_structure_type
    1380                      .dwattr DW$T$37, DW_AT_name("hwin")
    1381                      .dwattr DW$T$37, DW_AT_byte_size(0x40)
    1382              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1383                      .dwattr DW$114, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    1384                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1386              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1387                      .dwattr DW$115, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    1388                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1389                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1390              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1391                      .dwattr DW$116, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    1392                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1393                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1394              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1395                      .dwattr DW$117, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    1396                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1397                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1398              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1399                      .dwattr DW$118, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    1400                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1401                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1402              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1403                      .dwattr DW$119, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    1404                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1405                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1406              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1407                      .dwattr DW$120, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    1408                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1409                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1410              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1411                      .dwattr DW$121, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    1412                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1413                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1414              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1415                      .dwattr DW$122, DW_AT_name("type"), DW_AT_symbol_name("_type")
    1416                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1417                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1418              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1419                      .dwattr DW$123, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    1420                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1421                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1422              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1423                      .dwattr DW$124, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    1424                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1425                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1426              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1427                      .dwattr DW$125, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:34 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7002                            PAGE   31

    1428                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1429                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1430              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1431                      .dwattr DW$126, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    1432                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1433                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1434              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1435                      .dwattr DW$127, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    1436                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1437                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1438              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1439                      .dwattr DW$128, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    1440                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1441                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1442              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    1443                      .dwattr DW$129, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
    1444                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1445                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1446              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1447                      .dwattr DW$130, DW_AT_name("button_flags"), DW_AT_symbol_name("_button_flags")
    1448                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1449                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1450              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1451                      .dwattr DW$131, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
    1452                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    1453                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1454              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1455                      .dwattr DW$132, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
    1456                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1457                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1458              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    1459                      .dwattr DW$133, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
    1460                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1461                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1462              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    1463                      .dwattr DW$134, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    1464                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1465                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1466              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1467                      .dwattr DW$135, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
    1468                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1469                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1470              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1471                      .dwattr DW$136, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    1472                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
    1473                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1474              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1475                      .dwattr DW$137, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
    1476                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1477                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1478                      .dwendtag DW$T$37
    1479              
    1480              DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
    1481                      .dwattr DW$T$27, DW_AT_address_class(0x16)
    1482              DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:34 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7002                            PAGE   32

    1483                      .dwattr DW$T$21, DW_AT_address_class(0x16)
    1484              DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    1485                      .dwattr DW$T$33, DW_AT_address_class(0x16)
    1486              DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
    1487                      .dwattr DW$T$29, DW_AT_address_class(0x16)
    1488              
    1489              DW$T$31 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$30)
    1490                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    1491                      .dwattr DW$T$31, DW_AT_byte_size(0x1e)
    1492              DW$138  .dwtag  DW_TAG_subrange_type
    1493                      .dwattr DW$138, DW_AT_upper_bound(0x1d)
    1494                      .dwendtag DW$T$31
    1495              
    1496              DW$T$36 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
    1497                      .dwattr DW$T$36, DW_AT_address_class(0x16)
    1498              DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$26)
    1499                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    1500              DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
    1501                      .dwattr DW$T$35, DW_AT_address_class(0x16)
    1502              
    1503              DW$T$26 .dwtag  DW_TAG_structure_type
    1504                      .dwattr DW$T$26, DW_AT_name("edit_mem")
    1505                      .dwattr DW$T$26, DW_AT_byte_size(0x08)
    1506              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1507                      .dwattr DW$139, DW_AT_name("x"), DW_AT_symbol_name("_x")
    1508                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1510              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1511                      .dwattr DW$140, DW_AT_name("y"), DW_AT_symbol_name("_y")
    1512                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1513                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1514              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1515                      .dwattr DW$141, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    1516                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1517                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1518              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1519                      .dwattr DW$142, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    1520                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1521                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1522              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1523                      .dwattr DW$143, DW_AT_name("id"), DW_AT_symbol_name("_id")
    1524                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1525                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1526              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1527                      .dwattr DW$144, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    1528                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1529                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1530              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1531                      .dwattr DW$145, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    1532                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1533                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1534                      .dwendtag DW$T$26
    1535              
    1536              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
    1537                      .dwattr DW$T$25, DW_AT_address_class(0x16)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:34 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7002                            PAGE   33

    1538              DW$146  .dwtag  DW_TAG_far_type
    1539                      .dwattr DW$146, DW_AT_type(*DW$T$30)
    1540              DW$T$34 .dwtag  DW_TAG_const_type
    1541                      .dwattr DW$T$34, DW_AT_type(*DW$146)
    1542              
    1543                      .dwattr DW$48, DW_AT_external(0x01)
    1544                      .dwattr DW$48, DW_AT_type(*DW$T$19)
    1545                      .dwattr DW$47, DW_AT_external(0x01)
    1546                      .dwattr DW$75, DW_AT_external(0x01)
    1547                      .dwattr DW$54, DW_AT_external(0x01)
    1548                      .dwattr DW$46, DW_AT_external(0x01)
    1549                      .dwattr DW$45, DW_AT_external(0x01)
    1550                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1551              
    1552              ;***************************************************************
    1553              ;* DWARF CIE ENTRIES                                           *
    1554              ;***************************************************************
    1555              
    1556              DW$CIE  .dwcie 1, 40
    1557                      .dwcfa  0x0c, 20, 0
    1558                      .dwcfa  0x07, 0
    1559                      .dwcfa  0x07, 1
    1560                      .dwcfa  0x07, 2
    1561                      .dwcfa  0x07, 3
    1562                      .dwcfa  0x07, 4
    1563                      .dwcfa  0x07, 5
    1564                      .dwcfa  0x08, 6
    1565                      .dwcfa  0x08, 7
    1566                      .dwcfa  0x08, 8
    1567                      .dwcfa  0x08, 9
    1568                      .dwcfa  0x08, 10
    1569                      .dwcfa  0x08, 11
    1570                      .dwcfa  0x07, 12
    1571                      .dwcfa  0x07, 13
    1572                      .dwcfa  0x07, 14
    1573                      .dwcfa  0x07, 15
    1574                      .dwcfa  0x07, 16
    1575                      .dwcfa  0x07, 17
    1576                      .dwcfa  0x07, 18
    1577                      .dwcfa  0x07, 19
    1578                      .dwcfa  0x07, 20
    1579                      .dwcfa  0x07, 21
    1580                      .dwcfa  0x07, 22
    1581                      .dwcfa  0x07, 23
    1582                      .dwcfa  0x07, 24
    1583                      .dwcfa  0x07, 25
    1584                      .dwcfa  0x07, 26
    1585                      .dwcfa  0x08, 27
    1586                      .dwcfa  0x07, 28
    1587                      .dwcfa  0x07, 29
    1588                      .dwcfa  0x07, 30
    1589                      .dwcfa  0x07, 31
    1590                      .dwcfa  0x07, 32
    1591                      .dwcfa  0x07, 33
    1592                      .dwcfa  0x07, 34
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:42:34 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7002                            PAGE   34

    1593                      .dwcfa  0x07, 35
    1594                      .dwcfa  0x07, 36
    1595                      .dwcfa  0x07, 37
    1596                      .dwcfa  0x07, 38
    1597                      .dwcfa  0x07, 39
    1598                      .dwcfa  0x07, 40
    1599              
    1600              ;***************************************************************
