TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:15 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9963                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Fri Dec 17 15:39:15 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_USBmod_fun.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

     453                      .global _app_module_assign_mod
     454                      .global _OSTimeDly
     455                      .global _os_task_assign_stk_build
     456                      .global _app_help_updata_entery
     457                      .global _os_task_delete
     458                      .global _app_global_key_obtain
     459                      .global _app_USBmod_window_destroy
     460                      .global _os_task_name_set
     461                      .global _g_module_id_array
     462              
     463              ;***************************************************************
     464              ;* TYPE INFORMATION                                            *
     465              ;***************************************************************
     466              DW$T$3  .dwtag  DW_TAG_pointer_type
     467                      .dwattr DW$T$3, DW_AT_address_class(0x16)
     468              
     469              DW$T$22 .dwtag  DW_TAG_subroutine_type
     470                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
     471              DW$45   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$21)
     472                      .dwendtag DW$T$22
     473              
     474              
     475              DW$T$24 .dwtag  DW_TAG_subroutine_type
     476                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
     477              DW$46   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     478                      .dwendtag DW$T$24
     479              
     480              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
     481                      .dwattr DW$T$25, DW_AT_address_class(0x16)
     482              
     483              DW$T$26 .dwtag  DW_TAG_subroutine_type
     484                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
     485              DW$47   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     486                      .dwendtag DW$T$26
     487              
     488              
     489              DW$T$28 .dwtag  DW_TAG_subroutine_type
     490                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     491              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     492                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     493                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
     494              
     495              DW$T$30 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     496                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     497              DW$48   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
     498              DW$49   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     499                      .dwendtag DW$T$30
     500              
     501              
     502              DW$T$34 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     503                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     504              DW$50   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     505              DW$51   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
     506                      .dwendtag DW$T$34
     507              
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:15 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9963                            PAGE   11

     508              
     509              DW$T$36 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     510                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
     511              DW$52   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     512                      .dwendtag DW$T$36
     513              
     514              DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
     515                      .dwattr DW$T$38, DW_AT_address_class(0x16)
     516              
     517              DW$T$39 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     518                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     519              DW$53   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
     520              DW$54   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     521                      .dwendtag DW$T$39
     522              
     523              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     524                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     525                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     526              
     527              DW$T$41 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     528                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
     529              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
     530                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     531              DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
     532                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
     533              DW$T$43 .dwtag  DW_TAG_typedef, DW_AT_name("module_id_t"), DW_AT_type(*DW$T$20)
     534                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
     535              DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
     536                      .dwattr DW$T$33, DW_AT_address_class(0x16)
     537              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     538                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     539                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     540              
     541              DW$T$20 .dwtag  DW_TAG_structure_type
     542                      .dwattr DW$T$20, DW_AT_byte_size(0x0b)
     543              DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     544                      .dwattr DW$55, DW_AT_name("DL_measure_mod_id"), DW_AT_symbol_name("_DL_measure_mod_id")
     545                      .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     546                      .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     547              DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     548                      .dwattr DW$56, DW_AT_name("Sys_setup_mod_id"), DW_AT_symbol_name("_Sys_setup_mod_id")
     549                      .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     550                      .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     551              DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     552                      .dwattr DW$57, DW_AT_name("USB_mod_id"), DW_AT_symbol_name("_USB_mod_id")
     553                      .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     554                      .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     555              DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     556                      .dwattr DW$58, DW_AT_name("RM_mod_id"), DW_AT_symbol_name("_RM_mod_id")
     557                      .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     558                      .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     559              DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     560                      .dwattr DW$59, DW_AT_name("PC_mod_id"), DW_AT_symbol_name("_PC_mod_id")
     561                      .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     562                      .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:15 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9963                            PAGE   12

     563              DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     564                      .dwattr DW$60, DW_AT_name("Help_mod_id"), DW_AT_symbol_name("_Help_mod_id")
     565                      .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     566                      .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     567              DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     568                      .dwattr DW$61, DW_AT_name("HZ_input_mod_id"), DW_AT_symbol_name("_HZ_input_mod_id")
     569                      .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     570                      .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     571              DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     572                      .dwattr DW$62, DW_AT_name("Link_detect_mod_id"), DW_AT_symbol_name("_Link_detect_mod_id")
     573                      .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     574                      .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     575              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     576                      .dwattr DW$63, DW_AT_name("Err_correct_mod_id"), DW_AT_symbol_name("_Err_correct_mod_id")
     577                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     578                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     579              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     580                      .dwattr DW$64, DW_AT_name("Wave_mod_id"), DW_AT_symbol_name("_Wave_mod_id")
     581                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     582                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     583              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     584                      .dwattr DW$65, DW_AT_name("USER_mod_id"), DW_AT_symbol_name("_USER_mod_id")
     585                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     586                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     587                      .dwendtag DW$T$20
     588              
     589              DW$T$32 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     590                      .dwattr DW$T$32, DW_AT_encoding(DW_ATE_signed_char)
     591                      .dwattr DW$T$32, DW_AT_byte_size(0x01)
     592              
     593                      .dwattr DW$43, DW_AT_external(0x01)
     594                      .dwattr DW$44, DW_AT_external(0x01)
     595                      .dwattr DW$22, DW_AT_external(0x01)
     596                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     597              
     598              ;***************************************************************
     599              ;* DWARF CIE ENTRIES                                           *
     600              ;***************************************************************
     601              
     602              DW$CIE  .dwcie 1, 40
     603                      .dwcfa  0x0c, 20, 0
     604                      .dwcfa  0x07, 0
     605                      .dwcfa  0x07, 1
     606                      .dwcfa  0x07, 2
     607                      .dwcfa  0x07, 3
     608                      .dwcfa  0x07, 4
     609                      .dwcfa  0x07, 5
     610                      .dwcfa  0x08, 6
     611                      .dwcfa  0x08, 7
     612                      .dwcfa  0x08, 8
     613                      .dwcfa  0x08, 9
     614                      .dwcfa  0x08, 10
     615                      .dwcfa  0x08, 11
     616                      .dwcfa  0x07, 12
     617                      .dwcfa  0x07, 13
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:15 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9963                            PAGE   13

     618                      .dwcfa  0x07, 14
     619                      .dwcfa  0x07, 15
     620                      .dwcfa  0x07, 16
     621                      .dwcfa  0x07, 17
     622                      .dwcfa  0x07, 18
     623                      .dwcfa  0x07, 19
     624                      .dwcfa  0x07, 20
     625                      .dwcfa  0x07, 21
     626                      .dwcfa  0x07, 22
     627                      .dwcfa  0x07, 23
     628                      .dwcfa  0x07, 24
     629                      .dwcfa  0x07, 25
     630                      .dwcfa  0x07, 26
     631                      .dwcfa  0x08, 27
     632                      .dwcfa  0x07, 28
     633                      .dwcfa  0x07, 29
     634                      .dwcfa  0x07, 30
     635                      .dwcfa  0x07, 31
     636                      .dwcfa  0x07, 32
     637                      .dwcfa  0x07, 33
     638                      .dwcfa  0x07, 34
     639                      .dwcfa  0x07, 35
     640                      .dwcfa  0x07, 36
     641                      .dwcfa  0x07, 37
     642                      .dwcfa  0x07, 38
     643                      .dwcfa  0x07, 39
     644                      .dwcfa  0x07, 40
     645              
     646              ;***************************************************************
     647              ;* DWARF REGISTER MAP                                          *
     648              ;***************************************************************
     649              
     650              DW$66   .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
     651                      .dwattr DW$66, DW_AT_location[DW_OP_reg0]
     652              DW$67   .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
     653                      .dwattr DW$67, DW_AT_location[DW_OP_reg1]
     654              DW$68   .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
