TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Fri Dec 17 15:39:16 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_USBmod_hzlib_updata.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

     858                      .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
     859              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     860                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     861                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     862              
     863              DW$T$63 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     864                      .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
     865              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     866                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     867                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     868              DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
     869                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
     870              DW$T$12 .dwtag  DW_TAG_base_type, DW_AT_name("long")
     871                      .dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
     872                      .dwattr DW$T$12, DW_AT_byte_size(0x02)
     873              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
     874                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     875                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
     876              
     877              DW$T$66 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$13)
     878                      .dwattr DW$T$66, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   23

     879              DW$109  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$59)
     880              DW$110  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
     881              DW$111  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$59)
     882                      .dwendtag DW$T$66
     883              
     884              DW$T$19 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     885                      .dwattr DW$T$19, DW_AT_encoding(DW_ATE_signed_char)
     886                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
     887              
     888              DW$T$68 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$32)
     889                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
     890                      .dwattr DW$T$68, DW_AT_byte_size(0x04)
     891              DW$112  .dwtag  DW_TAG_subrange_type
     892                      .dwattr DW$112, DW_AT_upper_bound(0x01)
     893                      .dwendtag DW$T$68
     894              
     895              DW$T$37 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
     896                      .dwattr DW$T$37, DW_AT_address_class(0x16)
     897              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("log_param"), DW_AT_type(*DW$T$21)
     898                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     899              DW$T$39 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
     900                      .dwattr DW$T$39, DW_AT_address_class(0x16)
     901              DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$46)
     902                      .dwattr DW$T$47, DW_AT_address_class(0x16)
     903              
     904              DW$T$75 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$47)
     905                      .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
     906              
     907              DW$T$77 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$47)
     908                      .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
     909              DW$113  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     910              DW$114  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     911              DW$115  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     912              DW$116  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     913              DW$117  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     914              DW$118  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$47)
     915                      .dwendtag DW$T$77
     916              
     917              
     918              DW$T$79 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$47)
     919                      .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
     920              DW$119  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     921              DW$120  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     922              DW$121  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     923              DW$122  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     924              DW$123  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
     925              DW$124  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     926              DW$125  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$47)
     927                      .dwendtag DW$T$79
     928              
     929              DW$T$60 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$6)
     930                      .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
     931              DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
     932                      .dwattr DW$T$32, DW_AT_address_class(0x16)
     933              
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   24

     934              DW$T$21 .dwtag  DW_TAG_structure_type
     935                      .dwattr DW$T$21, DW_AT_byte_size(0x28)
     936              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     937                      .dwattr DW$126, DW_AT_name("pram_buf"), DW_AT_symbol_name("_pram_buf")
     938                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
     940              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
     941                      .dwattr DW$127, DW_AT_name("cur_off"), DW_AT_symbol_name("_cur_off")
     942                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     943                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
     944              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     945                      .dwattr DW$128, DW_AT_name("parm_0"), DW_AT_symbol_name("_parm_0")
     946                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     947                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
     948              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     949                      .dwattr DW$129, DW_AT_name("parm_1"), DW_AT_symbol_name("_parm_1")
     950                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     951                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
     952              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     953                      .dwattr DW$130, DW_AT_name("parm_2"), DW_AT_symbol_name("_parm_2")
     954                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     955                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
     956              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     957                      .dwattr DW$131, DW_AT_name("parm_3"), DW_AT_symbol_name("_parm_3")
     958                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     959                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
     960              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     961                      .dwattr DW$132, DW_AT_name("parm_4"), DW_AT_symbol_name("_parm_4")
     962                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     963                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
     964              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     965                      .dwattr DW$133, DW_AT_name("parm_5"), DW_AT_symbol_name("_parm_5")
     966                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     967                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
     968              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     969                      .dwattr DW$134, DW_AT_name("end_pram"), DW_AT_symbol_name("_end_pram")
     970                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     971                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
     972                      .dwendtag DW$T$21
     973              
     974              DW$T$46 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$34)
     975                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
     976              
     977              DW$T$20 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
     978                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     979                      .dwattr DW$T$20, DW_AT_byte_size(0x18)
     980              DW$135  .dwtag  DW_TAG_subrange_type
     981                      .dwattr DW$135, DW_AT_upper_bound(0x17)
     982                      .dwendtag DW$T$20
     983              
     984              DW$136  .dwtag  DW_TAG_far_type
     985                      .dwattr DW$136, DW_AT_type(*DW$T$19)
     986              DW$T$31 .dwtag  DW_TAG_const_type
     987                      .dwattr DW$T$31, DW_AT_type(*DW$136)
     988              
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   25

     989              DW$T$34 .dwtag  DW_TAG_structure_type
     990                      .dwattr DW$T$34, DW_AT_name("hwin")
     991                      .dwattr DW$T$34, DW_AT_byte_size(0x42)
     992              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     993                      .dwattr DW$137, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
     994                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
     996              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     997                      .dwattr DW$138, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
     998                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     999                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1000              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1001                      .dwattr DW$139, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    1002                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1003                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1004              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1005                      .dwattr DW$140, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    1006                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1007                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1008              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1009                      .dwattr DW$141, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    1010                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1011                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1012              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1013                      .dwattr DW$142, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    1014                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1015                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1016              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1017                      .dwattr DW$143, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    1018                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1019                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1020              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1021                      .dwattr DW$144, DW_AT_name("type"), DW_AT_symbol_name("_type")
    1022                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1023                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1024              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1025                      .dwattr DW$145, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    1026                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1027                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1028              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1029                      .dwattr DW$146, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    1030                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1031                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1032              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1033                      .dwattr DW$147, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
    1034                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1035                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1036              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1037                      .dwattr DW$148, DW_AT_name("nline"), DW_AT_symbol_name("_nline")
    1038                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1039                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1040              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1041                      .dwattr DW$149, DW_AT_name("nrow"), DW_AT_symbol_name("_nrow")
    1042                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1043                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   26

    1044              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1045                      .dwattr DW$150, DW_AT_name("grid_wide"), DW_AT_symbol_name("_grid_wide")
    1046                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1047                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1048              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1049                      .dwattr DW$151, DW_AT_name("grid_high"), DW_AT_symbol_name("_grid_high")
    1050                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1051                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1052              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1053                      .dwattr DW$152, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    1054                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1055                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1056              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1057                      .dwattr DW$153, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    1058                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1059                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1060              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1061                      .dwattr DW$154, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    1062                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1063                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1064              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1065                      .dwattr DW$155, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
    1066                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1067                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1068              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1069                      .dwattr DW$156, DW_AT_name("button_flags"), DW_AT_symbol_name("_button_flags")
    1070                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1071                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1072              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1073                      .dwattr DW$157, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
    1074                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    1075                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1076              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1077                      .dwattr DW$158, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
    1078                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1079                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1080              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1081                      .dwattr DW$159, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
    1082                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1083                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1084              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    1085                      .dwattr DW$160, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    1086                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1087                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1088              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1089                      .dwattr DW$161, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
    1090                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1091                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1092              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1093                      .dwattr DW$162, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    1094                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    1095                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1096              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1097                      .dwattr DW$163, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
    1098                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   27

    1099                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1100                      .dwendtag DW$T$34
    1101              
    1102              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
    1103                      .dwattr DW$T$25, DW_AT_address_class(0x16)
    1104              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    1105                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    1106              
    1107              DW$T$28 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    1108                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    1109                      .dwattr DW$T$28, DW_AT_byte_size(0x1e)
    1110              DW$164  .dwtag  DW_TAG_subrange_type
    1111                      .dwattr DW$164, DW_AT_upper_bound(0x1d)
    1112                      .dwendtag DW$T$28
    1113              
    1114              DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    1115                      .dwattr DW$T$33, DW_AT_address_class(0x16)
    1116              DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
    1117                      .dwattr DW$T$27, DW_AT_address_class(0x16)
    1118              DW$T$26 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$24)
    1119                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    1120              
    1121              DW$T$24 .dwtag  DW_TAG_structure_type
    1122                      .dwattr DW$T$24, DW_AT_name("edit_mem")
    1123                      .dwattr DW$T$24, DW_AT_byte_size(0x08)
    1124              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1125                      .dwattr DW$165, DW_AT_name("x"), DW_AT_symbol_name("_x")
    1126                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1127                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1128              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1129                      .dwattr DW$166, DW_AT_name("y"), DW_AT_symbol_name("_y")
    1130                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1131                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1132              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1133                      .dwattr DW$167, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    1134                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1135                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1136              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1137                      .dwattr DW$168, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    1138                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1139                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1140              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1141                      .dwattr DW$169, DW_AT_name("id"), DW_AT_symbol_name("_id")
    1142                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1143                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1144              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1145                      .dwattr DW$170, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    1146                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1147                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1148                      .dwendtag DW$T$24
    1149              
    1150              DW$T$23 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    1151                      .dwattr DW$T$23, DW_AT_address_class(0x16)
    1152              
    1153                      .dwattr DW$80, DW_AT_type(*DW$T$60)
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   28

    1154                      .dwattr DW$91, DW_AT_external(0x01)
    1155                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1156              
    1157              ;***************************************************************
    1158              ;* DWARF CIE ENTRIES                                           *
    1159              ;***************************************************************
    1160              
    1161              DW$CIE  .dwcie 1, 40
    1162                      .dwcfa  0x0c, 20, 0
    1163                      .dwcfa  0x07, 0
    1164                      .dwcfa  0x07, 1
    1165                      .dwcfa  0x07, 2
    1166                      .dwcfa  0x07, 3
    1167                      .dwcfa  0x07, 4
    1168                      .dwcfa  0x07, 5
    1169                      .dwcfa  0x08, 6
    1170                      .dwcfa  0x08, 7
    1171                      .dwcfa  0x08, 8
    1172                      .dwcfa  0x08, 9
    1173                      .dwcfa  0x08, 10
    1174                      .dwcfa  0x08, 11
    1175                      .dwcfa  0x07, 12
    1176                      .dwcfa  0x07, 13
    1177                      .dwcfa  0x07, 14
    1178                      .dwcfa  0x07, 15
    1179                      .dwcfa  0x07, 16
    1180                      .dwcfa  0x07, 17
    1181                      .dwcfa  0x07, 18
    1182                      .dwcfa  0x07, 19
    1183                      .dwcfa  0x07, 20
    1184                      .dwcfa  0x07, 21
    1185                      .dwcfa  0x07, 22
    1186                      .dwcfa  0x07, 23
    1187                      .dwcfa  0x07, 24
    1188                      .dwcfa  0x07, 25
    1189                      .dwcfa  0x07, 26
    1190                      .dwcfa  0x08, 27
    1191                      .dwcfa  0x07, 28
    1192                      .dwcfa  0x07, 29
    1193                      .dwcfa  0x07, 30
    1194                      .dwcfa  0x07, 31
    1195                      .dwcfa  0x07, 32
    1196                      .dwcfa  0x07, 33
    1197                      .dwcfa  0x07, 34
    1198                      .dwcfa  0x07, 35
    1199                      .dwcfa  0x07, 36
    1200                      .dwcfa  0x07, 37
    1201                      .dwcfa  0x07, 38
    1202                      .dwcfa  0x07, 39
    1203                      .dwcfa  0x07, 40
    1204              
    1205              ;***************************************************************
    1206              ;* DWARF REGISTER MAP                                          *
    1207              ;***************************************************************
    1208              
TMS320C2000 COFF Assembler PC v4.1.3 Fri Dec 17 15:39:16 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9602                            PAGE   29

    1209              DW$171  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    1210                      .dwattr DW$171, DW_AT_location[DW_OP_reg0]
    1211              DW$172  .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
    1212                      .dwattr DW$172, DW_AT_location[DW_OP_reg1]
