TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:09 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8122                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Sep 15 15:05:08 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_WIRmod_interface.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    3512                      .dwattr DW$T$109, DW_AT_language(DW_LANG_C)
    3513              
    3514              DW$T$111        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$49)
    3515                      .dwattr DW$T$111, DW_AT_language(DW_LANG_C)
    3516              DW$261  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3517              DW$262  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3518              DW$263  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    3519              DW$264  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    3520              DW$265  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    3521              DW$266  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$49)
    3522                      .dwendtag DW$T$111
    3523              
    3524              
    3525              DW$T$113        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$49)
    3526                      .dwattr DW$T$113, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:09 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8122                            PAGE   79

    3527              DW$267  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3528              DW$268  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3529              DW$269  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    3530              DW$270  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    3531              DW$271  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$54)
    3532              DW$272  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    3533              DW$273  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$49)
    3534                      .dwendtag DW$T$113
    3535              
    3536              
    3537              DW$T$115        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$49)
    3538                      .dwattr DW$T$115, DW_AT_language(DW_LANG_C)
    3539              DW$274  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3540              DW$275  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3541              DW$276  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
    3542              DW$277  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    3543              DW$278  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$49)
    3544                      .dwendtag DW$T$115
    3545              
    3546              DW$T$40 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$39)
    3547                      .dwattr DW$T$40, DW_AT_address_class(0x16)
    3548              
    3549              DW$T$117        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$40)
    3550                      .dwattr DW$T$117, DW_AT_language(DW_LANG_C)
    3551              DW$279  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3552              DW$280  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3553              DW$281  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    3554              DW$282  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3555                      .dwendtag DW$T$117
    3556              
    3557              DW$T$76 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$75)
    3558                      .dwattr DW$T$76, DW_AT_address_class(0x16)
    3559              DW$T$81 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$80)
    3560                      .dwattr DW$T$81, DW_AT_address_class(0x16)
    3561              DW$T$119        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
    3562                      .dwattr DW$T$119, DW_AT_address_class(0x16)
    3563              DW$T$120        .dwtag  DW_TAG_typedef, DW_AT_name("draw_coord_t"), DW_AT_type(*DW$T$43)
    3564                      .dwattr DW$T$120, DW_AT_language(DW_LANG_C)
    3565              DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    3566                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
    3567                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    3568              DW$283  .dwtag  DW_TAG_far_type
    3569                      .dwattr DW$283, DW_AT_type(*DW$T$25)
    3570              DW$T$29 .dwtag  DW_TAG_const_type
    3571                      .dwattr DW$T$29, DW_AT_type(*DW$283)
    3572              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    3573                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    3574              DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$32)
    3575                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
    3576              DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("ELEcomponent_t"), DW_AT_type(*DW$T$33)
    3577                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    3578              DW$T$75 .dwtag  DW_TAG_typedef, DW_AT_name("WIRresult_t"), DW_AT_type(*DW$T$36)
    3579                      .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
    3580              DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("WIR_ALG_t"), DW_AT_type(*DW$T$38)
    3581                      .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:09 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8122                            PAGE   80

    3582              DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("comp_branch_t"), DW_AT_type(*DW$T$41)
    3583                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
    3584              
    3585              DW$T$43 .dwtag  DW_TAG_structure_type
    3586                      .dwattr DW$T$43, DW_AT_byte_size(0x24)
    3587              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3588                      .dwattr DW$284, DW_AT_name("Ua"), DW_AT_symbol_name("_Ua")
    3589                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3590                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3591              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3592                      .dwattr DW$285, DW_AT_name("Ub"), DW_AT_symbol_name("_Ub")
    3593                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3594                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3595              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3596                      .dwattr DW$286, DW_AT_name("Uc"), DW_AT_symbol_name("_Uc")
    3597                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3598                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3599              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3600                      .dwattr DW$287, DW_AT_name("Ia_add"), DW_AT_symbol_name("_Ia_add")
    3601                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3602                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3603              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3604                      .dwattr DW$288, DW_AT_name("Ia_sub"), DW_AT_symbol_name("_Ia_sub")
    3605                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3606                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3607              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3608                      .dwattr DW$289, DW_AT_name("Ib_add"), DW_AT_symbol_name("_Ib_add")
    3609                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3610                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3611              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3612                      .dwattr DW$290, DW_AT_name("Ib_sub"), DW_AT_symbol_name("_Ib_sub")
    3613                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3614                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3615              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3616                      .dwattr DW$291, DW_AT_name("Ic_add"), DW_AT_symbol_name("_Ic_add")
    3617                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3618                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3619              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3620                      .dwattr DW$292, DW_AT_name("Ic_sub"), DW_AT_symbol_name("_Ic_sub")
    3621                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3622                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3623                      .dwendtag DW$T$43
    3624              
    3625              
    3626              DW$T$32 .dwtag  DW_TAG_structure_type
    3627                      .dwattr DW$T$32, DW_AT_name("hwin")
    3628                      .dwattr DW$T$32, DW_AT_byte_size(0x42)
    3629              DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3630                      .dwattr DW$293, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    3631                      .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3632                      .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3633              DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3634                      .dwattr DW$294, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    3635                      .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3636                      .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:09 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8122                            PAGE   81

    3637              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3638                      .dwattr DW$295, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    3639                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3640                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3641              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3642                      .dwattr DW$296, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    3643                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3644                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3645              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3646                      .dwattr DW$297, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    3647                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3648                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3649              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3650                      .dwattr DW$298, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    3651                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3652                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3653              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3654                      .dwattr DW$299, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    3655                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3656                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3657              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3658                      .dwattr DW$300, DW_AT_name("type"), DW_AT_symbol_name("_type")
    3659                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3660                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3661              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    3662                      .dwattr DW$301, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    3663                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3664                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3665              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    3666                      .dwattr DW$302, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    3667                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3668                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3669              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    3670                      .dwattr DW$303, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
    3671                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3672                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3673              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3674                      .dwattr DW$304, DW_AT_name("nline"), DW_AT_symbol_name("_nline")
    3675                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3676                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3677              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3678                      .dwattr DW$305, DW_AT_name("nrow"), DW_AT_symbol_name("_nrow")
    3679                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3680                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3681              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3682                      .dwattr DW$306, DW_AT_name("grid_wide"), DW_AT_symbol_name("_grid_wide")
    3683                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3684                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3685              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3686                      .dwattr DW$307, DW_AT_name("grid_high"), DW_AT_symbol_name("_grid_high")
    3687                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3688                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3689              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    3690                      .dwattr DW$308, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    3691                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:09 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8122                            PAGE   82

    3692                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3693              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    3694                      .dwattr DW$309, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    3695                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3696                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3697              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    3698                      .dwattr DW$310, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    3699                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3700                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3701              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    3702                      .dwattr DW$311, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
    3703                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3704                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3705              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3706                      .dwattr DW$312, DW_AT_name("button_flags"), DW_AT_symbol_name("_button_flags")
    3707                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3708                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3709              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3710                      .dwattr DW$313, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
    3711                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    3712                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3713              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3714                      .dwattr DW$314, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
    3715                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3716                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3717              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    3718                      .dwattr DW$315, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
    3719                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3720                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3721              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3722                      .dwattr DW$316, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    3723                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3724                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3725              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3726                      .dwattr DW$317, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
    3727                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3728                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3729              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3730                      .dwattr DW$318, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    3731                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    3732                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3733              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3734                      .dwattr DW$319, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
    3735                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3736                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3737                      .dwendtag DW$T$32
    3738              
    3739              DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    3740                      .dwattr DW$T$22, DW_AT_address_class(0x16)
    3741              
    3742              DW$T$33 .dwtag  DW_TAG_structure_type
    3743                      .dwattr DW$T$33, DW_AT_byte_size(0x04)
    3744              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3745                      .dwattr DW$320, DW_AT_name("type"), DW_AT_symbol_name("_type")
    3746                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:09 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8122                            PAGE   83

    3747                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3748              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3749                      .dwattr DW$321, DW_AT_name("exp"), DW_AT_symbol_name("_exp")
    3750                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3751                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3752              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3753                      .dwattr DW$322, DW_AT_name("x"), DW_AT_symbol_name("_x")
    3754                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3755                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3756              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3757                      .dwattr DW$323, DW_AT_name("y"), DW_AT_symbol_name("_y")
    3758                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3759                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3760                      .dwendtag DW$T$33
    3761              
    3762              
    3763              DW$T$36 .dwtag  DW_TAG_structure_type
    3764                      .dwattr DW$T$36, DW_AT_byte_size(0x19)
    3765              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    3766                      .dwattr DW$324, DW_AT_name("Result_MUa"), DW_AT_symbol_name("_Result_MUa")
    3767                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3768                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3769              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    3770                      .dwattr DW$325, DW_AT_name("Result_MUb"), DW_AT_symbol_name("_Result_MUb")
    3771                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3772                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3773              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    3774                      .dwattr DW$326, DW_AT_name("Result_MUc"), DW_AT_symbol_name("_Result_MUc")
    3775                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3776                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3777              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    3778                      .dwattr DW$327, DW_AT_name("Result_MIa"), DW_AT_symbol_name("_Result_MIa")
    3779                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3780                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3781              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    3782                      .dwattr DW$328, DW_AT_name("Result_MIb"), DW_AT_symbol_name("_Result_MIb")
    3783                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3784                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3785              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    3786                      .dwattr DW$329, DW_AT_name("Result_MIc"), DW_AT_symbol_name("_Result_MIc")
    3787                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3788                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3789              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3790                      .dwattr DW$330, DW_AT_name("phaseDir"), DW_AT_symbol_name("_phaseDir")
    3791                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3792                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3793              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3794                      .dwattr DW$331, DW_AT_name("verdict"), DW_AT_symbol_name("_verdict")
    3795                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3796                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3797              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3798                      .dwattr DW$332, DW_AT_name("jxmod"), DW_AT_symbol_name("_jxmod")
    3799                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    3800                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3801              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:09 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8122                            PAGE   84

    3802                      .dwattr DW$333, DW_AT_name("WIR_cosoffset"), DW_AT_symbol_name("_WIR_cosoffset")
    3803                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3804                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3805                      .dwendtag DW$T$36
    3806              
    3807              
    3808              DW$T$38 .dwtag  DW_TAG_structure_type
    3809                      .dwattr DW$T$38, DW_AT_byte_size(0x45)
    3810              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3811                      .dwattr DW$334, DW_AT_name("is_lost_UI"), DW_AT_symbol_name("_is_lost_UI")
    3812                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3813                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3814              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3815                      .dwattr DW$335, DW_AT_name("Ua_lost"), DW_AT_symbol_name("_Ua_lost")
    3816                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3817                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3818              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3819                      .dwattr DW$336, DW_AT_name("Ub_lost"), DW_AT_symbol_name("_Ub_lost")
    3820                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3821                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3822              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3823                      .dwattr DW$337, DW_AT_name("Uc_lost"), DW_AT_symbol_name("_Uc_lost")
    3824                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3825                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3826              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3827                      .dwattr DW$338, DW_AT_name("Ia_lost"), DW_AT_symbol_name("_Ia_lost")
    3828                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3829                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3830              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3831                      .dwattr DW$339, DW_AT_name("Ib_lost"), DW_AT_symbol_name("_Ib_lost")
    3832                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3833                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3834              DW$340  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3835                      .dwattr DW$340, DW_AT_name("Ic_lost"), DW_AT_symbol_name("_Ic_lost")
    3836                      .dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3837                      .dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3838              DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3839                      .dwattr DW$341, DW_AT_name("phaseDir"), DW_AT_symbol_name("_phaseDir")
    3840                      .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3841                      .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3842              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3843                      .dwattr DW$342, DW_AT_name("c_cos"), DW_AT_symbol_name("_c_cos")
    3844                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3845                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3846              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3847                      .dwattr DW$343, DW_AT_name("c_U"), DW_AT_symbol_name("_c_U")
    3848                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3849                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3850              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3851                      .dwattr DW$344, DW_AT_name("c_I"), DW_AT_symbol_name("_c_I")
    3852                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3853                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3854              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3855                      .dwattr DW$345, DW_AT_name("jxmod"), DW_AT_symbol_name("_jxmod")
    3856                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:09 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8122                            PAGE   85

    3857                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3858                      .dwendtag DW$T$38
    3859              
    3860              
    3861              DW$T$41 .dwtag  DW_TAG_structure_type
    3862                      .dwattr DW$T$41, DW_AT_byte_size(0x04)
    3863              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    3864                      .dwattr DW$346, DW_AT_name("pcomp"), DW_AT_symbol_name("_pcomp")
    3865                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3866                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3867              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3868                      .dwattr DW$347, DW_AT_name("branch"), DW_AT_symbol_name("_branch")
    3869                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3870                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3871                      .dwendtag DW$T$41
    3872              
    3873              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
    3874                      .dwattr DW$T$28, DW_AT_address_class(0x16)
    3875              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    3876                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    3877              
    3878              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    3879                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    3880                      .dwattr DW$T$26, DW_AT_byte_size(0x1e)
    3881              DW$348  .dwtag  DW_TAG_subrange_type
    3882                      .dwattr DW$348, DW_AT_upper_bound(0x1d)
    3883                      .dwendtag DW$T$26
    3884              
    3885              
    3886              DW$T$35 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    3887                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
    3888                      .dwattr DW$T$35, DW_AT_byte_size(0x04)
    3889              DW$349  .dwtag  DW_TAG_subrange_type
    3890                      .dwattr DW$349, DW_AT_upper_bound(0x03)
    3891                      .dwendtag DW$T$35
    3892              
    3893              
    3894              DW$T$37 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    3895                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    3896                      .dwattr DW$T$37, DW_AT_byte_size(0x14)
    3897              DW$350  .dwtag  DW_TAG_subrange_type
    3898                      .dwattr DW$350, DW_AT_upper_bound(0x13)
    3899                      .dwendtag DW$T$37
    3900              
    3901              
    3902              DW$T$27 .dwtag  DW_TAG_subroutine_type
    3903                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    3904              DW$351  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    3905                      .dwendtag DW$T$27
    3906              
    3907              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$21)
    3908                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    3909              
    3910              DW$T$21 .dwtag  DW_TAG_structure_type
    3911                      .dwattr DW$T$21, DW_AT_name("edit_mem")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:09 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8122                            PAGE   86

    3912                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    3913              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3914                      .dwattr DW$352, DW_AT_name("x"), DW_AT_symbol_name("_x")
    3915                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3916                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3917              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3918                      .dwattr DW$353, DW_AT_name("y"), DW_AT_symbol_name("_y")
    3919                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3920                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3921              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3922                      .dwattr DW$354, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    3923                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3924                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3925              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3926                      .dwattr DW$355, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    3927                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3928                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3929              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3930                      .dwattr DW$356, DW_AT_name("id"), DW_AT_symbol_name("_id")
    3931                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3932                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3933              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3934                      .dwattr DW$357, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    3935                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3936                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3937              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    3938                      .dwattr DW$358, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    3939                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3940                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3941                      .dwendtag DW$T$21
    3942              
    3943              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
    3944                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    3945              
    3946                      .dwattr DW$146, DW_AT_external(0x01)
    3947                      .dwattr DW$171, DW_AT_external(0x01)
    3948                      .dwattr DW$152, DW_AT_external(0x01)
    3949                      .dwattr DW$203, DW_AT_external(0x01)
    3950                      .dwattr DW$149, DW_AT_external(0x01)
    3951                      .dwattr DW$193, DW_AT_external(0x01)
    3952                      .dwattr DW$187, DW_AT_external(0x01)
    3953                      .dwattr DW$196, DW_AT_external(0x01)
    3954                      .dwattr DW$206, DW_AT_external(0x01)
    3955                      .dwattr DW$207, DW_AT_external(0x01)
    3956                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    3957              
    3958              ;***************************************************************
    3959              ;* DWARF CIE ENTRIES                                           *
    3960              ;***************************************************************
    3961              
    3962              DW$CIE  .dwcie 1, 40
    3963                      .dwcfa  0x0c, 20, 0
    3964                      .dwcfa  0x07, 0
    3965                      .dwcfa  0x07, 1
    3966                      .dwcfa  0x07, 2
TMS320C2000 COFF Assembler PC v4.1.3 Thu Sep 15 15:05:09 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8122                            PAGE   87

    3967                      .dwcfa  0x07, 3
    3968                      .dwcfa  0x07, 4
    3969                      .dwcfa  0x07, 5
    3970                      .dwcfa  0x08, 6
    3971                      .dwcfa  0x08, 7
    3972                      .dwcfa  0x08, 8
    3973                      .dwcfa  0x08, 9
    3974                      .dwcfa  0x08, 10
    3975                      .dwcfa  0x08, 11
    3976                      .dwcfa  0x07, 12
    3977                      .dwcfa  0x07, 13
    3978                      .dwcfa  0x07, 14
    3979                      .dwcfa  0x07, 15
    3980                      .dwcfa  0x07, 16
    3981                      .dwcfa  0x07, 17
    3982                      .dwcfa  0x07, 18
    3983                      .dwcfa  0x07, 19
    3984                      .dwcfa  0x07, 20
    3985                      .dwcfa  0x07, 21
    3986                      .dwcfa  0x07, 22
    3987                      .dwcfa  0x07, 23
    3988                      .dwcfa  0x07, 24
    3989                      .dwcfa  0x07, 25
    3990                      .dwcfa  0x07, 26
    3991                      .dwcfa  0x08, 27
    3992                      .dwcfa  0x07, 28
    3993                      .dwcfa  0x07, 29
    3994                      .dwcfa  0x07, 30
    3995                      .dwcfa  0x07, 31
    3996                      .dwcfa  0x07, 32
    3997                      .dwcfa  0x07, 33
    3998                      .dwcfa  0x07, 34
    3999                      .dwcfa  0x07, 35
    4000                      .dwcfa  0x07, 36
    4001                      .dwcfa  0x07, 37
    4002                      .dwcfa  0x07, 38
    4003                      .dwcfa  0x07, 39
    4004                      .dwcfa  0x07, 40
    4005              
    4006              ;***************************************************************
    4007              ;* DWARF REGISTER MAP                                          *
    4008              ;***************************************************************
    4009              
