TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:02:59 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Nov 29 16:02:59 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_XBmod.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    3798              DW$383  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$70)
    3799              DW$384  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$70)
    3800                      .dwendtag DW$T$130
    3801              
    3802              
    3803              DW$T$139        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    3804                      .dwattr DW$T$139, DW_AT_language(DW_LANG_C)
    3805                      .dwattr DW$T$139, DW_AT_byte_size(0x14)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:02:59 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   79

    3806              DW$385  .dwtag  DW_TAG_subrange_type
    3807                      .dwattr DW$385, DW_AT_upper_bound(0x13)
    3808                      .dwendtag DW$T$139
    3809              
    3810              
    3811              DW$T$141        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    3812                      .dwattr DW$T$141, DW_AT_language(DW_LANG_C)
    3813                      .dwattr DW$T$141, DW_AT_byte_size(0x0a)
    3814              DW$386  .dwtag  DW_TAG_subrange_type
    3815                      .dwattr DW$386, DW_AT_upper_bound(0x09)
    3816                      .dwendtag DW$T$141
    3817              
    3818              DW$387  .dwtag  DW_TAG_far_type
    3819                      .dwattr DW$387, DW_AT_type(*DW$T$33)
    3820              DW$T$34 .dwtag  DW_TAG_const_type
    3821                      .dwattr DW$T$34, DW_AT_type(*DW$387)
    3822              DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
    3823                      .dwattr DW$T$35, DW_AT_address_class(0x16)
    3824              DW$T$65 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$64)
    3825                      .dwattr DW$T$65, DW_AT_address_class(0x16)
    3826              
    3827              DW$T$147        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$65)
    3828                      .dwattr DW$T$147, DW_AT_language(DW_LANG_C)
    3829              
    3830              DW$T$149        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$65)
    3831                      .dwattr DW$T$149, DW_AT_language(DW_LANG_C)
    3832              DW$388  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3833              DW$389  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3834              DW$390  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    3835              DW$391  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    3836              DW$392  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$70)
    3837              DW$393  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    3838              DW$394  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$65)
    3839                      .dwendtag DW$T$149
    3840              
    3841              
    3842              DW$T$151        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$65)
    3843                      .dwattr DW$T$151, DW_AT_language(DW_LANG_C)
    3844              DW$395  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3845              DW$396  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3846              DW$397  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$41)
    3847              DW$398  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    3848              DW$399  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    3849              DW$400  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$65)
    3850                      .dwendtag DW$T$151
    3851              
    3852              
    3853              DW$T$153        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$65)
    3854                      .dwattr DW$T$153, DW_AT_language(DW_LANG_C)
    3855              DW$401  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3856              DW$402  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    3857              DW$403  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    3858              DW$404  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    3859              DW$405  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    3860              DW$406  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$65)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:02:59 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   80

    3861                      .dwendtag DW$T$153
    3862              
    3863              DW$T$85 .dwtag  DW_TAG_typedef, DW_AT_name("xb_data_t"), DW_AT_type(*DW$T$44)
    3864                      .dwattr DW$T$85, DW_AT_language(DW_LANG_C)
    3865              DW$T$86 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$85)
    3866                      .dwattr DW$T$86, DW_AT_address_class(0x16)
    3867              
    3868              DW$T$155        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$85)
    3869                      .dwattr DW$T$155, DW_AT_language(DW_LANG_C)
    3870                      .dwattr DW$T$155, DW_AT_byte_size(0xd0)
    3871              DW$407  .dwtag  DW_TAG_subrange_type
    3872                      .dwattr DW$407, DW_AT_upper_bound(0x33)
    3873                      .dwendtag DW$T$155
    3874              
    3875              DW$T$156        .dwtag  DW_TAG_typedef, DW_AT_name("DL_flag_t"), DW_AT_type(*DW$T$45)
    3876                      .dwattr DW$T$156, DW_AT_language(DW_LANG_C)
    3877              
    3878              DW$T$24 .dwtag  DW_TAG_structure_type
    3879                      .dwattr DW$T$24, DW_AT_byte_size(0x06)
    3880              DW$408  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3881                      .dwattr DW$408, DW_AT_name("mod_id"), DW_AT_symbol_name("_mod_id")
    3882                      .dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3883                      .dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3884              DW$409  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    3885                      .dwattr DW$409, DW_AT_name("insmod_fun"), DW_AT_symbol_name("_insmod_fun")
    3886                      .dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3887                      .dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3888              DW$410  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3889                      .dwattr DW$410, DW_AT_name("exitmod_fun"), DW_AT_symbol_name("_exitmod_fun")
    3890                      .dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3891                      .dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3892                      .dwendtag DW$T$24
    3893              
    3894              DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    3895                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
    3896                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    3897              DW$411  .dwtag  DW_TAG_far_type
    3898                      .dwattr DW$411, DW_AT_type(*DW$T$25)
    3899              DW$T$26 .dwtag  DW_TAG_const_type
    3900                      .dwattr DW$T$26, DW_AT_type(*DW$411)
    3901              DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
    3902                      .dwattr DW$T$27, DW_AT_address_class(0x16)
    3903              DW$412  .dwtag  DW_TAG_far_type
    3904                      .dwattr DW$412, DW_AT_type(*DW$T$27)
    3905              DW$T$135        .dwtag  DW_TAG_const_type
    3906                      .dwattr DW$T$135, DW_AT_type(*DW$412)
    3907              DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT"), DW_AT_type(*DW$T$32)
    3908                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    3909              DW$T$64 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$43)
    3910                      .dwattr DW$T$64, DW_AT_language(DW_LANG_C)
    3911              
    3912              DW$T$44 .dwtag  DW_TAG_structure_type
    3913                      .dwattr DW$T$44, DW_AT_byte_size(0x04)
    3914              DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3915                      .dwattr DW$413, DW_AT_name("offset"), DW_AT_symbol_name("_offset")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:02:59 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   81

    3916                      .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3917                      .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3918              DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3919                      .dwattr DW$414, DW_AT_name("Usage"), DW_AT_symbol_name("_Usage")
    3920                      .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3921                      .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3922                      .dwendtag DW$T$44
    3923              
    3924              
    3925              DW$T$45 .dwtag  DW_TAG_structure_type
    3926                      .dwattr DW$T$45, DW_AT_byte_size(0x0d)
    3927              DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3928                      .dwattr DW$415, DW_AT_name("DL_data_is_new"), DW_AT_symbol_name("_DL_data_is_new")
    3929                      .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3930                      .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3931              DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3932                      .dwattr DW$416, DW_AT_name("DL_path1_ERR_is_new"), DW_AT_symbol_name("_DL_path1_ERR_is_new")
    3933                      .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3934                      .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3935              DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3936                      .dwattr DW$417, DW_AT_name("DL_path2_ERR_is_new"), DW_AT_symbol_name("_DL_path2_ERR_is_new")
    3937                      .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3938                      .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3939              DW$418  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3940                      .dwattr DW$418, DW_AT_name("DL_XB_is_new"), DW_AT_symbol_name("_DL_XB_is_new")
    3941                      .dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3942                      .dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3943              DW$419  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3944                      .dwattr DW$419, DW_AT_name("DL_WIR_is_new"), DW_AT_symbol_name("_DL_WIR_is_new")
    3945                      .dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3946                      .dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3947              DW$420  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3948                      .dwattr DW$420, DW_AT_name("Ua_is_lost"), DW_AT_symbol_name("_Ua_is_lost")
    3949                      .dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3950                      .dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3951              DW$421  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3952                      .dwattr DW$421, DW_AT_name("Ub_is_lost"), DW_AT_symbol_name("_Ub_is_lost")
    3953                      .dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3954                      .dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3955              DW$422  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3956                      .dwattr DW$422, DW_AT_name("Uc_is_lost"), DW_AT_symbol_name("_Uc_is_lost")
    3957                      .dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3958                      .dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3959              DW$423  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3960                      .dwattr DW$423, DW_AT_name("Ia_is_lost"), DW_AT_symbol_name("_Ia_is_lost")
    3961                      .dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3962                      .dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3963              DW$424  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3964                      .dwattr DW$424, DW_AT_name("Ib_is_lost"), DW_AT_symbol_name("_Ib_is_lost")
    3965                      .dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3966                      .dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3967              DW$425  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3968                      .dwattr DW$425, DW_AT_name("Ic_is_lost"), DW_AT_symbol_name("_Ic_is_lost")
    3969                      .dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3970                      .dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:02:59 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   82

    3971              DW$426  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3972                      .dwattr DW$426, DW_AT_name("phase3or4"), DW_AT_symbol_name("_phase3or4")
    3973                      .dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3974                      .dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3975              DW$427  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3976                      .dwattr DW$427, DW_AT_name("measure_mode"), DW_AT_symbol_name("_measure_mode")
    3977                      .dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3978                      .dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3979                      .dwendtag DW$T$45
    3980              
    3981              DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("app_insmod_t"), DW_AT_type(*DW$T$21)
    3982                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    3983              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("app_exitmod_t"), DW_AT_type(*DW$T$21)
    3984                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    3985              DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$6)
    3986                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
    3987              
    3988              DW$T$32 .dwtag  DW_TAG_structure_type
    3989                      .dwattr DW$T$32, DW_AT_name("GUI_FONT")
    3990                      .dwattr DW$T$32, DW_AT_byte_size(0x0c)
    3991              DW$428  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    3992                      .dwattr DW$428, DW_AT_name("start_asc"), DW_AT_symbol_name("_start_asc")
    3993                      .dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3994                      .dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3995              DW$429  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    3996                      .dwattr DW$429, DW_AT_name("end_asc"), DW_AT_symbol_name("_end_asc")
    3997                      .dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3998                      .dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3999              DW$430  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4000                      .dwattr DW$430, DW_AT_name("nbyte"), DW_AT_symbol_name("_nbyte")
    4001                      .dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4002                      .dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4003              DW$431  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4004                      .dwattr DW$431, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
    4005                      .dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4006                      .dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4007              DW$432  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4008                      .dwattr DW$432, DW_AT_name("high"), DW_AT_symbol_name("_high")
    4009                      .dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4010                      .dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4011              DW$433  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4012                      .dwattr DW$433, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
    4013                      .dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4014                      .dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4015              DW$434  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    4016                      .dwattr DW$434, DW_AT_name("pcode"), DW_AT_symbol_name("_pcode")
    4017                      .dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4018                      .dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4019              DW$435  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    4020                      .dwattr DW$435, DW_AT_name("pNext"), DW_AT_symbol_name("_pNext")
    4021                      .dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4022                      .dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4023                      .dwendtag DW$T$32
    4024              
    4025              DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:02:59 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   83

    4026                      .dwattr DW$T$31, DW_AT_address_class(0x16)
    4027              
    4028              DW$T$43 .dwtag  DW_TAG_structure_type
    4029                      .dwattr DW$T$43, DW_AT_name("hwin")
    4030                      .dwattr DW$T$43, DW_AT_byte_size(0x22)
    4031              DW$436  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4032                      .dwattr DW$436, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    4033                      .dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4034                      .dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4035              DW$437  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4036                      .dwattr DW$437, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    4037                      .dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4038                      .dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4039              DW$438  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4040                      .dwattr DW$438, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    4041                      .dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4042                      .dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4043              DW$439  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4044                      .dwattr DW$439, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    4045                      .dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4046                      .dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4047              DW$440  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4048                      .dwattr DW$440, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    4049                      .dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4050                      .dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4051              DW$441  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4052                      .dwattr DW$441, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    4053                      .dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4054                      .dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4055              DW$442  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4056                      .dwattr DW$442, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    4057                      .dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4058                      .dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4059              DW$443  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4060                      .dwattr DW$443, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    4061                      .dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4062                      .dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4063              DW$444  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4064                      .dwattr DW$444, DW_AT_name("type"), DW_AT_symbol_name("_type")
    4065                      .dwattr DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4066                      .dwattr DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4067              DW$445  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    4068                      .dwattr DW$445, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    4069                      .dwattr DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4070                      .dwattr DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4071              DW$446  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    4072                      .dwattr DW$446, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    4073                      .dwattr DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4074                      .dwattr DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4075              DW$447  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    4076                      .dwattr DW$447, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
    4077                      .dwattr DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4078                      .dwattr DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4079              DW$448  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    4080                      .dwattr DW$448, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:02:59 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   84

    4081                      .dwattr DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4082                      .dwattr DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4083              DW$449  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    4084                      .dwattr DW$449, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    4085                      .dwattr DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4086                      .dwattr DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4087              DW$450  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
    4088                      .dwattr DW$450, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    4089                      .dwattr DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4090                      .dwattr DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4091              DW$451  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4092                      .dwattr DW$451, DW_AT_name("drop_list_is_start"), DW_AT_symbol_name("_drop_list_is_start")
    4093                      .dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4094                      .dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4095              DW$452  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    4096                      .dwattr DW$452, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    4097                      .dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4098                      .dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4099              DW$453  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4100                      .dwattr DW$453, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
    4101                      .dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4102                      .dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4103              DW$454  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4104                      .dwattr DW$454, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    4105                      .dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4106                      .dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4107              DW$455  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    4108                      .dwattr DW$455, DW_AT_name("checkbox_radio_state"), DW_AT_symbol_name("_checkbox_radio_state")
    4109                      .dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4110                      .dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4111              DW$456  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4112                      .dwattr DW$456, DW_AT_name("title_len"), DW_AT_symbol_name("_title_len")
    4113                      .dwattr DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4114                      .dwattr DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4115              DW$457  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4116                      .dwattr DW$457, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
    4117                      .dwattr DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4118                      .dwattr DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4119              DW$458  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    4120                      .dwattr DW$458, DW_AT_name("pwidget"), DW_AT_symbol_name("_pwidget")
    4121                      .dwattr DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4122                      .dwattr DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4123                      .dwendtag DW$T$43
    4124              
    4125              DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$43)
    4126                      .dwattr DW$T$38, DW_AT_address_class(0x16)
    4127              DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
    4128                      .dwattr DW$T$21, DW_AT_address_class(0x16)
    4129              DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
    4130                      .dwattr DW$T$29, DW_AT_address_class(0x16)
    4131              DW$459  .dwtag  DW_TAG_far_type
    4132                      .dwattr DW$459, DW_AT_type(*DW$T$32)
    4133              DW$T$30 .dwtag  DW_TAG_const_type
    4134                      .dwattr DW$T$30, DW_AT_type(*DW$459)
    4135              DW$T$40 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$39)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:02:59 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   85

    4136                      .dwattr DW$T$40, DW_AT_address_class(0x16)
    4137              DW$460  .dwtag  DW_TAG_far_type
    4138                      .dwattr DW$460, DW_AT_type(*DW$T$6)
    4139              DW$T$28 .dwtag  DW_TAG_const_type
    4140                      .dwattr DW$T$28, DW_AT_type(*DW$460)
    4141              DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$37)
    4142                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    4143              
    4144              DW$T$37 .dwtag  DW_TAG_structure_type
    4145                      .dwattr DW$T$37, DW_AT_name("edit_mem")
    4146                      .dwattr DW$T$37, DW_AT_byte_size(0x0c)
    4147              DW$461  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4148                      .dwattr DW$461, DW_AT_name("x"), DW_AT_symbol_name("_x")
    4149                      .dwattr DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4150                      .dwattr DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4151              DW$462  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4152                      .dwattr DW$462, DW_AT_name("y"), DW_AT_symbol_name("_y")
    4153                      .dwattr DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4154                      .dwattr DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4155              DW$463  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4156                      .dwattr DW$463, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
    4157                      .dwattr DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4158                      .dwattr DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4159              DW$464  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4160                      .dwattr DW$464, DW_AT_name("CHhigh"), DW_AT_symbol_name("_CHhigh")
    4161                      .dwattr DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4162                      .dwattr DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4163              DW$465  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4164                      .dwattr DW$465, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    4165                      .dwattr DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4166                      .dwattr DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4167              DW$466  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4168                      .dwattr DW$466, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    4169                      .dwattr DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4170                      .dwattr DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4171              DW$467  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4172                      .dwattr DW$467, DW_AT_name("id"), DW_AT_symbol_name("_id")
    4173                      .dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4174                      .dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4175              DW$468  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    4176                      .dwattr DW$468, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    4177                      .dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4178                      .dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4179              DW$469  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    4180                      .dwattr DW$469, DW_AT_name("pfront"), DW_AT_symbol_name("_pfront")
    4181                      .dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4182                      .dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4183              DW$470  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    4184                      .dwattr DW$470, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    4185                      .dwattr DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4186                      .dwattr DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4187                      .dwendtag DW$T$37
    4188              
    4189              DW$T$36 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
    4190                      .dwattr DW$T$36, DW_AT_address_class(0x16)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:02:59 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   86

    4191              
    4192                      .dwattr DW$181, DW_AT_external(0x01)
    4193                      .dwattr DW$181, DW_AT_type(*DW$T$10)
    4194                      .dwattr DW$169, DW_AT_external(0x01)
    4195                      .dwattr DW$147, DW_AT_external(0x01)
    4196                      .dwattr DW$147, DW_AT_type(*DW$T$19)
    4197                      .dwattr DW$150, DW_AT_external(0x01)
    4198                      .dwattr DW$269, DW_AT_external(0x01)
    4199                      .dwattr DW$146, DW_AT_external(0x01)
    4200                      .dwattr DW$267, DW_AT_external(0x01)
    4201                      .dwattr DW$268, DW_AT_external(0x01)
    4202                      .dwattr DW$302, DW_AT_external(0x01)
    4203                      .dwattr DW$285, DW_AT_external(0x01)
    4204                      .dwattr DW$297, DW_AT_external(0x01)
    4205                      .dwattr DW$188, DW_AT_external(0x01)
    4206                      .dwattr DW$305, DW_AT_external(0x01)
    4207                      .dwattr DW$145, DW_AT_external(0x01)
    4208                      .dwattr DW$238, DW_AT_external(0x01)
    4209                      .dwattr DW$144, DW_AT_external(0x01)
    4210                      .dwattr DW$296, DW_AT_external(0x01)
    4211                      .dwattr DW$283, DW_AT_external(0x01)
    4212                      .dwattr DW$284, DW_AT_external(0x01)
    4213                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    4214              
    4215              ;***************************************************************
    4216              ;* DWARF CIE ENTRIES                                           *
    4217              ;***************************************************************
    4218              
    4219              DW$CIE  .dwcie 1, 40
    4220                      .dwcfa  0x0c, 20, 0
    4221                      .dwcfa  0x07, 0
    4222                      .dwcfa  0x07, 1
    4223                      .dwcfa  0x07, 2
    4224                      .dwcfa  0x07, 3
    4225                      .dwcfa  0x07, 4
    4226                      .dwcfa  0x07, 5
    4227                      .dwcfa  0x08, 6
    4228                      .dwcfa  0x08, 7
    4229                      .dwcfa  0x08, 8
    4230                      .dwcfa  0x08, 9
    4231                      .dwcfa  0x08, 10
    4232                      .dwcfa  0x08, 11
    4233                      .dwcfa  0x07, 12
    4234                      .dwcfa  0x07, 13
    4235                      .dwcfa  0x07, 14
    4236                      .dwcfa  0x07, 15
    4237                      .dwcfa  0x07, 16
    4238                      .dwcfa  0x07, 17
    4239                      .dwcfa  0x07, 18
    4240                      .dwcfa  0x07, 19
    4241                      .dwcfa  0x07, 20
    4242                      .dwcfa  0x07, 21
    4243                      .dwcfa  0x07, 22
    4244                      .dwcfa  0x07, 23
    4245                      .dwcfa  0x07, 24
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:02:59 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4002                            PAGE   87

    4246                      .dwcfa  0x07, 25
    4247                      .dwcfa  0x07, 26
    4248                      .dwcfa  0x08, 27
