TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:19 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sun Oct 09 17:37:18 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_BBmod_interface.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    1046                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    1047                      .dwattr DW$T$70, DW_AT_byte_size(0x04)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:19 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   25

    1048              DW$119  .dwtag  DW_TAG_subrange_type
    1049                      .dwattr DW$119, DW_AT_upper_bound(0x01)
    1050                      .dwendtag DW$T$70
    1051              
    1052              
    1053              DW$T$71 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$30)
    1054                      .dwattr DW$T$71, DW_AT_language(DW_LANG_C)
    1055                      .dwattr DW$T$71, DW_AT_byte_size(0x08)
    1056              DW$120  .dwtag  DW_TAG_subrange_type
    1057                      .dwattr DW$120, DW_AT_upper_bound(0x03)
    1058                      .dwendtag DW$T$71
    1059              
    1060              DW$T$45 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    1061                      .dwattr DW$T$45, DW_AT_address_class(0x16)
    1062              
    1063              DW$T$72 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    1064                      .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
    1065                      .dwattr DW$T$72, DW_AT_byte_size(0x14)
    1066              DW$121  .dwtag  DW_TAG_subrange_type
    1067                      .dwattr DW$121, DW_AT_upper_bound(0x13)
    1068                      .dwendtag DW$T$72
    1069              
    1070              DW$T$40 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$39)
    1071                      .dwattr DW$T$40, DW_AT_address_class(0x16)
    1072              
    1073              DW$T$82 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$40)
    1074                      .dwattr DW$T$82, DW_AT_language(DW_LANG_C)
    1075              
    1076              DW$T$84 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$40)
    1077                      .dwattr DW$T$84, DW_AT_language(DW_LANG_C)
    1078              DW$122  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1079              DW$123  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1080              DW$124  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1081              DW$125  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1082              DW$126  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1083              DW$127  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
    1084                      .dwendtag DW$T$84
    1085              
    1086              
    1087              DW$T$86 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$40)
    1088                      .dwattr DW$T$86, DW_AT_language(DW_LANG_C)
    1089              DW$128  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1090              DW$129  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1091              DW$130  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1092              DW$131  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1093              DW$132  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$45)
    1094              DW$133  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1095              DW$134  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
    1096                      .dwendtag DW$T$86
    1097              
    1098              
    1099              DW$T$88 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$40)
    1100                      .dwattr DW$T$88, DW_AT_language(DW_LANG_C)
    1101              DW$135  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1102              DW$136  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:19 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   26

    1103              DW$137  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
    1104              DW$138  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    1105              DW$139  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1106              DW$140  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
    1107                      .dwendtag DW$T$88
    1108              
    1109              DW$T$57 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$56)
    1110                      .dwattr DW$T$57, DW_AT_address_class(0x16)
    1111              DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1112                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
    1113                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    1114              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    1115                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    1116              DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$32)
    1117                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    1118              DW$T$56 .dwtag  DW_TAG_typedef, DW_AT_name("measure_param_t"), DW_AT_type(*DW$T$36)
    1119                      .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
    1120              DW$141  .dwtag  DW_TAG_far_type
    1121                      .dwattr DW$141, DW_AT_type(*DW$T$25)
    1122              DW$T$29 .dwtag  DW_TAG_const_type
    1123                      .dwattr DW$T$29, DW_AT_type(*DW$141)
    1124              
    1125              DW$T$32 .dwtag  DW_TAG_structure_type
    1126                      .dwattr DW$T$32, DW_AT_name("hwin")
    1127                      .dwattr DW$T$32, DW_AT_byte_size(0x42)
    1128              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1129                      .dwattr DW$142, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    1130                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1132              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1133                      .dwattr DW$143, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    1134                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1135                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1136              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1137                      .dwattr DW$144, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    1138                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1139                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1140              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1141                      .dwattr DW$145, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    1142                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1143                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1144              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1145                      .dwattr DW$146, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    1146                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1147                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1148              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1149                      .dwattr DW$147, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    1150                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1151                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1152              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1153                      .dwattr DW$148, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    1154                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1155                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1156              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1157                      .dwattr DW$149, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:19 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   27

    1158                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1159                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1160              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1161                      .dwattr DW$150, DW_AT_name("type"), DW_AT_symbol_name("_type")
    1162                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1163                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1164              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1165                      .dwattr DW$151, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    1166                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1167                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1168              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1169                      .dwattr DW$152, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    1170                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1171                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1172              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1173                      .dwattr DW$153, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
    1174                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1175                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1176              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1177                      .dwattr DW$154, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    1178                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1179                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1180              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1181                      .dwattr DW$155, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    1182                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1183                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1184              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1185                      .dwattr DW$156, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    1186                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1187                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1188              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1189                      .dwattr DW$157, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
    1190                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1191                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1192              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1193                      .dwattr DW$158, DW_AT_name("button_flags"), DW_AT_symbol_name("_button_flags")
    1194                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1195                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1196              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1197                      .dwattr DW$159, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
    1198                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    1199                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1200              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1201                      .dwattr DW$160, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
    1202                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1203                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1204              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1205                      .dwattr DW$161, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
    1206                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1207                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1208              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1209                      .dwattr DW$162, DW_AT_name("drop_list_is_start"), DW_AT_symbol_name("_drop_list_is_start")
    1210                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1211                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1212              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:19 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   28

    1213                      .dwattr DW$163, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    1214                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1215                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1216              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1217                      .dwattr DW$164, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
    1218                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1219                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1220              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1221                      .dwattr DW$165, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    1222                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    1223                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1224              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1225                      .dwattr DW$166, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
    1226                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1227                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1228                      .dwendtag DW$T$32
    1229              
    1230              DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    1231                      .dwattr DW$T$22, DW_AT_address_class(0x16)
    1232              
    1233              DW$T$36 .dwtag  DW_TAG_structure_type
    1234                      .dwattr DW$T$36, DW_AT_name("_measure_param_t")
    1235                      .dwattr DW$T$36, DW_AT_byte_size(0x48)
    1236              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    1237                      .dwattr DW$167, DW_AT_name("phase_a"), DW_AT_symbol_name("_phase_a")
    1238                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1239                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1240              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    1241                      .dwattr DW$168, DW_AT_name("phase_b"), DW_AT_symbol_name("_phase_b")
    1242                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1243                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1244              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    1245                      .dwattr DW$169, DW_AT_name("phase_c"), DW_AT_symbol_name("_phase_c")
    1246                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1247                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1248              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1249                      .dwattr DW$170, DW_AT_name("f_Uab"), DW_AT_symbol_name("_f_Uab")
    1250                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1251                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1252              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1253                      .dwattr DW$171, DW_AT_name("f_Ubc"), DW_AT_symbol_name("_f_Ubc")
    1254                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1255                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1256              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1257                      .dwattr DW$172, DW_AT_name("f_Uac"), DW_AT_symbol_name("_f_Uac")
    1258                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1259                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1260              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1261                      .dwattr DW$173, DW_AT_name("f_JIac"), DW_AT_symbol_name("_f_JIac")
    1262                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1263                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1264              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1265                      .dwattr DW$174, DW_AT_name("f_JIbc"), DW_AT_symbol_name("_f_JIbc")
    1266                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1267                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:19 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   29

    1268              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1269                      .dwattr DW$175, DW_AT_name("f_JIab"), DW_AT_symbol_name("_f_JIab")
    1270                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1271                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1272              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1273                      .dwattr DW$176, DW_AT_name("f_JUac"), DW_AT_symbol_name("_f_JUac")
    1274                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1275                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1276              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1277                      .dwattr DW$177, DW_AT_name("f_JUbc"), DW_AT_symbol_name("_f_JUbc")
    1278                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1279                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1280              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1281                      .dwattr DW$178, DW_AT_name("f_JUab"), DW_AT_symbol_name("_f_JUab")
    1282                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1283                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1284              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1285                      .dwattr DW$179, DW_AT_name("f_Cos"), DW_AT_symbol_name("_f_Cos")
    1286                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1287                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1288              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1289                      .dwattr DW$180, DW_AT_name("f_Pabc"), DW_AT_symbol_name("_f_Pabc")
    1290                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1291                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1292              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1293                      .dwattr DW$181, DW_AT_name("f_Qabc"), DW_AT_symbol_name("_f_Qabc")
    1294                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1295                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1296              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    1297                      .dwattr DW$182, DW_AT_name("f_err"), DW_AT_symbol_name("_f_err")
    1298                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1299                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1300              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    1301                      .dwattr DW$183, DW_AT_name("f_err_Q"), DW_AT_symbol_name("_f_err_Q")
    1302                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1303                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1304              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1305                      .dwattr DW$184, DW_AT_name("f_Feq"), DW_AT_symbol_name("_f_Feq")
    1306                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1307                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1308                      .dwendtag DW$T$36
    1309              
    1310              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
    1311                      .dwattr DW$T$28, DW_AT_address_class(0x16)
    1312              
    1313              DW$T$35 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$16)
    1314                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
    1315                      .dwattr DW$T$35, DW_AT_byte_size(0x08)
    1316              DW$185  .dwtag  DW_TAG_subrange_type
    1317                      .dwattr DW$185, DW_AT_upper_bound(0x03)
    1318                      .dwendtag DW$T$35
    1319              
    1320              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    1321                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    1322              
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:19 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   30

    1323              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    1324                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    1325                      .dwattr DW$T$26, DW_AT_byte_size(0x1e)
    1326              DW$186  .dwtag  DW_TAG_subrange_type
    1327                      .dwattr DW$186, DW_AT_upper_bound(0x1d)
    1328                      .dwendtag DW$T$26
    1329              
    1330              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("phase_param_t"), DW_AT_type(*DW$T$33)
    1331                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    1332              
    1333              DW$T$27 .dwtag  DW_TAG_subroutine_type
    1334                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    1335              DW$187  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1336                      .dwendtag DW$T$27
    1337              
    1338              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$21)
    1339                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    1340              
    1341              DW$T$33 .dwtag  DW_TAG_structure_type
    1342                      .dwattr DW$T$33, DW_AT_name("_phase_param_t")
    1343                      .dwattr DW$T$33, DW_AT_byte_size(0x0a)
    1344              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1345                      .dwattr DW$188, DW_AT_name("f_U"), DW_AT_symbol_name("_f_U")
    1346                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1347                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1348              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1349                      .dwattr DW$189, DW_AT_name("f_I"), DW_AT_symbol_name("_f_I")
    1350                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1351                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1352              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1353                      .dwattr DW$190, DW_AT_name("f_J"), DW_AT_symbol_name("_f_J")
    1354                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1355                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1356              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1357                      .dwattr DW$191, DW_AT_name("f_P"), DW_AT_symbol_name("_f_P")
    1358                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1359                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1360              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1361                      .dwattr DW$192, DW_AT_name("f_Q"), DW_AT_symbol_name("_f_Q")
    1362                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1363                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1364                      .dwendtag DW$T$33
    1365              
    1366              DW$T$3  .dwtag  DW_TAG_pointer_type
    1367                      .dwattr DW$T$3, DW_AT_address_class(0x16)
    1368              
    1369              DW$T$21 .dwtag  DW_TAG_structure_type
    1370                      .dwattr DW$T$21, DW_AT_name("edit_mem")
    1371                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    1372              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1373                      .dwattr DW$193, DW_AT_name("x"), DW_AT_symbol_name("_x")
    1374                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1376              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1377                      .dwattr DW$194, DW_AT_name("y"), DW_AT_symbol_name("_y")
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:19 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   31

    1378                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1379                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1380              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1381                      .dwattr DW$195, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    1382                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1383                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1384              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1385                      .dwattr DW$196, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    1386                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1387                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1388              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1389                      .dwattr DW$197, DW_AT_name("id"), DW_AT_symbol_name("_id")
    1390                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1391                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1392              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1393                      .dwattr DW$198, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    1394                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1395                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1396              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1397                      .dwattr DW$199, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    1398                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1399                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1400                      .dwendtag DW$T$21
    1401              
    1402              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
    1403                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    1404              
    1405                      .dwattr DW$86, DW_AT_external(0x01)
    1406                      .dwattr DW$90, DW_AT_external(0x01)
    1407                      .dwattr DW$92, DW_AT_external(0x01)
    1408                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1409              
    1410              ;***************************************************************
    1411              ;* DWARF CIE ENTRIES                                           *
    1412              ;***************************************************************
    1413              
    1414              DW$CIE  .dwcie 1, 40
    1415                      .dwcfa  0x0c, 20, 0
    1416                      .dwcfa  0x07, 0
    1417                      .dwcfa  0x07, 1
    1418                      .dwcfa  0x07, 2
    1419                      .dwcfa  0x07, 3
    1420                      .dwcfa  0x07, 4
    1421                      .dwcfa  0x07, 5
    1422                      .dwcfa  0x08, 6
    1423                      .dwcfa  0x08, 7
    1424                      .dwcfa  0x08, 8
    1425                      .dwcfa  0x08, 9
    1426                      .dwcfa  0x08, 10
    1427                      .dwcfa  0x08, 11
    1428                      .dwcfa  0x07, 12
    1429                      .dwcfa  0x07, 13
    1430                      .dwcfa  0x07, 14
    1431                      .dwcfa  0x07, 15
    1432                      .dwcfa  0x07, 16
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:19 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI4802                            PAGE   32

    1433                      .dwcfa  0x07, 17
    1434                      .dwcfa  0x07, 18
    1435                      .dwcfa  0x07, 19
    1436                      .dwcfa  0x07, 20
    1437                      .dwcfa  0x07, 21
    1438                      .dwcfa  0x07, 22
    1439                      .dwcfa  0x07, 23
    1440                      .dwcfa  0x07, 24
    1441                      .dwcfa  0x07, 25
    1442                      .dwcfa  0x07, 26
    1443                      .dwcfa  0x08, 27
    1444                      .dwcfa  0x07, 28
    1445                      .dwcfa  0x07, 29
    1446                      .dwcfa  0x07, 30
    1447                      .dwcfa  0x07, 31
    1448                      .dwcfa  0x07, 32
    1449                      .dwcfa  0x07, 33
    1450                      .dwcfa  0x07, 34
    1451                      .dwcfa  0x07, 35
    1452                      .dwcfa  0x07, 36
    1453                      .dwcfa  0x07, 37
    1454                      .dwcfa  0x07, 38
    1455                      .dwcfa  0x07, 39
    1456                      .dwcfa  0x07, 40
    1457              
    1458              ;***************************************************************
    1459              ;* DWARF REGISTER MAP                                          *
    1460              ;***************************************************************
    1461              
    1462              DW$200  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    1463                      .dwattr DW$200, DW_AT_location[DW_OP_reg0]
    1464              DW$201  .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
    1465                      .dwattr DW$201, DW_AT_location[DW_OP_reg1]
    1466              DW$202  .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
    1467                      .dwattr DW$202, DW_AT_location[DW_OP_reg2]
