TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:17 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8964                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sun Oct 09 17:37:17 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_BBmod_fun.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8964                            PAGE   19

     835              DW$T$63 .dwtag  DW_TAG_subroutine_type
     836                      .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
     837              DW$97   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$62)
     838                      .dwendtag DW$T$63
     839              
     840              
     841              DW$T$65 .dwtag  DW_TAG_subroutine_type
     842                      .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
     843              DW$98   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     844                      .dwendtag DW$T$65
     845              
     846              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     847                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     848                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
     849              DW$T$43 .dwtag  DW_TAG_typedef, DW_AT_name("dev_id_t"), DW_AT_type(*DW$T$6)
     850                      .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
     851              
     852              DW$T$67 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     853                      .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
     854              DW$99   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     855              DW$100  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     856                      .dwendtag DW$T$67
     857              
     858              
     859              DW$T$69 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     860                      .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
     861              DW$101  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     862              DW$102  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$48)
     863                      .dwendtag DW$T$69
     864              
     865              
     866              DW$T$71 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     867                      .dwattr DW$T$71, DW_AT_language(DW_LANG_C)
     868              DW$103  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     869                      .dwendtag DW$T$71
     870              
     871              DW$T$73 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
     872                      .dwattr DW$T$73, DW_AT_address_class(0x16)
     873              
     874              DW$T$74 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     875                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
     876              DW$104  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$73)
     877              DW$105  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     878                      .dwendtag DW$T$74
     879              
     880              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     881                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     882                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     883              
     884              DW$T$76 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     885                      .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
     886              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     887                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     888                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     889              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:17 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8964                            PAGE   20

     890                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     891              
     892              DW$T$78 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     893                      .dwattr DW$T$78, DW_AT_language(DW_LANG_C)
     894              DW$106  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
     895                      .dwendtag DW$T$78
     896              
     897              DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
     898                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     899              DW$T$48 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
     900                      .dwattr DW$T$48, DW_AT_address_class(0x16)
     901              DW$T$56 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$55)
     902                      .dwattr DW$T$56, DW_AT_address_class(0x16)
     903              DW$T$61 .dwtag  DW_TAG_typedef, DW_AT_name("measure_param_t"), DW_AT_type(*DW$T$36)
     904                      .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
     905              DW$T$62 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$61)
     906                      .dwattr DW$T$62, DW_AT_address_class(0x16)
     907              DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("DL_reflag_u"), DW_AT_type(*DW$T$39)
     908                      .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
     909              DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     910                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
     911                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
     912              DW$T$55 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$32)
     913                      .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
     914              
     915              DW$T$36 .dwtag  DW_TAG_structure_type
     916                      .dwattr DW$T$36, DW_AT_name("_measure_param_t")
     917                      .dwattr DW$T$36, DW_AT_byte_size(0x48)
     918              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     919                      .dwattr DW$107, DW_AT_name("phase_a"), DW_AT_symbol_name("_phase_a")
     920                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     921                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
     922              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     923                      .dwattr DW$108, DW_AT_name("phase_b"), DW_AT_symbol_name("_phase_b")
     924                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     925                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
     926              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     927                      .dwattr DW$109, DW_AT_name("phase_c"), DW_AT_symbol_name("_phase_c")
     928                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     929                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
     930              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     931                      .dwattr DW$110, DW_AT_name("f_Uab"), DW_AT_symbol_name("_f_Uab")
     932                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     933                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
     934              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     935                      .dwattr DW$111, DW_AT_name("f_Ubc"), DW_AT_symbol_name("_f_Ubc")
     936                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     937                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
     938              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     939                      .dwattr DW$112, DW_AT_name("f_Uac"), DW_AT_symbol_name("_f_Uac")
     940                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     941                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
     942              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     943                      .dwattr DW$113, DW_AT_name("f_JIac"), DW_AT_symbol_name("_f_JIac")
     944                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:17 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8964                            PAGE   21

     945                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
     946              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     947                      .dwattr DW$114, DW_AT_name("f_JIbc"), DW_AT_symbol_name("_f_JIbc")
     948                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     949                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
     950              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     951                      .dwattr DW$115, DW_AT_name("f_JIab"), DW_AT_symbol_name("_f_JIab")
     952                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     953                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
     954              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     955                      .dwattr DW$116, DW_AT_name("f_JUac"), DW_AT_symbol_name("_f_JUac")
     956                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     957                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
     958              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     959                      .dwattr DW$117, DW_AT_name("f_JUbc"), DW_AT_symbol_name("_f_JUbc")
     960                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     961                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
     962              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     963                      .dwattr DW$118, DW_AT_name("f_JUab"), DW_AT_symbol_name("_f_JUab")
     964                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     965                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
     966              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     967                      .dwattr DW$119, DW_AT_name("f_Cos"), DW_AT_symbol_name("_f_Cos")
     968                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     969                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
     970              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     971                      .dwattr DW$120, DW_AT_name("f_Pabc"), DW_AT_symbol_name("_f_Pabc")
     972                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     973                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
     974              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     975                      .dwattr DW$121, DW_AT_name("f_Qabc"), DW_AT_symbol_name("_f_Qabc")
     976                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     977                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
     978              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
     979                      .dwattr DW$122, DW_AT_name("f_err"), DW_AT_symbol_name("_f_err")
     980                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     981                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
     982              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
     983                      .dwattr DW$123, DW_AT_name("f_err_Q"), DW_AT_symbol_name("_f_err_Q")
     984                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     985                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
     986              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     987                      .dwattr DW$124, DW_AT_name("f_Feq"), DW_AT_symbol_name("_f_Feq")
     988                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     989                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
     990                      .dwendtag DW$T$36
     991              
     992              
     993              DW$T$39 .dwtag  DW_TAG_union_type
     994                      .dwattr DW$T$39, DW_AT_byte_size(0x01)
     995              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     996                      .dwattr DW$125, DW_AT_name("reflag"), DW_AT_symbol_name("_reflag")
     997                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     998                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
     999              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:17 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8964                            PAGE   22

    1000                      .dwattr DW$126, DW_AT_name("reflag_bits"), DW_AT_symbol_name("_reflag_bits")
    1001                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1003                      .dwendtag DW$T$39
    1004              
    1005              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
    1006                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
    1007                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
    1008              
    1009              DW$T$35 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$16)
    1010                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
    1011                      .dwattr DW$T$35, DW_AT_byte_size(0x08)
    1012              DW$127  .dwtag  DW_TAG_subrange_type
    1013                      .dwattr DW$127, DW_AT_upper_bound(0x03)
    1014                      .dwendtag DW$T$35
    1015              
    1016              
    1017              DW$T$32 .dwtag  DW_TAG_structure_type
    1018                      .dwattr DW$T$32, DW_AT_name("hwin")
    1019                      .dwattr DW$T$32, DW_AT_byte_size(0x42)
    1020              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1021                      .dwattr DW$128, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    1022                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1023                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1024              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1025                      .dwattr DW$129, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    1026                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1027                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1028              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1029                      .dwattr DW$130, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    1030                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1031                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1032              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1033                      .dwattr DW$131, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    1034                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1035                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1036              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1037                      .dwattr DW$132, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    1038                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1039                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1040              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1041                      .dwattr DW$133, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    1042                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1043                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1044              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1045                      .dwattr DW$134, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    1046                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1047                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1048              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1049                      .dwattr DW$135, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    1050                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1051                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1052              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1053                      .dwattr DW$136, DW_AT_name("type"), DW_AT_symbol_name("_type")
    1054                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:17 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8964                            PAGE   23

    1055                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1056              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1057                      .dwattr DW$137, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    1058                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1059                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1060              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1061                      .dwattr DW$138, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    1062                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1063                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1064              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1065                      .dwattr DW$139, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
    1066                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1067                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1068              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1069                      .dwattr DW$140, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    1070                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1071                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1072              DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1073                      .dwattr DW$141, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    1074                      .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1075                      .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1076              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1077                      .dwattr DW$142, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    1078                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1079                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1080              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1081                      .dwattr DW$143, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
    1082                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1083                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1084              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1085                      .dwattr DW$144, DW_AT_name("button_flags"), DW_AT_symbol_name("_button_flags")
    1086                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1087                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1088              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1089                      .dwattr DW$145, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
    1090                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    1091                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1092              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1093                      .dwattr DW$146, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
    1094                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1095                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1096              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1097                      .dwattr DW$147, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
    1098                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1099                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1100              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1101                      .dwattr DW$148, DW_AT_name("drop_list_is_start"), DW_AT_symbol_name("_drop_list_is_start")
    1102                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1103                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1104              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    1105                      .dwattr DW$149, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    1106                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1107                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1108              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1109                      .dwattr DW$150, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:17 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8964                            PAGE   24

    1110                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1111                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1112              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1113                      .dwattr DW$151, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    1114                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    1115                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1116              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1117                      .dwattr DW$152, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
    1118                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1119                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1120                      .dwendtag DW$T$32
    1121              
    1122              DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    1123                      .dwattr DW$T$22, DW_AT_address_class(0x16)
    1124              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("phase_param_t"), DW_AT_type(*DW$T$33)
    1125                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    1126              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("reflag_bits_t"), DW_AT_type(*DW$T$37)
    1127                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    1128              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    1129                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    1130              
    1131              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    1132                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    1133                      .dwattr DW$T$26, DW_AT_byte_size(0x1e)
    1134              DW$153  .dwtag  DW_TAG_subrange_type
    1135                      .dwattr DW$153, DW_AT_upper_bound(0x1d)
    1136                      .dwendtag DW$T$26
    1137              
    1138              DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
    1139                      .dwattr DW$T$31, DW_AT_address_class(0x16)
    1140              
    1141              DW$T$33 .dwtag  DW_TAG_structure_type
    1142                      .dwattr DW$T$33, DW_AT_name("_phase_param_t")
    1143                      .dwattr DW$T$33, DW_AT_byte_size(0x0a)
    1144              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1145                      .dwattr DW$154, DW_AT_name("f_U"), DW_AT_symbol_name("_f_U")
    1146                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1147                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1148              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1149                      .dwattr DW$155, DW_AT_name("f_I"), DW_AT_symbol_name("_f_I")
    1150                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1151                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1152              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1153                      .dwattr DW$156, DW_AT_name("f_J"), DW_AT_symbol_name("_f_J")
    1154                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1155                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1156              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1157                      .dwattr DW$157, DW_AT_name("f_P"), DW_AT_symbol_name("_f_P")
    1158                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1159                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1160              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1161                      .dwattr DW$158, DW_AT_name("f_Q"), DW_AT_symbol_name("_f_Q")
    1162                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1163                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1164                      .dwendtag DW$T$33
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:17 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8964                            PAGE   25

    1165              
    1166              
    1167              DW$T$37 .dwtag  DW_TAG_structure_type
    1168                      .dwattr DW$T$37, DW_AT_byte_size(0x01)
    1169              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1170                      .dwattr DW$159, DW_AT_name("Mdata_reflag"), DW_AT_symbol_name("_Mdata_reflag")
    1171                      .dwattr DW$159, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1172                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1173                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1174              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1175                      .dwattr DW$160, DW_AT_name("Edata_reflag"), DW_AT_symbol_name("_Edata_reflag")
    1176                      .dwattr DW$160, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1177                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1179              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1180                      .dwattr DW$161, DW_AT_name("Edata_Ireflag"), DW_AT_symbol_name("_Edata_Ireflag")
    1181                      .dwattr DW$161, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1182                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1184              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1185                      .dwattr DW$162, DW_AT_name("Edata_Preflag"), DW_AT_symbol_name("_Edata_Preflag")
    1186                      .dwattr DW$162, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1187                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1188                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1189              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1190                      .dwattr DW$163, DW_AT_name("Edata_Qreflag"), DW_AT_symbol_name("_Edata_Qreflag")
    1191                      .dwattr DW$163, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1192                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1193                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1194              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1195                      .dwattr DW$164, DW_AT_name("Edata_Jreflag"), DW_AT_symbol_name("_Edata_Jreflag")
    1196                      .dwattr DW$164, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1197                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1198                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1199              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1200                      .dwattr DW$165, DW_AT_name("DLerrdata_reflag"), DW_AT_symbol_name("_DLerrdata_reflag")
    1201                      .dwattr DW$165, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1202                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1203                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1204              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1205                      .dwattr DW$166, DW_AT_name("AU_OV"), DW_AT_symbol_name("_AU_OV")
    1206                      .dwattr DW$166, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1207                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1208                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1209              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1210                      .dwattr DW$167, DW_AT_name("BU_OV"), DW_AT_symbol_name("_BU_OV")
    1211                      .dwattr DW$167, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1212                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1214              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1215                      .dwattr DW$168, DW_AT_name("CU_OV"), DW_AT_symbol_name("_CU_OV")
    1216                      .dwattr DW$168, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1217                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1219              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:17 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8964                            PAGE   26

    1220                      .dwattr DW$169, DW_AT_name("AI_OV"), DW_AT_symbol_name("_AI_OV")
    1221                      .dwattr DW$169, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1222                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1224              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1225                      .dwattr DW$170, DW_AT_name("BI_OV"), DW_AT_symbol_name("_BI_OV")
    1226                      .dwattr DW$170, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1227                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1229              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1230                      .dwattr DW$171, DW_AT_name("CI_OV"), DW_AT_symbol_name("_CI_OV")
    1231                      .dwattr DW$171, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1232                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1233                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1234              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1235                      .dwattr DW$172, DW_AT_name("RES"), DW_AT_symbol_name("_RES")
    1236                      .dwattr DW$172, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x02)
    1237                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1238                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1239                      .dwendtag DW$T$37
    1240              
    1241              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$21)
    1242                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    1243              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    1244                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    1245              
    1246              DW$T$21 .dwtag  DW_TAG_structure_type
    1247                      .dwattr DW$T$21, DW_AT_name("edit_mem")
    1248                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    1249              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1250                      .dwattr DW$173, DW_AT_name("x"), DW_AT_symbol_name("_x")
    1251                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1252                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1253              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1254                      .dwattr DW$174, DW_AT_name("y"), DW_AT_symbol_name("_y")
    1255                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1256                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1257              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1258                      .dwattr DW$175, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    1259                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1260                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1261              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1262                      .dwattr DW$176, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    1263                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1264                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1265              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1266                      .dwattr DW$177, DW_AT_name("id"), DW_AT_symbol_name("_id")
    1267                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1268                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1269              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1270                      .dwattr DW$178, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    1271                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1272                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1273              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1274                      .dwattr DW$179, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:17 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8964                            PAGE   27

    1275                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1276                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1277                      .dwendtag DW$T$21
    1278              
    1279              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
    1280                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    1281              DW$180  .dwtag  DW_TAG_far_type
    1282                      .dwattr DW$180, DW_AT_type(*DW$T$25)
    1283              DW$T$29 .dwtag  DW_TAG_const_type
    1284                      .dwattr DW$T$29, DW_AT_type(*DW$180)
    1285              
    1286                      .dwattr DW$81, DW_AT_external(0x01)
    1287                      .dwattr DW$82, DW_AT_external(0x01)
    1288                      .dwattr DW$67, DW_AT_external(0x01)
    1289                      .dwattr DW$49, DW_AT_external(0x01)
    1290                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1291              
    1292              ;***************************************************************
    1293              ;* DWARF CIE ENTRIES                                           *
    1294              ;***************************************************************
    1295              
    1296              DW$CIE  .dwcie 1, 40
    1297                      .dwcfa  0x0c, 20, 0
    1298                      .dwcfa  0x07, 0
    1299                      .dwcfa  0x07, 1
    1300                      .dwcfa  0x07, 2
    1301                      .dwcfa  0x07, 3
    1302                      .dwcfa  0x07, 4
    1303                      .dwcfa  0x07, 5
    1304                      .dwcfa  0x08, 6
    1305                      .dwcfa  0x08, 7
    1306                      .dwcfa  0x08, 8
    1307                      .dwcfa  0x08, 9
    1308                      .dwcfa  0x08, 10
    1309                      .dwcfa  0x08, 11
    1310                      .dwcfa  0x07, 12
    1311                      .dwcfa  0x07, 13
    1312                      .dwcfa  0x07, 14
    1313                      .dwcfa  0x07, 15
    1314                      .dwcfa  0x07, 16
    1315                      .dwcfa  0x07, 17
    1316                      .dwcfa  0x07, 18
    1317                      .dwcfa  0x07, 19
    1318                      .dwcfa  0x07, 20
    1319                      .dwcfa  0x07, 21
    1320                      .dwcfa  0x07, 22
    1321                      .dwcfa  0x07, 23
    1322                      .dwcfa  0x07, 24
    1323                      .dwcfa  0x07, 25
    1324                      .dwcfa  0x07, 26
    1325                      .dwcfa  0x08, 27
    1326                      .dwcfa  0x07, 28
    1327                      .dwcfa  0x07, 29
    1328                      .dwcfa  0x07, 30
    1329                      .dwcfa  0x07, 31
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:17 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8964                            PAGE   28

    1330                      .dwcfa  0x07, 32
    1331                      .dwcfa  0x07, 33
    1332                      .dwcfa  0x07, 34
    1333                      .dwcfa  0x07, 35
    1334                      .dwcfa  0x07, 36
    1335                      .dwcfa  0x07, 37
    1336                      .dwcfa  0x07, 38
    1337                      .dwcfa  0x07, 39
    1338                      .dwcfa  0x07, 40
    1339              
    1340              ;***************************************************************
    1341              ;* DWARF REGISTER MAP                                          *
    1342              ;***************************************************************
    1343              
    1344              DW$181  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    1345                      .dwattr DW$181, DW_AT_location[DW_OP_reg0]
