TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:16 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2402                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sun Oct 09 17:37:15 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_BBmod_connect.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("app_BBmod_fun_exit"), DW_AT_symbol_name("_app_BBmod_fun_exit")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              

     212                      .dwattr DW$15, DW_AT_location[DW_OP_breg20 -6]
     213              DW$16   .dwtag  DW_TAG_variable, DW_AT_name("mod_id"), DW_AT_symbol_name("_mod_id")
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:16 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2402                            PAGE    5

     214                      .dwattr DW$16, DW_AT_type(*DW$T$19)
     215                      .dwattr DW$16, DW_AT_location[DW_OP_breg20 -7]
     216                      .dwpsn  "app_BBmod_connect.c",69,2
     217 00000014 8F00'         MOVL      XAR4,#_app_BBmod_insmod ; |69| 
         00000015 0005 
     218 00000016 A844          MOVL      *-SP[4],XAR4          ; |69| 
     219                      .dwpsn  "app_BBmod_connect.c",70,2
     220 00000017 8F00'         MOVL      XAR4,#_app_BBmod_exit ; |70| 
         00000018 000D 
     221 00000019 A842          MOVL      *-SP[2],XAR4          ; |70| 
     222                      .dwpsn  "app_BBmod_connect.c",71,2
     223 0000001a 5CAD          MOVZ      AR4,SP                ; |71| 
     224 0000001b DC86          SUBB      XAR4,#6               ; |71| 
     225 0000001c 7640!         LCR       #_app_module_add      ; |71| 
         0000001d 0000 
     226                      ; call occurs [#_app_module_add] ; |71| 
     227 0000001e 9647          MOV       *-SP[7],AL            ; |71| 
     228                      .dwpsn  "app_BBmod_connect.c",72,2
     229                      .dwpsn  "app_BBmod_connect.c",73,1
     230 0000001f FE88          SUBB      SP,#8                 ; |72| 
     231                      .dwcfa  0x1d, -2
     232 00000020 0006          LRETR
     233                      ; return occurs
     234                      .dwattr DW$14, DW_AT_end_file("app_BBmod_connect.c")
     235                      .dwattr DW$14, DW_AT_end_line(0x49)
     236                      .dwattr DW$14, DW_AT_end_column(0x01)
     237                      .dwendentry
     238                      .dwendtag DW$14
     239              
     240              ;***************************************************************
     241              ;* UNDEFINED EXTERNAL REFERENCES                               *
     242              ;***************************************************************
     243                      .global _app_BBmod_fun_exit
     244                      .global _app_global_resouce_req
     245                      .global _app_global_resouce_release
     246                      .global _app_BBmod_fun_entry
     247                      .global _app_module_add
     248                      .global _app_global_DLuser_arg_read
     249                      .global _g_user_arg
     250              
     251              ;***************************************************************
     252              ;* TYPE INFORMATION                                            *
     253              ;***************************************************************
     254              DW$T$3  .dwtag  DW_TAG_pointer_type
     255                      .dwattr DW$T$3, DW_AT_address_class(0x16)
     256              
     257              DW$T$20 .dwtag  DW_TAG_subroutine_type
     258                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     259              
     260              DW$T$32 .dwtag  DW_TAG_subroutine_type
     261                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
     262              DW$17   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     263                      .dwendtag DW$T$32
     264              
     265              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:16 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2402                            PAGE    6

     266                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     267                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     268              
     269              DW$T$34 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     270                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     271              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
     272                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     273              
     274              DW$T$38 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     275                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     276              DW$18   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
     277                      .dwendtag DW$T$38
     278              
     279              
     280              DW$T$40 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     281                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     282              DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("app_mod_inlet_t"), DW_AT_type(*DW$T$24)
     283                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
     284              DW$T$37 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
     285                      .dwattr DW$T$37, DW_AT_address_class(0x16)
     286              DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("DL_user_info_t"), DW_AT_type(*DW$T$31)
     287                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
     288              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     289                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     290                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     291              
     292              DW$T$24 .dwtag  DW_TAG_structure_type
     293                      .dwattr DW$T$24, DW_AT_byte_size(0x06)
     294              DW$19   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     295                      .dwattr DW$19, DW_AT_name("mod_id"), DW_AT_symbol_name("_mod_id")
     296                      .dwattr DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     297                      .dwattr DW$19, DW_AT_accessibility(DW_ACCESS_public)
     298              DW$20   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     299                      .dwattr DW$20, DW_AT_name("insmod_fun"), DW_AT_symbol_name("_insmod_fun")
     300                      .dwattr DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     301                      .dwattr DW$20, DW_AT_accessibility(DW_ACCESS_public)
     302              DW$21   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     303                      .dwattr DW$21, DW_AT_name("exitmod_fun"), DW_AT_symbol_name("_exitmod_fun")
     304                      .dwattr DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     305                      .dwattr DW$21, DW_AT_accessibility(DW_ACCESS_public)
     306                      .dwendtag DW$T$24
     307              
     308              
     309              DW$T$31 .dwtag  DW_TAG_structure_type
     310                      .dwattr DW$T$31, DW_AT_byte_size(0xfd)
     311              DW$22   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     312                      .dwattr DW$22, DW_AT_name("cs"), DW_AT_symbol_name("_cs")
     313                      .dwattr DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     314                      .dwattr DW$22, DW_AT_accessibility(DW_ACCESS_public)
     315              DW$23   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
     316                      .dwattr DW$23, DW_AT_name("qs"), DW_AT_symbol_name("_qs")
     317                      .dwattr DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     318                      .dwattr DW$23, DW_AT_accessibility(DW_ACCESS_public)
     319              DW$24   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     320                      .dwattr DW$24, DW_AT_name("way"), DW_AT_symbol_name("_way")
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:16 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2402                            PAGE    7

     321                      .dwattr DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     322                      .dwattr DW$24, DW_AT_accessibility(DW_ACCESS_public)
     323              DW$25   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     324                      .dwattr DW$25, DW_AT_name("dlsr"), DW_AT_symbol_name("_dlsr")
     325                      .dwattr DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     326                      .dwattr DW$25, DW_AT_accessibility(DW_ACCESS_public)
     327              DW$26   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     328                      .dwattr DW$26, DW_AT_name("bb1"), DW_AT_symbol_name("_bb1")
     329                      .dwattr DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     330                      .dwattr DW$26, DW_AT_accessibility(DW_ACCESS_public)
     331              DW$27   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     332                      .dwattr DW$27, DW_AT_name("bb2"), DW_AT_symbol_name("_bb2")
     333                      .dwattr DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
     334                      .dwattr DW$27, DW_AT_accessibility(DW_ACCESS_public)
     335              DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     336                      .dwattr DW$28, DW_AT_name("user_id"), DW_AT_symbol_name("_user_id")
     337                      .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     338                      .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     339              DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     340                      .dwattr DW$29, DW_AT_name("user_name"), DW_AT_symbol_name("_user_name")
     341                      .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
     342                      .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     343              DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     344                      .dwattr DW$30, DW_AT_name("user_name_slaver"), DW_AT_symbol_name("_user_name_slaver")
     345                      .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     346                      .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     347              DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     348                      .dwattr DW$31, DW_AT_name("time_buf"), DW_AT_symbol_name("_time_buf")
     349                      .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
     350                      .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     351              DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     352                      .dwattr DW$32, DW_AT_name("temp_buf"), DW_AT_symbol_name("_temp_buf")
     353                      .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
     354                      .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     355              DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     356                      .dwattr DW$33, DW_AT_name("hnm_buf"), DW_AT_symbol_name("_hnm_buf")
     357                      .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x7f]
     358                      .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     359              DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     360                      .dwattr DW$34, DW_AT_name("wrok_list"), DW_AT_symbol_name("_wrok_list")
     361                      .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
     362                      .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     363              DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     364                      .dwattr DW$35, DW_AT_name("meter_id1"), DW_AT_symbol_name("_meter_id1")
     365                      .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0xa9]
     366                      .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     367              DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     368                      .dwattr DW$36, DW_AT_name("meter_id2"), DW_AT_symbol_name("_meter_id2")
     369                      .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
     370                      .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     371              DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     372                      .dwattr DW$37, DW_AT_name("worker1"), DW_AT_symbol_name("_worker1")
     373                      .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0xd3]
     374                      .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     375              DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:16 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2402                            PAGE    8

     376                      .dwattr DW$38, DW_AT_name("worker2"), DW_AT_symbol_name("_worker2")
     377                      .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
     378                      .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     379                      .dwendtag DW$T$31
     380              
     381              DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("app_insmod_t"), DW_AT_type(*DW$T$21)
     382                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
     383              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("app_exitmod_t"), DW_AT_type(*DW$T$21)
     384                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     385              DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     386                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
     387                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
     388              
     389              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
     390                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
     391                      .dwattr DW$T$26, DW_AT_byte_size(0x07)
     392              DW$39   .dwtag  DW_TAG_subrange_type
     393                      .dwattr DW$39, DW_AT_upper_bound(0x06)
     394                      .dwendtag DW$T$26
     395              
     396              
     397              DW$T$27 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
     398                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     399                      .dwattr DW$T$27, DW_AT_byte_size(0x04)
     400              DW$40   .dwtag  DW_TAG_subrange_type
     401                      .dwattr DW$40, DW_AT_upper_bound(0x03)
     402                      .dwendtag DW$T$27
     403              
     404              
     405              DW$T$28 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
     406                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     407                      .dwattr DW$T$28, DW_AT_byte_size(0x06)
     408              DW$41   .dwtag  DW_TAG_subrange_type
     409                      .dwattr DW$41, DW_AT_upper_bound(0x05)
     410                      .dwendtag DW$T$28
     411              
     412              
     413              DW$T$29 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
     414                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
     415                      .dwattr DW$T$29, DW_AT_byte_size(0x03)
     416              DW$42   .dwtag  DW_TAG_subrange_type
     417                      .dwattr DW$42, DW_AT_upper_bound(0x02)
     418                      .dwendtag DW$T$29
     419              
     420              
     421              DW$T$30 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
     422                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     423                      .dwattr DW$T$30, DW_AT_byte_size(0x15)
     424              DW$43   .dwtag  DW_TAG_subrange_type
     425                      .dwattr DW$43, DW_AT_upper_bound(0x14)
     426                      .dwendtag DW$T$30
     427              
     428              DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
     429                      .dwattr DW$T$21, DW_AT_address_class(0x16)
     430              
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:16 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2402                            PAGE    9

     431                      .dwattr DW$14, DW_AT_external(0x01)
     432                      .dwattr DW$14, DW_AT_type(*DW$T$19)
     433                      .dwattr DW$13, DW_AT_external(0x01)
     434                      .dwattr DW$12, DW_AT_external(0x01)
     435                      .dwattr DW$11, DW_AT_external(0x01)
     436                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     437              
     438              ;***************************************************************
     439              ;* DWARF CIE ENTRIES                                           *
