TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:20 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1642                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sun Oct 09 17:37:20 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_BBmod_measure.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

     860                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
     861              DW$83   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     862              DW$84   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     863                      .dwendtag DW$T$68
     864              
     865              
     866              DW$T$70 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     867                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
     868              DW$85   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     869              DW$86   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
     870                      .dwendtag DW$T$70
     871              
     872              
     873              DW$T$72 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     874                      .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
     875              DW$87   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     876                      .dwendtag DW$T$72
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:20 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1642                            PAGE   18

     877              
     878              DW$T$74 .dwtag  DW_TAG_typedef, DW_AT_name("BOOL"), DW_AT_type(*DW$T$6)
     879                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
     880              
     881              DW$T$75 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$74)
     882                      .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
     883              DW$88   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     884                      .dwendtag DW$T$75
     885              
     886              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     887                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     888                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     889              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
     890                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     891              
     892              DW$T$77 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     893                      .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
     894              DW$89   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
     895                      .dwendtag DW$T$77
     896              
     897              
     898              DW$T$79 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     899                      .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
     900              DW$90   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$16)
     901              DW$91   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
     902              DW$92   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     903                      .dwendtag DW$T$79
     904              
     905              DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
     906                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     907              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
     908                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
     909                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
     910              
     911              DW$T$81 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$16)
     912                      .dwattr DW$T$81, DW_AT_language(DW_LANG_C)
     913              DW$93   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$16)
     914                      .dwendtag DW$T$81
     915              
     916              DW$T$56 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
     917                      .dwattr DW$T$56, DW_AT_address_class(0x16)
     918              
     919              DW$T$83 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
     920                      .dwattr DW$T$83, DW_AT_language(DW_LANG_C)
     921                      .dwattr DW$T$83, DW_AT_byte_size(0x14)
     922              DW$94   .dwtag  DW_TAG_subrange_type
     923                      .dwattr DW$94, DW_AT_upper_bound(0x13)
     924                      .dwendtag DW$T$83
     925              
     926              DW$T$51 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$50)
     927                      .dwattr DW$T$51, DW_AT_address_class(0x16)
     928              DW$T$59 .dwtag  DW_TAG_typedef, DW_AT_name("measure_param_t"), DW_AT_type(*DW$T$36)
     929                      .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
     930              DW$T$60 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$59)
     931                      .dwattr DW$T$60, DW_AT_address_class(0x16)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:20 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1642                            PAGE   19

     932              DW$T$64 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
     933                      .dwattr DW$T$64, DW_AT_address_class(0x16)
     934              DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     935                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
     936                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
     937              DW$T$50 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$32)
     938                      .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
     939              
     940              DW$T$36 .dwtag  DW_TAG_structure_type
     941                      .dwattr DW$T$36, DW_AT_name("_measure_param_t")
     942                      .dwattr DW$T$36, DW_AT_byte_size(0x48)
     943              DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     944                      .dwattr DW$95, DW_AT_name("phase_a"), DW_AT_symbol_name("_phase_a")
     945                      .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     946                      .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
     947              DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     948                      .dwattr DW$96, DW_AT_name("phase_b"), DW_AT_symbol_name("_phase_b")
     949                      .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     950                      .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
     951              DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     952                      .dwattr DW$97, DW_AT_name("phase_c"), DW_AT_symbol_name("_phase_c")
     953                      .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     954                      .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
     955              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     956                      .dwattr DW$98, DW_AT_name("f_Uab"), DW_AT_symbol_name("_f_Uab")
     957                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     958                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
     959              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     960                      .dwattr DW$99, DW_AT_name("f_Ubc"), DW_AT_symbol_name("_f_Ubc")
     961                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     962                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
     963              DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     964                      .dwattr DW$100, DW_AT_name("f_Uac"), DW_AT_symbol_name("_f_Uac")
     965                      .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     966                      .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
     967              DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     968                      .dwattr DW$101, DW_AT_name("f_JIac"), DW_AT_symbol_name("_f_JIac")
     969                      .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     970                      .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
     971              DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     972                      .dwattr DW$102, DW_AT_name("f_JIbc"), DW_AT_symbol_name("_f_JIbc")
     973                      .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     974                      .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
     975              DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     976                      .dwattr DW$103, DW_AT_name("f_JIab"), DW_AT_symbol_name("_f_JIab")
     977                      .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     978                      .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
     979              DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     980                      .dwattr DW$104, DW_AT_name("f_JUac"), DW_AT_symbol_name("_f_JUac")
     981                      .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     982                      .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
     983              DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     984                      .dwattr DW$105, DW_AT_name("f_JUbc"), DW_AT_symbol_name("_f_JUbc")
     985                      .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     986                      .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:20 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1642                            PAGE   20

     987              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     988                      .dwattr DW$106, DW_AT_name("f_JUab"), DW_AT_symbol_name("_f_JUab")
     989                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     990                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
     991              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     992                      .dwattr DW$107, DW_AT_name("f_Cos"), DW_AT_symbol_name("_f_Cos")
     993                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     994                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
     995              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
     996                      .dwattr DW$108, DW_AT_name("f_Pabc"), DW_AT_symbol_name("_f_Pabc")
     997                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     998                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
     999              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1000                      .dwattr DW$109, DW_AT_name("f_Qabc"), DW_AT_symbol_name("_f_Qabc")
    1001                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1002                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1003              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    1004                      .dwattr DW$110, DW_AT_name("f_err"), DW_AT_symbol_name("_f_err")
    1005                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1006                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1007              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    1008                      .dwattr DW$111, DW_AT_name("f_err_Q"), DW_AT_symbol_name("_f_err_Q")
    1009                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1010                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1011              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1012                      .dwattr DW$112, DW_AT_name("f_Feq"), DW_AT_symbol_name("_f_Feq")
    1013                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1014                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1015                      .dwendtag DW$T$36
    1016              
    1017              DW$T$63 .dwtag  DW_TAG_typedef, DW_AT_name("DL_reflag_u"), DW_AT_type(*DW$T$39)
    1018                      .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    1019              
    1020              DW$T$35 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$16)
    1021                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
    1022                      .dwattr DW$T$35, DW_AT_byte_size(0x08)
    1023              DW$113  .dwtag  DW_TAG_subrange_type
    1024                      .dwattr DW$113, DW_AT_upper_bound(0x03)
    1025                      .dwendtag DW$T$35
    1026              
    1027              
    1028              DW$T$32 .dwtag  DW_TAG_structure_type
    1029                      .dwattr DW$T$32, DW_AT_name("hwin")
    1030                      .dwattr DW$T$32, DW_AT_byte_size(0x42)
    1031              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1032                      .dwattr DW$114, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    1033                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1034                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1035              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1036                      .dwattr DW$115, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    1037                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1038                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1039              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1040                      .dwattr DW$116, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    1041                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:20 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1642                            PAGE   21

    1042                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1043              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1044                      .dwattr DW$117, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    1045                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1046                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1047              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1048                      .dwattr DW$118, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    1049                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1050                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1051              DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1052                      .dwattr DW$119, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    1053                      .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1054                      .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1055              DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1056                      .dwattr DW$120, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    1057                      .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1058                      .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1059              DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1060                      .dwattr DW$121, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    1061                      .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1062                      .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1063              DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1064                      .dwattr DW$122, DW_AT_name("type"), DW_AT_symbol_name("_type")
    1065                      .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1066                      .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1067              DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1068                      .dwattr DW$123, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    1069                      .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1070                      .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1071              DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1072                      .dwattr DW$124, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    1073                      .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1074                      .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1075              DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1076                      .dwattr DW$125, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
    1077                      .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1078                      .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1079              DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1080                      .dwattr DW$126, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    1081                      .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1082                      .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1083              DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1084                      .dwattr DW$127, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    1085                      .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1086                      .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1087              DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1088                      .dwattr DW$128, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    1089                      .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1090                      .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1091              DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1092                      .dwattr DW$129, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
    1093                      .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1094                      .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1095              DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1096                      .dwattr DW$130, DW_AT_name("button_flags"), DW_AT_symbol_name("_button_flags")
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:20 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1642                            PAGE   22

    1097                      .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1098                      .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1099              DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1100                      .dwattr DW$131, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
    1101                      .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    1102                      .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1103              DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1104                      .dwattr DW$132, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
    1105                      .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1106                      .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1107              DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1108                      .dwattr DW$133, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
    1109                      .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1110                      .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1111              DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1112                      .dwattr DW$134, DW_AT_name("drop_list_is_start"), DW_AT_symbol_name("_drop_list_is_start")
    1113                      .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1114                      .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1115              DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    1116                      .dwattr DW$135, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    1117                      .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1118                      .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1119              DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1120                      .dwattr DW$136, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
    1121                      .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1122                      .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1123              DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1124                      .dwattr DW$137, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    1125                      .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    1126                      .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1127              DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1128                      .dwattr DW$138, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
    1129                      .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1130                      .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1131                      .dwendtag DW$T$32
    1132              
    1133              DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    1134                      .dwattr DW$T$22, DW_AT_address_class(0x16)
    1135              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("phase_param_t"), DW_AT_type(*DW$T$33)
    1136                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    1137              
    1138              DW$T$39 .dwtag  DW_TAG_union_type
    1139                      .dwattr DW$T$39, DW_AT_byte_size(0x01)
    1140              DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1141                      .dwattr DW$139, DW_AT_name("reflag"), DW_AT_symbol_name("_reflag")
    1142                      .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1143                      .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1144              DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    1145                      .dwattr DW$140, DW_AT_name("reflag_bits"), DW_AT_symbol_name("_reflag_bits")
    1146                      .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1147                      .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1148                      .dwendtag DW$T$39
    1149              
    1150              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    1151                      .dwattr DW$T$24, DW_AT_address_class(0x16)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:20 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1642                            PAGE   23

    1152              
    1153              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    1154                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    1155                      .dwattr DW$T$26, DW_AT_byte_size(0x1e)
    1156              DW$141  .dwtag  DW_TAG_subrange_type
    1157                      .dwattr DW$141, DW_AT_upper_bound(0x1d)
    1158                      .dwendtag DW$T$26
    1159              
    1160              DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
    1161                      .dwattr DW$T$31, DW_AT_address_class(0x16)
    1162              
    1163              DW$T$33 .dwtag  DW_TAG_structure_type
    1164                      .dwattr DW$T$33, DW_AT_name("_phase_param_t")
    1165                      .dwattr DW$T$33, DW_AT_byte_size(0x0a)
    1166              DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1167                      .dwattr DW$142, DW_AT_name("f_U"), DW_AT_symbol_name("_f_U")
    1168                      .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169                      .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1170              DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1171                      .dwattr DW$143, DW_AT_name("f_I"), DW_AT_symbol_name("_f_I")
    1172                      .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1173                      .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1174              DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1175                      .dwattr DW$144, DW_AT_name("f_J"), DW_AT_symbol_name("_f_J")
    1176                      .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1177                      .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1178              DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1179                      .dwattr DW$145, DW_AT_name("f_P"), DW_AT_symbol_name("_f_P")
    1180                      .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1181                      .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1182              DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1183                      .dwattr DW$146, DW_AT_name("f_Q"), DW_AT_symbol_name("_f_Q")
    1184                      .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1185                      .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1186                      .dwendtag DW$T$33
    1187              
    1188              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("reflag_bits_t"), DW_AT_type(*DW$T$37)
    1189                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    1190              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$21)
    1191                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    1192              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    1193                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    1194              
    1195              DW$T$37 .dwtag  DW_TAG_structure_type
    1196                      .dwattr DW$T$37, DW_AT_byte_size(0x01)
    1197              DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1198                      .dwattr DW$147, DW_AT_name("Mdata_reflag"), DW_AT_symbol_name("_Mdata_reflag")
    1199                      .dwattr DW$147, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1200                      .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1201                      .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1202              DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1203                      .dwattr DW$148, DW_AT_name("Edata_reflag"), DW_AT_symbol_name("_Edata_reflag")
    1204                      .dwattr DW$148, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1205                      .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1206                      .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:20 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1642                            PAGE   24

    1207              DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1208                      .dwattr DW$149, DW_AT_name("Edata_Ireflag"), DW_AT_symbol_name("_Edata_Ireflag")
    1209                      .dwattr DW$149, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1210                      .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1211                      .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1212              DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1213                      .dwattr DW$150, DW_AT_name("Edata_Preflag"), DW_AT_symbol_name("_Edata_Preflag")
    1214                      .dwattr DW$150, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1215                      .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1216                      .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1217              DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1218                      .dwattr DW$151, DW_AT_name("Edata_Qreflag"), DW_AT_symbol_name("_Edata_Qreflag")
    1219                      .dwattr DW$151, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1220                      .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1221                      .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1222              DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1223                      .dwattr DW$152, DW_AT_name("Edata_Jreflag"), DW_AT_symbol_name("_Edata_Jreflag")
    1224                      .dwattr DW$152, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1225                      .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1226                      .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1227              DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1228                      .dwattr DW$153, DW_AT_name("DLerrdata_reflag"), DW_AT_symbol_name("_DLerrdata_reflag")
    1229                      .dwattr DW$153, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1230                      .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1231                      .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1232              DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1233                      .dwattr DW$154, DW_AT_name("AU_OV"), DW_AT_symbol_name("_AU_OV")
    1234                      .dwattr DW$154, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1235                      .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236                      .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1237              DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1238                      .dwattr DW$155, DW_AT_name("BU_OV"), DW_AT_symbol_name("_BU_OV")
    1239                      .dwattr DW$155, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1240                      .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1242              DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1243                      .dwattr DW$156, DW_AT_name("CU_OV"), DW_AT_symbol_name("_CU_OV")
    1244                      .dwattr DW$156, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1245                      .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1247              DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1248                      .dwattr DW$157, DW_AT_name("AI_OV"), DW_AT_symbol_name("_AI_OV")
    1249                      .dwattr DW$157, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1250                      .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1251                      .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1252              DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1253                      .dwattr DW$158, DW_AT_name("BI_OV"), DW_AT_symbol_name("_BI_OV")
    1254                      .dwattr DW$158, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1255                      .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1256                      .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1257              DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1258                      .dwattr DW$159, DW_AT_name("CI_OV"), DW_AT_symbol_name("_CI_OV")
    1259                      .dwattr DW$159, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1260                      .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1261                      .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:20 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1642                            PAGE   25

    1262              DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1263                      .dwattr DW$160, DW_AT_name("RES"), DW_AT_symbol_name("_RES")
    1264                      .dwattr DW$160, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x02)
    1265                      .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1266                      .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1267                      .dwendtag DW$T$37
    1268              
    1269              
    1270              DW$T$21 .dwtag  DW_TAG_structure_type
    1271                      .dwattr DW$T$21, DW_AT_name("edit_mem")
    1272                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    1273              DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1274                      .dwattr DW$161, DW_AT_name("x"), DW_AT_symbol_name("_x")
    1275                      .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276                      .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1277              DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1278                      .dwattr DW$162, DW_AT_name("y"), DW_AT_symbol_name("_y")
    1279                      .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1280                      .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1281              DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1282                      .dwattr DW$163, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    1283                      .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1284                      .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1285              DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1286                      .dwattr DW$164, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    1287                      .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1288                      .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1289              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1290                      .dwattr DW$165, DW_AT_name("id"), DW_AT_symbol_name("_id")
    1291                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1292                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1293              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1294                      .dwattr DW$166, DW_AT_name("flag"), DW_AT_symbol_name("_flag")
    1295                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1296                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1297              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1298                      .dwattr DW$167, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    1299                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1300                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1301                      .dwendtag DW$T$21
    1302              
    1303              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
    1304                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    1305              DW$168  .dwtag  DW_TAG_far_type
    1306                      .dwattr DW$168, DW_AT_type(*DW$T$25)
    1307              DW$T$29 .dwtag  DW_TAG_const_type
    1308                      .dwattr DW$T$29, DW_AT_type(*DW$168)
    1309              
    1310                      .dwattr DW$47, DW_AT_external(0x01)
    1311                      .dwattr DW$50, DW_AT_external(0x01)
    1312                      .dwattr DW$54, DW_AT_external(0x01)
    1313                      .dwattr DW$44, DW_AT_external(0x01)
    1314                      .dwattr DW$67, DW_AT_external(0x01)
    1315                      .dwattr DW$68, DW_AT_external(0x01)
    1316                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Sun Oct 09 17:37:20 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1642                            PAGE   26

    1317              
    1318              ;***************************************************************
    1319              ;* DWARF CIE ENTRIES                                           *
    1320              ;***************************************************************
    1321              
    1322              DW$CIE  .dwcie 1, 40
    1323                      .dwcfa  0x0c, 20, 0
    1324                      .dwcfa  0x07, 0
    1325                      .dwcfa  0x07, 1
    1326                      .dwcfa  0x07, 2
    1327                      .dwcfa  0x07, 3
    1328                      .dwcfa  0x07, 4
    1329                      .dwcfa  0x07, 5
    1330                      .dwcfa  0x08, 6
    1331                      .dwcfa  0x08, 7
    1332                      .dwcfa  0x08, 8
    1333                      .dwcfa  0x08, 9
    1334                      .dwcfa  0x08, 10
    1335                      .dwcfa  0x08, 11
    1336                      .dwcfa  0x07, 12
    1337                      .dwcfa  0x07, 13
    1338                      .dwcfa  0x07, 14
    1339                      .dwcfa  0x07, 15
    1340                      .dwcfa  0x07, 16
    1341                      .dwcfa  0x07, 17
    1342                      .dwcfa  0x07, 18
    1343                      .dwcfa  0x07, 19
    1344                      .dwcfa  0x07, 20
    1345                      .dwcfa  0x07, 21
    1346                      .dwcfa  0x07, 22
    1347                      .dwcfa  0x07, 23
    1348                      .dwcfa  0x07, 24
    1349                      .dwcfa  0x07, 25
    1350                      .dwcfa  0x07, 26
    1351                      .dwcfa  0x08, 27
    1352                      .dwcfa  0x07, 28
    1353                      .dwcfa  0x07, 29
    1354                      .dwcfa  0x07, 30
    1355                      .dwcfa  0x07, 31
    1356                      .dwcfa  0x07, 32
    1357                      .dwcfa  0x07, 33
    1358                      .dwcfa  0x07, 34
    1359                      .dwcfa  0x07, 35
    1360                      .dwcfa  0x07, 36
    1361                      .dwcfa  0x07, 37
    1362                      .dwcfa  0x07, 38
    1363                      .dwcfa  0x07, 39
    1364                      .dwcfa  0x07, 40
    1365              
    1366              ;***************************************************************
    1367              ;* DWARF REGISTER MAP                                          *
    1368              ;***************************************************************
    1369              
    1370              DW$169  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
