TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:20 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Wed Oct 10 15:15:19 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("GUI10x10.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13                      .global _GUI_Font10_ASCII
      14 00000000               .sect   ".econst"
      15                      .align  2
      16 00000000       _GUI_Font10_ASCII:
      17 00000000 000A          .field          10,16                   ; _GUI_Font10_ASCII._wide @ 0

    2348 00000611 0002          .field          2,16                    ; _GUI_Font10_ASCII_CharInfo[92]._XDist @ 8848
    2349 00000612 0001          .field          1,16                    ; _GUI_Font10_ASCII_CharInfo[92]._BytesPerLine @ 8864
    2350 00000613               .space  16
    2351 00000614 0140+         .field          _acFont10_ASCII_124,32          ; _GUI_Font10_ASCII_CharInfo[92]._pData @ 8896
         00000615 0000 
    2352 00000616 0004          .field          4,16                    ; _GUI_Font10_ASCII_CharInfo[93]._XSize @ 8928
    2353 00000617 0004          .field          4,16                    ; _GUI_Font10_ASCII_CharInfo[93]._XDist @ 8944
    2354 00000618 0001          .field          1,16                    ; _GUI_Font10_ASCII_CharInfo[93]._BytesPerLine @ 8960
    2355 00000619               .space  16
    2356 0000061a 012C+         .field          _acFont10_ASCII_125,32          ; _GUI_Font10_ASCII_CharInfo[93]._pData @ 8992
         0000061b 0000 
    2357 0000061c 0006          .field          6,16                    ; _GUI_Font10_ASCII_CharInfo[94]._XSize @ 9024
    2358 0000061d 0006          .field          6,16                    ; _GUI_Font10_ASCII_CharInfo[94]._XDist @ 9040
    2359 0000061e 0001          .field          1,16                    ; _GUI_Font10_ASCII_CharInfo[94]._BytesPerLine @ 9056
    2360 0000061f               .space  16
    2361 00000620 0136+         .field          _acFont10_ASCII_126,32          ; _GUI_Font10_ASCII_CharInfo[94]._pData @ 9088
         00000621 0000 
    2362 00000622               .space  96
    2363              
    2364              DW$98   .dwtag  DW_TAG_variable, DW_AT_name("GUI_Font10_ASCII_CharInfo"), DW_AT_symbol_name("_GUI_Font10_ASCI
    2365                      .dwattr DW$98, DW_AT_location[DW_OP_addr _GUI_Font10_ASCII_CharInfo]
    2366                      .dwattr DW$98, DW_AT_type(*DW$T$31)
    2367                      .dwattr DW$98, DW_AT_external(0x01)
    2368              ;       C:\CCStudio_v3.3\C2000\cgtools\bin\ac2000.exe -@C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0684 
    2369              
    2370              ;***************************************************************
    2371              ;* TYPE INFORMATION                                            *
    2372              ;***************************************************************
    2373              
    2374              DW$T$29 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    2375                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    2376                      .dwattr DW$T$29, DW_AT_byte_size(0x0a)
    2377              DW$99   .dwtag  DW_TAG_subrange_type
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:20 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE   46

    2378                      .dwattr DW$99, DW_AT_upper_bound(0x09)
    2379                      .dwendtag DW$T$29
    2380              
    2381              
    2382              DW$T$30 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    2383                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    2384                      .dwattr DW$T$30, DW_AT_byte_size(0x14)
    2385              DW$100  .dwtag  DW_TAG_subrange_type
    2386                      .dwattr DW$100, DW_AT_upper_bound(0x13)
    2387                      .dwendtag DW$T$30
    2388              
    2389              
    2390              DW$T$31 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    2391                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    2392                      .dwattr DW$T$31, DW_AT_byte_size(0x240)
    2393              DW$101  .dwtag  DW_TAG_subrange_type
    2394                      .dwattr DW$101, DW_AT_upper_bound(0x5f)
    2395                      .dwendtag DW$T$31
    2396              
    2397              DW$102  .dwtag  DW_TAG_far_type
    2398                      .dwattr DW$102, DW_AT_type(*DW$T$32)
    2399              DW$T$33 .dwtag  DW_TAG_const_type
    2400                      .dwattr DW$T$33, DW_AT_type(*DW$102)
    2401              DW$103  .dwtag  DW_TAG_far_type
    2402                      .dwattr DW$103, DW_AT_type(*DW$T$34)
    2403              DW$T$35 .dwtag  DW_TAG_const_type
    2404                      .dwattr DW$T$35, DW_AT_type(*DW$103)
    2405              DW$104  .dwtag  DW_TAG_far_type
    2406                      .dwattr DW$104, DW_AT_type(*DW$T$6)
    2407              DW$T$19 .dwtag  DW_TAG_const_type
    2408                      .dwattr DW$T$19, DW_AT_type(*DW$104)
    2409              DW$105  .dwtag  DW_TAG_far_type
    2410                      .dwattr DW$105, DW_AT_type(*DW$T$22)
    2411              DW$T$23 .dwtag  DW_TAG_const_type
    2412                      .dwattr DW$T$23, DW_AT_type(*DW$105)
    2413              DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT_PROP"), DW_AT_type(*DW$T$27)
    2414                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    2415              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT"), DW_AT_type(*DW$T$28)
    2416                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    2417              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    2418                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2419                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    2420              DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_CHARINFO"), DW_AT_type(*DW$T$21)
    2421                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    2422              
    2423              DW$T$27 .dwtag  DW_TAG_structure_type
    2424                      .dwattr DW$T$27, DW_AT_name("GUI_FONT_PROP")
    2425                      .dwattr DW$T$27, DW_AT_byte_size(0x06)
    2426              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2427                      .dwattr DW$106, DW_AT_name("First"), DW_AT_symbol_name("_First")
    2428                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2429                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2430              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2431                      .dwattr DW$107, DW_AT_name("Last"), DW_AT_symbol_name("_Last")
    2432                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:20 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE   47

    2433                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2434              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    2435                      .dwattr DW$108, DW_AT_name("paCharInfo"), DW_AT_symbol_name("_paCharInfo")
    2436                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2437                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2438              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    2439                      .dwattr DW$109, DW_AT_name("pNext"), DW_AT_symbol_name("_pNext")
    2440                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2441                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2442                      .dwendtag DW$T$27
    2443              
    2444              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    2445                      .dwattr DW$T$26, DW_AT_address_class(0x16)
    2446              
    2447              DW$T$28 .dwtag  DW_TAG_structure_type
    2448                      .dwattr DW$T$28, DW_AT_name("GUI_FONT")
    2449                      .dwattr DW$T$28, DW_AT_byte_size(0x04)
    2450              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2451                      .dwattr DW$110, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
    2452                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2453                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2454              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2455                      .dwattr DW$111, DW_AT_name("high"), DW_AT_symbol_name("_high")
    2456                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2457                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2458              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    2459                      .dwattr DW$112, DW_AT_name("pCUR"), DW_AT_symbol_name("_pCUR")
    2460                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2461                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2462                      .dwendtag DW$T$28
    2463              
    2464              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    2465                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2466                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    2467              
    2468              DW$T$21 .dwtag  DW_TAG_structure_type
    2469                      .dwattr DW$T$21, DW_AT_byte_size(0x06)
    2470              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2471                      .dwattr DW$113, DW_AT_name("XSize"), DW_AT_symbol_name("_XSize")
    2472                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2473                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2474              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2475                      .dwattr DW$114, DW_AT_name("XDist"), DW_AT_symbol_name("_XDist")
    2476                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2477                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2478              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2479                      .dwattr DW$115, DW_AT_name("BytesPerLine"), DW_AT_symbol_name("_BytesPerLine")
    2480                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2481                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2482              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    2483                      .dwattr DW$116, DW_AT_name("pData"), DW_AT_symbol_name("_pData")
    2484                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2485                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2486                      .dwendtag DW$T$21
    2487              
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:20 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE   48

    2488              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    2489                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    2490              DW$117  .dwtag  DW_TAG_far_type
    2491                      .dwattr DW$117, DW_AT_type(*DW$T$27)
    2492              DW$T$25 .dwtag  DW_TAG_const_type
    2493                      .dwattr DW$T$25, DW_AT_type(*DW$117)
    2494              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
    2495                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    2496              
    2497              
    2498              ;***************************************************************
    2499              ;* DWARF CIE ENTRIES                                           *
    2500              ;***************************************************************
    2501              
    2502              DW$CIE  .dwcie 1, 40
    2503                      .dwcfa  0x0c, 20, 0
    2504                      .dwcfa  0x07, 0
    2505                      .dwcfa  0x07, 1
    2506                      .dwcfa  0x07, 2
    2507                      .dwcfa  0x07, 3
    2508                      .dwcfa  0x07, 4
    2509                      .dwcfa  0x07, 5
    2510                      .dwcfa  0x07, 6
    2511                      .dwcfa  0x07, 7
    2512                      .dwcfa  0x07, 8
    2513                      .dwcfa  0x07, 9
    2514                      .dwcfa  0x07, 10
    2515                      .dwcfa  0x07, 11
    2516                      .dwcfa  0x07, 12
    2517                      .dwcfa  0x07, 13
    2518                      .dwcfa  0x07, 14
    2519                      .dwcfa  0x07, 15
    2520                      .dwcfa  0x07, 16
    2521                      .dwcfa  0x07, 17
    2522                      .dwcfa  0x07, 18
    2523                      .dwcfa  0x07, 19
    2524                      .dwcfa  0x07, 20
    2525                      .dwcfa  0x07, 21
    2526                      .dwcfa  0x07, 22
    2527                      .dwcfa  0x07, 23
    2528                      .dwcfa  0x07, 24
    2529                      .dwcfa  0x07, 25
    2530                      .dwcfa  0x07, 26
    2531                      .dwcfa  0x07, 27
    2532                      .dwcfa  0x07, 28
    2533                      .dwcfa  0x07, 29
    2534                      .dwcfa  0x07, 30
    2535                      .dwcfa  0x07, 31
    2536                      .dwcfa  0x07, 32
    2537                      .dwcfa  0x07, 33
    2538                      .dwcfa  0x07, 34
    2539                      .dwcfa  0x07, 35
    2540                      .dwcfa  0x07, 36
    2541                      .dwcfa  0x07, 37
    2542                      .dwcfa  0x07, 38
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:20 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE   49

    2543                      .dwcfa  0x07, 39
    2544                      .dwcfa  0x07, 40
    2545              
    2546              ;***************************************************************
    2547              ;* DWARF REGISTER MAP                                          *
    2548              ;***************************************************************
    2549              
    2550              DW$118  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    2551                      .dwattr DW$118, DW_AT_location[DW_OP_reg0]
