TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:21 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7642                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Wed Oct 10 15:15:21 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("GUI16x16.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13                      .global _GUI_Font16_ASCII
      14 00000000               .sect   ".econst"
      15                      .align  2
      16 00000000       _GUI_Font16_ASCII:
      17 00000000 0010          .field          16,16                   ; _GUI_Font16_ASCII._wide @ 0

    3262 000009a3 0003          .field          3,16                    ; _GUI_CharInfo_Font16ASCII[92]._XDist @ 8848
    3263 000009a4 0001          .field          1,16                    ; _GUI_CharInfo_Font16ASCII[92]._BytesPerLine @ 8864
    3264 000009a5               .space  16
    3265 000009a6 03CA+         .field          _acFont16ASCII_124,32           ; _GUI_CharInfo_Font16ASCII[92]._pData @ 8896
         000009a7 0000 
    3266 000009a8 0004          .field          4,16                    ; _GUI_CharInfo_Font16ASCII[93]._XSize @ 8928
    3267 000009a9 0004          .field          4,16                    ; _GUI_CharInfo_Font16ASCII[93]._XDist @ 8944
    3268 000009aa 0001          .field          1,16                    ; _GUI_CharInfo_Font16ASCII[93]._BytesPerLine @ 8960
    3269 000009ab               .space  16
    3270 000009ac 037A+         .field          _acFont16ASCII_125,32           ; _GUI_CharInfo_Font16ASCII[93]._pData @ 8992
         000009ad 0000 
    3271 000009ae 0008          .field          8,16                    ; _GUI_CharInfo_Font16ASCII[94]._XSize @ 9024
    3272 000009af 0008          .field          8,16                    ; _GUI_CharInfo_Font16ASCII[94]._XDist @ 9040
    3273 000009b0 0001          .field          1,16                    ; _GUI_CharInfo_Font16ASCII[94]._BytesPerLine @ 9056
    3274 000009b1               .space  16
    3275 000009b2 036A+         .field          _acFont16ASCII_126,32           ; _GUI_CharInfo_Font16ASCII[94]._pData @ 9088
         000009b3 0000 
    3276 000009b4               .space  96
    3277              
    3278              DW$98   .dwtag  DW_TAG_variable, DW_AT_name("GUI_CharInfo_Font16ASCII"), DW_AT_symbol_name("_GUI_CharInfo_Fon
    3279                      .dwattr DW$98, DW_AT_location[DW_OP_addr _GUI_CharInfo_Font16ASCII]
    3280                      .dwattr DW$98, DW_AT_type(*DW$T$31)
    3281                      .dwattr DW$98, DW_AT_external(0x01)
    3282              ;       C:\CCStudio_v3.3\C2000\cgtools\bin\ac2000.exe -@C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7644 
    3283              
    3284              ;***************************************************************
    3285              ;* TYPE INFORMATION                                            *
    3286              ;***************************************************************
    3287              
    3288              DW$T$29 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3289                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    3290                      .dwattr DW$T$29, DW_AT_byte_size(0x10)
    3291              DW$99   .dwtag  DW_TAG_subrange_type
    3292                      .dwattr DW$99, DW_AT_upper_bound(0x0f)
    3293                      .dwendtag DW$T$29
    3294              
    3295              
    3296              DW$T$30 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    3297                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    3298                      .dwattr DW$T$30, DW_AT_byte_size(0x20)
    3299              DW$100  .dwtag  DW_TAG_subrange_type
    3300                      .dwattr DW$100, DW_AT_upper_bound(0x1f)
    3301                      .dwendtag DW$T$30
    3302              
    3303              
    3304              DW$T$31 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    3305                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    3306                      .dwattr DW$T$31, DW_AT_byte_size(0x240)
    3307              DW$101  .dwtag  DW_TAG_subrange_type
    3308                      .dwattr DW$101, DW_AT_upper_bound(0x5f)
    3309                      .dwendtag DW$T$31
    3310              
    3311              DW$102  .dwtag  DW_TAG_far_type
    3312                      .dwattr DW$102, DW_AT_type(*DW$T$32)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:21 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7642                            PAGE   63

    3313              DW$T$33 .dwtag  DW_TAG_const_type
    3314                      .dwattr DW$T$33, DW_AT_type(*DW$102)
    3315              DW$103  .dwtag  DW_TAG_far_type
    3316                      .dwattr DW$103, DW_AT_type(*DW$T$34)
    3317              DW$T$35 .dwtag  DW_TAG_const_type
    3318                      .dwattr DW$T$35, DW_AT_type(*DW$103)
    3319              DW$104  .dwtag  DW_TAG_far_type
    3320                      .dwattr DW$104, DW_AT_type(*DW$T$6)
    3321              DW$T$19 .dwtag  DW_TAG_const_type
    3322                      .dwattr DW$T$19, DW_AT_type(*DW$104)
    3323              DW$105  .dwtag  DW_TAG_far_type
    3324                      .dwattr DW$105, DW_AT_type(*DW$T$22)
    3325              DW$T$23 .dwtag  DW_TAG_const_type
    3326                      .dwattr DW$T$23, DW_AT_type(*DW$105)
    3327              DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT_PROP"), DW_AT_type(*DW$T$27)
    3328                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    3329              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT"), DW_AT_type(*DW$T$28)
    3330                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    3331              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    3332                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3333                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    3334              DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_CHARINFO"), DW_AT_type(*DW$T$21)
    3335                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    3336              
    3337              DW$T$27 .dwtag  DW_TAG_structure_type
    3338                      .dwattr DW$T$27, DW_AT_name("GUI_FONT_PROP")
    3339                      .dwattr DW$T$27, DW_AT_byte_size(0x06)
    3340              DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3341                      .dwattr DW$106, DW_AT_name("First"), DW_AT_symbol_name("_First")
    3342                      .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3343                      .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    3344              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3345                      .dwattr DW$107, DW_AT_name("Last"), DW_AT_symbol_name("_Last")
    3346                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3347                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    3348              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    3349                      .dwattr DW$108, DW_AT_name("paCharInfo"), DW_AT_symbol_name("_paCharInfo")
    3350                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3351                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    3352              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    3353                      .dwattr DW$109, DW_AT_name("pNext"), DW_AT_symbol_name("_pNext")
    3354                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3355                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    3356                      .dwendtag DW$T$27
    3357              
    3358              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    3359                      .dwattr DW$T$26, DW_AT_address_class(0x16)
    3360              
    3361              DW$T$28 .dwtag  DW_TAG_structure_type
    3362                      .dwattr DW$T$28, DW_AT_name("GUI_FONT")
    3363                      .dwattr DW$T$28, DW_AT_byte_size(0x04)
    3364              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3365                      .dwattr DW$110, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
    3366                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3367                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:21 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7642                            PAGE   64

    3368              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3369                      .dwattr DW$111, DW_AT_name("high"), DW_AT_symbol_name("_high")
    3370                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3371                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    3372              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    3373                      .dwattr DW$112, DW_AT_name("pCUR"), DW_AT_symbol_name("_pCUR")
    3374                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3375                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    3376                      .dwendtag DW$T$28
    3377              
    3378              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    3379                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3380                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    3381              
    3382              DW$T$21 .dwtag  DW_TAG_structure_type
    3383                      .dwattr DW$T$21, DW_AT_byte_size(0x06)
    3384              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3385                      .dwattr DW$113, DW_AT_name("XSize"), DW_AT_symbol_name("_XSize")
    3386                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3387                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    3388              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3389                      .dwattr DW$114, DW_AT_name("XDist"), DW_AT_symbol_name("_XDist")
    3390                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3391                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    3392              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3393                      .dwattr DW$115, DW_AT_name("BytesPerLine"), DW_AT_symbol_name("_BytesPerLine")
    3394                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3395                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    3396              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    3397                      .dwattr DW$116, DW_AT_name("pData"), DW_AT_symbol_name("_pData")
    3398                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3399                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    3400                      .dwendtag DW$T$21
    3401              
    3402              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    3403                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    3404              DW$117  .dwtag  DW_TAG_far_type
    3405                      .dwattr DW$117, DW_AT_type(*DW$T$27)
    3406              DW$T$25 .dwtag  DW_TAG_const_type
    3407                      .dwattr DW$T$25, DW_AT_type(*DW$117)
    3408              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
    3409                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    3410              
    3411              
    3412              ;***************************************************************
    3413              ;* DWARF CIE ENTRIES                                           *
    3414              ;***************************************************************
    3415              
    3416              DW$CIE  .dwcie 1, 40
    3417                      .dwcfa  0x0c, 20, 0
    3418                      .dwcfa  0x07, 0
    3419                      .dwcfa  0x07, 1
    3420                      .dwcfa  0x07, 2
    3421                      .dwcfa  0x07, 3
    3422                      .dwcfa  0x07, 4
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:21 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7642                            PAGE   65

    3423                      .dwcfa  0x07, 5
    3424                      .dwcfa  0x07, 6
    3425                      .dwcfa  0x07, 7
    3426                      .dwcfa  0x07, 8
    3427                      .dwcfa  0x07, 9
    3428                      .dwcfa  0x07, 10
    3429                      .dwcfa  0x07, 11
    3430                      .dwcfa  0x07, 12
    3431                      .dwcfa  0x07, 13
    3432                      .dwcfa  0x07, 14
    3433                      .dwcfa  0x07, 15
    3434                      .dwcfa  0x07, 16
    3435                      .dwcfa  0x07, 17
    3436                      .dwcfa  0x07, 18
    3437                      .dwcfa  0x07, 19
    3438                      .dwcfa  0x07, 20
    3439                      .dwcfa  0x07, 21
    3440                      .dwcfa  0x07, 22
    3441                      .dwcfa  0x07, 23
    3442                      .dwcfa  0x07, 24
    3443                      .dwcfa  0x07, 25
    3444                      .dwcfa  0x07, 26
    3445                      .dwcfa  0x07, 27
    3446                      .dwcfa  0x07, 28
    3447                      .dwcfa  0x07, 29
    3448                      .dwcfa  0x07, 30
    3449                      .dwcfa  0x07, 31
    3450                      .dwcfa  0x07, 32
    3451                      .dwcfa  0x07, 33
    3452                      .dwcfa  0x07, 34
    3453                      .dwcfa  0x07, 35
    3454                      .dwcfa  0x07, 36
    3455                      .dwcfa  0x07, 37
    3456                      .dwcfa  0x07, 38
    3457                      .dwcfa  0x07, 39
    3458                      .dwcfa  0x07, 40
    3459              
    3460              ;***************************************************************
    3461              ;* DWARF REGISTER MAP                                          *
    3462              ;***************************************************************
    3463              
    3464              DW$118  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    3465                      .dwattr DW$118, DW_AT_location[DW_OP_reg0]
    3466              DW$119  .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
    3467                      .dwattr DW$119, DW_AT_location[DW_OP_reg1]
    3468              DW$120  .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
