TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:22 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3442                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Wed Oct 10 15:15:22 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("GUI24x24.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13                      .global _GUI_Font24_ASCII
      14 00000000               .sect   ".econst"
      15                      .align  2
      16 00000000       _GUI_Font24_ASCII:
      17 00000000 0018          .field          24,16                   ; _GUI_Font24_ASCII._wide @ 0

    5348 000011ca 0001          .field          1,16                    ; _GUI_Font24_ASCII_CharInfo[93]._BytesPerLine @ 8960
    5349 000011cb               .space  16
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:22 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3442                            PAGE  100

    5350 000011cc 0202+         .field          _acFont24_ASCII_007D,32         ; _GUI_Font24_ASCII_CharInfo[93]._pData @ 8992
         000011cd 0000 
    5351 000011ce 000C          .field          12,16                   ; _GUI_Font24_ASCII_CharInfo[94]._XSize @ 9024
    5352 000011cf 000C          .field          12,16                   ; _GUI_Font24_ASCII_CharInfo[94]._XDist @ 9040
    5353 000011d0 0002          .field          2,16                    ; _GUI_Font24_ASCII_CharInfo[94]._BytesPerLine @ 9056
    5354 000011d1               .space  16
    5355 000011d2 054A+         .field          _acFont24_ASCII_007E,32         ; _GUI_Font24_ASCII_CharInfo[94]._pData @ 9088
         000011d3 0000 
    5356              
    5357              DW$98   .dwtag  DW_TAG_variable, DW_AT_name("GUI_Font24_ASCII_CharInfo"), DW_AT_symbol_name("_GUI_Font24_ASCI
    5358                      .dwattr DW$98, DW_AT_location[DW_OP_addr _GUI_Font24_ASCII_CharInfo]
    5359                      .dwattr DW$98, DW_AT_type(*DW$T$32)
    5360                      .dwattr DW$98, DW_AT_external(0x01)
    5361              ;       C:\CCStudio_v3.3\C2000\cgtools\bin\ac2000.exe -@C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3444 
    5362              
    5363              ;***************************************************************
    5364              ;* TYPE INFORMATION                                            *
    5365              ;***************************************************************
    5366              
    5367              DW$T$29 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    5368                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    5369                      .dwattr DW$T$29, DW_AT_byte_size(0x18)
    5370              DW$99   .dwtag  DW_TAG_subrange_type
    5371                      .dwattr DW$99, DW_AT_upper_bound(0x17)
    5372                      .dwendtag DW$T$29
    5373              
    5374              
    5375              DW$T$30 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    5376                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    5377                      .dwattr DW$T$30, DW_AT_byte_size(0x30)
    5378              DW$100  .dwtag  DW_TAG_subrange_type
    5379                      .dwattr DW$100, DW_AT_upper_bound(0x2f)
    5380                      .dwendtag DW$T$30
    5381              
    5382              
    5383              DW$T$31 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    5384                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    5385                      .dwattr DW$T$31, DW_AT_byte_size(0x48)
    5386              DW$101  .dwtag  DW_TAG_subrange_type
    5387                      .dwattr DW$101, DW_AT_upper_bound(0x47)
    5388                      .dwendtag DW$T$31
    5389              
    5390              
    5391              DW$T$32 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    5392                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    5393                      .dwattr DW$T$32, DW_AT_byte_size(0x23a)
    5394              DW$102  .dwtag  DW_TAG_subrange_type
    5395                      .dwattr DW$102, DW_AT_upper_bound(0x5e)
    5396                      .dwendtag DW$T$32
    5397              
    5398              DW$103  .dwtag  DW_TAG_far_type
    5399                      .dwattr DW$103, DW_AT_type(*DW$T$33)
    5400              DW$T$34 .dwtag  DW_TAG_const_type
    5401                      .dwattr DW$T$34, DW_AT_type(*DW$103)
    5402              DW$104  .dwtag  DW_TAG_far_type
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:22 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3442                            PAGE  101

    5403                      .dwattr DW$104, DW_AT_type(*DW$T$35)
    5404              DW$T$36 .dwtag  DW_TAG_const_type
    5405                      .dwattr DW$T$36, DW_AT_type(*DW$104)
    5406              DW$105  .dwtag  DW_TAG_far_type
    5407                      .dwattr DW$105, DW_AT_type(*DW$T$6)
    5408              DW$T$19 .dwtag  DW_TAG_const_type
    5409                      .dwattr DW$T$19, DW_AT_type(*DW$105)
    5410              DW$106  .dwtag  DW_TAG_far_type
    5411                      .dwattr DW$106, DW_AT_type(*DW$T$22)
    5412              DW$T$23 .dwtag  DW_TAG_const_type
    5413                      .dwattr DW$T$23, DW_AT_type(*DW$106)
    5414              DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT_PROP"), DW_AT_type(*DW$T$27)
    5415                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    5416              DW$T$35 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT"), DW_AT_type(*DW$T$28)
    5417                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
    5418              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    5419                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    5420                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    5421              DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_CHARINFO"), DW_AT_type(*DW$T$21)
    5422                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    5423              
    5424              DW$T$27 .dwtag  DW_TAG_structure_type
    5425                      .dwattr DW$T$27, DW_AT_name("GUI_FONT_PROP")
    5426                      .dwattr DW$T$27, DW_AT_byte_size(0x06)
    5427              DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5428                      .dwattr DW$107, DW_AT_name("First"), DW_AT_symbol_name("_First")
    5429                      .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5430                      .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    5431              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5432                      .dwattr DW$108, DW_AT_name("Last"), DW_AT_symbol_name("_Last")
    5433                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5434                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    5435              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    5436                      .dwattr DW$109, DW_AT_name("paCharInfo"), DW_AT_symbol_name("_paCharInfo")
    5437                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5438                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    5439              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    5440                      .dwattr DW$110, DW_AT_name("pNext"), DW_AT_symbol_name("_pNext")
    5441                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5442                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    5443                      .dwendtag DW$T$27
    5444              
    5445              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    5446                      .dwattr DW$T$26, DW_AT_address_class(0x16)
    5447              
    5448              DW$T$28 .dwtag  DW_TAG_structure_type
    5449                      .dwattr DW$T$28, DW_AT_name("GUI_FONT")
    5450                      .dwattr DW$T$28, DW_AT_byte_size(0x04)
    5451              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5452                      .dwattr DW$111, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
    5453                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5454                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    5455              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5456                      .dwattr DW$112, DW_AT_name("high"), DW_AT_symbol_name("_high")
    5457                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:22 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3442                            PAGE  102

    5458                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    5459              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    5460                      .dwattr DW$113, DW_AT_name("pCUR"), DW_AT_symbol_name("_pCUR")
    5461                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5462                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    5463                      .dwendtag DW$T$28
    5464              
    5465              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    5466                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    5467                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    5468              
    5469              DW$T$21 .dwtag  DW_TAG_structure_type
    5470                      .dwattr DW$T$21, DW_AT_byte_size(0x06)
    5471              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5472                      .dwattr DW$114, DW_AT_name("XSize"), DW_AT_symbol_name("_XSize")
    5473                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5474                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    5475              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5476                      .dwattr DW$115, DW_AT_name("XDist"), DW_AT_symbol_name("_XDist")
    5477                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5478                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    5479              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    5480                      .dwattr DW$116, DW_AT_name("BytesPerLine"), DW_AT_symbol_name("_BytesPerLine")
    5481                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5482                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    5483              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    5484                      .dwattr DW$117, DW_AT_name("pData"), DW_AT_symbol_name("_pData")
    5485                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5486                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    5487                      .dwendtag DW$T$21
    5488              
    5489              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    5490                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    5491              DW$118  .dwtag  DW_TAG_far_type
    5492                      .dwattr DW$118, DW_AT_type(*DW$T$27)
    5493              DW$T$25 .dwtag  DW_TAG_const_type
    5494                      .dwattr DW$T$25, DW_AT_type(*DW$118)
    5495              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
    5496                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    5497              
    5498              
    5499              ;***************************************************************
    5500              ;* DWARF CIE ENTRIES                                           *
    5501              ;***************************************************************
    5502              
    5503              DW$CIE  .dwcie 1, 40
    5504                      .dwcfa  0x0c, 20, 0
    5505                      .dwcfa  0x07, 0
    5506                      .dwcfa  0x07, 1
    5507                      .dwcfa  0x07, 2
    5508                      .dwcfa  0x07, 3
    5509                      .dwcfa  0x07, 4
    5510                      .dwcfa  0x07, 5
    5511                      .dwcfa  0x07, 6
    5512                      .dwcfa  0x07, 7
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:22 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3442                            PAGE  103

    5513                      .dwcfa  0x07, 8
    5514                      .dwcfa  0x07, 9
    5515                      .dwcfa  0x07, 10
    5516                      .dwcfa  0x07, 11
    5517                      .dwcfa  0x07, 12
    5518                      .dwcfa  0x07, 13
    5519                      .dwcfa  0x07, 14
    5520                      .dwcfa  0x07, 15
    5521                      .dwcfa  0x07, 16
    5522                      .dwcfa  0x07, 17
    5523                      .dwcfa  0x07, 18
    5524                      .dwcfa  0x07, 19
    5525                      .dwcfa  0x07, 20
    5526                      .dwcfa  0x07, 21
    5527                      .dwcfa  0x07, 22
    5528                      .dwcfa  0x07, 23
    5529                      .dwcfa  0x07, 24
    5530                      .dwcfa  0x07, 25
    5531                      .dwcfa  0x07, 26
    5532                      .dwcfa  0x07, 27
    5533                      .dwcfa  0x07, 28
    5534                      .dwcfa  0x07, 29
    5535                      .dwcfa  0x07, 30
    5536                      .dwcfa  0x07, 31
    5537                      .dwcfa  0x07, 32
    5538                      .dwcfa  0x07, 33
    5539                      .dwcfa  0x07, 34
    5540                      .dwcfa  0x07, 35
    5541                      .dwcfa  0x07, 36
    5542                      .dwcfa  0x07, 37
    5543                      .dwcfa  0x07, 38
    5544                      .dwcfa  0x07, 39
    5545                      .dwcfa  0x07, 40
    5546              
    5547              ;***************************************************************
    5548              ;* DWARF REGISTER MAP                                          *
    5549              ;***************************************************************
    5550              
    5551              DW$119  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    5552                      .dwattr DW$119, DW_AT_location[DW_OP_reg0]
    5553              DW$120  .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
    5554                      .dwattr DW$120, DW_AT_location[DW_OP_reg1]
    5555              DW$121  .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
