TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:24 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1922                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Wed Oct 10 15:15:24 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("GUI32x32.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13                      .global _GUI_Font32_ASCII
      14 00000000               .sect   ".econst"
      15                      .align  2
      16 00000000       _GUI_Font32_ASCII:
      17 00000000 0020          .field          32,16                   ; _GUI_Font32_ASCII._wide @ 0

    7800 00001b5f 0010          .field          16,16                   ; _GUI_Font32_ASCII_CharInfo[94]._XDist @ 9040
    7801 00001b60 0002          .field          2,16                    ; _GUI_Font32_ASCII_CharInfo[94]._BytesPerLine @ 9056
    7802 00001b61               .space  16
    7803 00001b62 0C0A+         .field          _acFont32_ASCII_007E,32         ; _GUI_Font32_ASCII_CharInfo[94]._pData @ 9088
         00001b63 0000 
    7804              
    7805              DW$98   .dwtag  DW_TAG_variable, DW_AT_name("GUI_Font32_ASCII_CharInfo"), DW_AT_symbol_name("_GUI_Font32_ASCI
    7806                      .dwattr DW$98, DW_AT_location[DW_OP_addr _GUI_Font32_ASCII_CharInfo]
    7807                      .dwattr DW$98, DW_AT_type(*DW$T$33)
    7808                      .dwattr DW$98, DW_AT_external(0x01)
    7809              ;       C:\CCStudio_v3.3\C2000\cgtools\bin\ac2000.exe -@C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1924 
    7810              
    7811              ;***************************************************************
    7812              ;* TYPE INFORMATION                                            *
    7813              ;***************************************************************
    7814              
    7815              DW$T$29 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    7816                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    7817                      .dwattr DW$T$29, DW_AT_byte_size(0x20)
    7818              DW$99   .dwtag  DW_TAG_subrange_type
    7819                      .dwattr DW$99, DW_AT_upper_bound(0x1f)
    7820                      .dwendtag DW$T$29
    7821              
    7822              
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:24 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1922                            PAGE  145

    7823              DW$T$30 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    7824                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    7825                      .dwattr DW$T$30, DW_AT_byte_size(0x40)
    7826              DW$100  .dwtag  DW_TAG_subrange_type
    7827                      .dwattr DW$100, DW_AT_upper_bound(0x3f)
    7828                      .dwendtag DW$T$30
    7829              
    7830              
    7831              DW$T$31 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    7832                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    7833                      .dwattr DW$T$31, DW_AT_byte_size(0x60)
    7834              DW$101  .dwtag  DW_TAG_subrange_type
    7835                      .dwattr DW$101, DW_AT_upper_bound(0x5f)
    7836                      .dwendtag DW$T$31
    7837              
    7838              
    7839              DW$T$32 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    7840                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    7841                      .dwattr DW$T$32, DW_AT_byte_size(0x80)
    7842              DW$102  .dwtag  DW_TAG_subrange_type
    7843                      .dwattr DW$102, DW_AT_upper_bound(0x7f)
    7844                      .dwendtag DW$T$32
    7845              
    7846              
    7847              DW$T$33 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    7848                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    7849                      .dwattr DW$T$33, DW_AT_byte_size(0x23a)
    7850              DW$103  .dwtag  DW_TAG_subrange_type
    7851                      .dwattr DW$103, DW_AT_upper_bound(0x5e)
    7852                      .dwendtag DW$T$33
    7853              
    7854              DW$104  .dwtag  DW_TAG_far_type
    7855                      .dwattr DW$104, DW_AT_type(*DW$T$34)
    7856              DW$T$35 .dwtag  DW_TAG_const_type
    7857                      .dwattr DW$T$35, DW_AT_type(*DW$104)
    7858              DW$105  .dwtag  DW_TAG_far_type
    7859                      .dwattr DW$105, DW_AT_type(*DW$T$36)
    7860              DW$T$37 .dwtag  DW_TAG_const_type
    7861                      .dwattr DW$T$37, DW_AT_type(*DW$105)
    7862              DW$106  .dwtag  DW_TAG_far_type
    7863                      .dwattr DW$106, DW_AT_type(*DW$T$6)
    7864              DW$T$19 .dwtag  DW_TAG_const_type
    7865                      .dwattr DW$T$19, DW_AT_type(*DW$106)
    7866              DW$107  .dwtag  DW_TAG_far_type
    7867                      .dwattr DW$107, DW_AT_type(*DW$T$22)
    7868              DW$T$23 .dwtag  DW_TAG_const_type
    7869                      .dwattr DW$T$23, DW_AT_type(*DW$107)
    7870              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT_PROP"), DW_AT_type(*DW$T$27)
    7871                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    7872              DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT"), DW_AT_type(*DW$T$28)
    7873                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
    7874              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    7875                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    7876                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    7877              DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_CHARINFO"), DW_AT_type(*DW$T$21)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:24 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1922                            PAGE  146

    7878                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    7879              
    7880              DW$T$27 .dwtag  DW_TAG_structure_type
    7881                      .dwattr DW$T$27, DW_AT_name("GUI_FONT_PROP")
    7882                      .dwattr DW$T$27, DW_AT_byte_size(0x06)
    7883              DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7884                      .dwattr DW$108, DW_AT_name("First"), DW_AT_symbol_name("_First")
    7885                      .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7886                      .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    7887              DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7888                      .dwattr DW$109, DW_AT_name("Last"), DW_AT_symbol_name("_Last")
    7889                      .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7890                      .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    7891              DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    7892                      .dwattr DW$110, DW_AT_name("paCharInfo"), DW_AT_symbol_name("_paCharInfo")
    7893                      .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7894                      .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    7895              DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    7896                      .dwattr DW$111, DW_AT_name("pNext"), DW_AT_symbol_name("_pNext")
    7897                      .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7898                      .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    7899                      .dwendtag DW$T$27
    7900              
    7901              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    7902                      .dwattr DW$T$26, DW_AT_address_class(0x16)
    7903              
    7904              DW$T$28 .dwtag  DW_TAG_structure_type
    7905                      .dwattr DW$T$28, DW_AT_name("GUI_FONT")
    7906                      .dwattr DW$T$28, DW_AT_byte_size(0x04)
    7907              DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7908                      .dwattr DW$112, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
    7909                      .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7910                      .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    7911              DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7912                      .dwattr DW$113, DW_AT_name("high"), DW_AT_symbol_name("_high")
    7913                      .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7914                      .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    7915              DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    7916                      .dwattr DW$114, DW_AT_name("pCUR"), DW_AT_symbol_name("_pCUR")
    7917                      .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7918                      .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    7919                      .dwendtag DW$T$28
    7920              
    7921              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    7922                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    7923                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    7924              
    7925              DW$T$21 .dwtag  DW_TAG_structure_type
    7926                      .dwattr DW$T$21, DW_AT_byte_size(0x06)
    7927              DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    7928                      .dwattr DW$115, DW_AT_name("XSize"), DW_AT_symbol_name("_XSize")
    7929                      .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7930                      .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    7931              DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    7932                      .dwattr DW$116, DW_AT_name("XDist"), DW_AT_symbol_name("_XDist")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:24 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1922                            PAGE  147

    7933                      .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7934                      .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    7935              DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    7936                      .dwattr DW$117, DW_AT_name("BytesPerLine"), DW_AT_symbol_name("_BytesPerLine")
    7937                      .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7938                      .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    7939              DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    7940                      .dwattr DW$118, DW_AT_name("pData"), DW_AT_symbol_name("_pData")
    7941                      .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7942                      .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    7943                      .dwendtag DW$T$21
    7944              
    7945              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    7946                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    7947              DW$119  .dwtag  DW_TAG_far_type
    7948                      .dwattr DW$119, DW_AT_type(*DW$T$27)
    7949              DW$T$25 .dwtag  DW_TAG_const_type
    7950                      .dwattr DW$T$25, DW_AT_type(*DW$119)
    7951              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
    7952                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    7953              
    7954              
    7955              ;***************************************************************
    7956              ;* DWARF CIE ENTRIES                                           *
    7957              ;***************************************************************
    7958              
    7959              DW$CIE  .dwcie 1, 40
    7960                      .dwcfa  0x0c, 20, 0
    7961                      .dwcfa  0x07, 0
    7962                      .dwcfa  0x07, 1
    7963                      .dwcfa  0x07, 2
    7964                      .dwcfa  0x07, 3
    7965                      .dwcfa  0x07, 4
    7966                      .dwcfa  0x07, 5
    7967                      .dwcfa  0x07, 6
    7968                      .dwcfa  0x07, 7
    7969                      .dwcfa  0x07, 8
    7970                      .dwcfa  0x07, 9
    7971                      .dwcfa  0x07, 10
    7972                      .dwcfa  0x07, 11
    7973                      .dwcfa  0x07, 12
    7974                      .dwcfa  0x07, 13
    7975                      .dwcfa  0x07, 14
    7976                      .dwcfa  0x07, 15
    7977                      .dwcfa  0x07, 16
    7978                      .dwcfa  0x07, 17
    7979                      .dwcfa  0x07, 18
    7980                      .dwcfa  0x07, 19
    7981                      .dwcfa  0x07, 20
    7982                      .dwcfa  0x07, 21
    7983                      .dwcfa  0x07, 22
    7984                      .dwcfa  0x07, 23
    7985                      .dwcfa  0x07, 24
    7986                      .dwcfa  0x07, 25
    7987                      .dwcfa  0x07, 26
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 15:15:24 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1922                            PAGE  148

    7988                      .dwcfa  0x07, 27
    7989                      .dwcfa  0x07, 28
    7990                      .dwcfa  0x07, 29
    7991                      .dwcfa  0x07, 30
    7992                      .dwcfa  0x07, 31
    7993                      .dwcfa  0x07, 32
    7994                      .dwcfa  0x07, 33
    7995                      .dwcfa  0x07, 34
    7996                      .dwcfa  0x07, 35
    7997                      .dwcfa  0x07, 36
    7998                      .dwcfa  0x07, 37
    7999                      .dwcfa  0x07, 38
    8000                      .dwcfa  0x07, 39
    8001                      .dwcfa  0x07, 40
    8002              
    8003              ;***************************************************************
    8004              ;* DWARF REGISTER MAP                                          *
    8005              ;***************************************************************
    8006              
    8007              DW$120  .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    8008                      .dwattr DW$120, DW_AT_location[DW_OP_reg0]
    8009              DW$121  .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
    8010                      .dwattr DW$121, DW_AT_location[DW_OP_reg1]
    8011              DW$122  .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
