TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:15 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2962                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Nov 29 16:03:15 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("GUI_liblocal.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("GUI_memcpy"), DW_AT_symbol_name("_GUI_memcpy")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              DW$2    .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)

   15214                      .dwattr DW$50, DW_AT_upper_bound(0x409)
   15215                      .dwendtag DW$T$35
   15216              
   15217              
   15218              DW$T$36 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$22)
   15219                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
   15220                      .dwattr DW$T$36, DW_AT_byte_size(0x18)
   15221              DW$51   .dwtag  DW_TAG_subrange_type
   15222                      .dwattr DW$51, DW_AT_upper_bound(0x17)
   15223                      .dwendtag DW$T$36
   15224              
   15225              
   15226              DW$T$37 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$22)
   15227                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
   15228                      .dwattr DW$T$37, DW_AT_byte_size(0x0b)
   15229              DW$52   .dwtag  DW_TAG_subrange_type
   15230                      .dwattr DW$52, DW_AT_upper_bound(0x0a)
   15231                      .dwendtag DW$T$37
   15232              
   15233              
   15234              DW$T$38 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$22)
   15235                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
   15236                      .dwattr DW$T$38, DW_AT_byte_size(0x5e0)
   15237              DW$53   .dwtag  DW_TAG_subrange_type
   15238                      .dwattr DW$53, DW_AT_upper_bound(0x5df)
   15239                      .dwendtag DW$T$38
   15240              
   15241              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:15 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2962                            PAGE  279

   15242              DW$T$39 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$22)
   15243                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
   15244                      .dwattr DW$T$39, DW_AT_byte_size(0x11a0)
   15245              DW$54   .dwtag  DW_TAG_subrange_type
   15246                      .dwattr DW$54, DW_AT_upper_bound(0x119f)
   15247                      .dwendtag DW$T$39
   15248              
   15249              
   15250              DW$T$40 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$22)
   15251                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
   15252                      .dwattr DW$T$40, DW_AT_byte_size(0x48)
   15253              DW$55   .dwtag  DW_TAG_subrange_type
   15254                      .dwattr DW$55, DW_AT_upper_bound(0x47)
   15255                      .dwendtag DW$T$40
   15256              
   15257              
   15258              DW$T$41 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$22)
   15259                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
   15260                      .dwattr DW$T$41, DW_AT_byte_size(0x183c)
   15261              DW$56   .dwtag  DW_TAG_subrange_type
   15262                      .dwattr DW$56, DW_AT_upper_bound(0x183b)
   15263                      .dwendtag DW$T$41
   15264              
   15265              
   15266              DW$T$42 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$22)
   15267                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
   15268                      .dwattr DW$T$42, DW_AT_byte_size(0x42)
   15269              DW$57   .dwtag  DW_TAG_subrange_type
   15270                      .dwattr DW$57, DW_AT_upper_bound(0x41)
   15271                      .dwendtag DW$T$42
   15272              
   15273              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
   15274                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
   15275                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
   15276              DW$58   .dwtag  DW_TAG_far_type
   15277                      .dwattr DW$58, DW_AT_type(*DW$T$49)
   15278              DW$T$50 .dwtag  DW_TAG_const_type
   15279                      .dwattr DW$T$50, DW_AT_type(*DW$58)
   15280              DW$T$51 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$50)
   15281                      .dwattr DW$T$51, DW_AT_address_class(0x16)
   15282              
   15283              DW$T$52 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$51)
   15284                      .dwattr DW$T$52, DW_AT_language(DW_LANG_C)
   15285              DW$T$54 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$49)
   15286                      .dwattr DW$T$54, DW_AT_address_class(0x16)
   15287              DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
   15288                      .dwattr DW$T$32, DW_AT_address_class(0x16)
   15289              DW$59   .dwtag  DW_TAG_far_type
   15290                      .dwattr DW$59, DW_AT_type(*DW$T$6)
   15291              DW$T$22 .dwtag  DW_TAG_const_type
   15292                      .dwattr DW$T$22, DW_AT_type(*DW$59)
   15293              DW$T$49 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT"), DW_AT_type(*DW$T$26)
   15294                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
   15295              DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_front_t"), DW_AT_type(*DW$T$28)
   15296                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:15 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2962                            PAGE  280

   15297              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
   15298                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
   15299                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
   15300              
   15301              DW$T$26 .dwtag  DW_TAG_structure_type
   15302                      .dwattr DW$T$26, DW_AT_name("GUI_FONT")
   15303                      .dwattr DW$T$26, DW_AT_byte_size(0x0c)
   15304              DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
   15305                      .dwattr DW$60, DW_AT_name("start_asc"), DW_AT_symbol_name("_start_asc")
   15306                      .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15307                      .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
   15308              DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
   15309                      .dwattr DW$61, DW_AT_name("end_asc"), DW_AT_symbol_name("_end_asc")
   15310                      .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15311                      .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
   15312              DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
   15313                      .dwattr DW$62, DW_AT_name("nbyte"), DW_AT_symbol_name("_nbyte")
   15314                      .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15315                      .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
   15316              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   15317                      .dwattr DW$63, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
   15318                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   15319                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
   15320              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   15321                      .dwattr DW$64, DW_AT_name("high"), DW_AT_symbol_name("_high")
   15322                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15323                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
   15324              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   15325                      .dwattr DW$65, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
   15326                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   15327                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
   15328              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
   15329                      .dwattr DW$66, DW_AT_name("pcode"), DW_AT_symbol_name("_pcode")
   15330                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15331                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
   15332              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
   15333                      .dwattr DW$67, DW_AT_name("pNext"), DW_AT_symbol_name("_pNext")
   15334                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   15335                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
   15336                      .dwendtag DW$T$26
   15337              
   15338              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
   15339                      .dwattr DW$T$25, DW_AT_address_class(0x16)
   15340              
   15341              DW$T$28 .dwtag  DW_TAG_structure_type
   15342                      .dwattr DW$T$28, DW_AT_byte_size(0x104)
   15343              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   15344                      .dwattr DW$68, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
   15345                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15346                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
   15347              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   15348                      .dwattr DW$69, DW_AT_name("high"), DW_AT_symbol_name("_high")
   15349                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15350                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
   15351              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:15 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2962                            PAGE  281

   15352                      .dwattr DW$70, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
   15353                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15354                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
   15355              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
   15356                      .dwattr DW$71, DW_AT_name("nbyte"), DW_AT_symbol_name("_nbyte")
   15357                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15358                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
   15359              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
   15360                      .dwattr DW$72, DW_AT_name("Dbuf"), DW_AT_symbol_name("_Dbuf")
   15361                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15362                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
   15363                      .dwendtag DW$T$28
   15364              
   15365              DW$T$23 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
   15366                      .dwattr DW$T$23, DW_AT_address_class(0x16)
   15367              DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
   15368                      .dwattr DW$T$21, DW_AT_address_class(0x16)
   15369              
   15370              DW$T$27 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
   15371                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
   15372                      .dwattr DW$T$27, DW_AT_byte_size(0x100)
   15373              DW$73   .dwtag  DW_TAG_subrange_type
   15374                      .dwattr DW$73, DW_AT_upper_bound(0xff)
   15375                      .dwendtag DW$T$27
   15376              
   15377              DW$74   .dwtag  DW_TAG_far_type
   15378                      .dwattr DW$74, DW_AT_type(*DW$T$26)
   15379              DW$T$24 .dwtag  DW_TAG_const_type
   15380                      .dwattr DW$T$24, DW_AT_type(*DW$74)
   15381              DW$T$19 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
   15382                      .dwattr DW$T$19, DW_AT_encoding(DW_ATE_signed_char)
   15383                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
   15384              DW$75   .dwtag  DW_TAG_far_type
   15385                      .dwattr DW$75, DW_AT_type(*DW$T$19)
   15386              DW$T$20 .dwtag  DW_TAG_const_type
   15387                      .dwattr DW$T$20, DW_AT_type(*DW$75)
   15388              
   15389                      .dwattr DW$24, DW_AT_external(0x01)
   15390                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
   15391              
   15392              ;***************************************************************
   15393              ;* DWARF CIE ENTRIES                                           *
   15394              ;***************************************************************
   15395              
   15396              DW$CIE  .dwcie 1, 40
   15397                      .dwcfa  0x0c, 20, 0
   15398                      .dwcfa  0x07, 0
   15399                      .dwcfa  0x07, 1
   15400                      .dwcfa  0x07, 2
   15401                      .dwcfa  0x07, 3
   15402                      .dwcfa  0x07, 4
   15403                      .dwcfa  0x07, 5
   15404                      .dwcfa  0x08, 6
   15405                      .dwcfa  0x08, 7
   15406                      .dwcfa  0x08, 8
TMS320C2000 COFF Assembler PC v4.1.3 Thu Nov 29 16:03:15 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2962                            PAGE  282

   15407                      .dwcfa  0x08, 9
   15408                      .dwcfa  0x08, 10
   15409                      .dwcfa  0x08, 11
   15410                      .dwcfa  0x07, 12
   15411                      .dwcfa  0x07, 13
   15412                      .dwcfa  0x07, 14
   15413                      .dwcfa  0x07, 15
   15414                      .dwcfa  0x07, 16
   15415                      .dwcfa  0x07, 17
   15416                      .dwcfa  0x07, 18
   15417                      .dwcfa  0x07, 19
   15418                      .dwcfa  0x07, 20
   15419                      .dwcfa  0x07, 21
   15420                      .dwcfa  0x07, 22
   15421                      .dwcfa  0x07, 23
   15422                      .dwcfa  0x07, 24
   15423                      .dwcfa  0x07, 25
   15424                      .dwcfa  0x07, 26
   15425                      .dwcfa  0x08, 27
   15426                      .dwcfa  0x07, 28
   15427                      .dwcfa  0x07, 29
   15428                      .dwcfa  0x07, 30
   15429                      .dwcfa  0x07, 31
   15430                      .dwcfa  0x07, 32
