TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:29 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6522                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Mon Dec 03 13:50:29 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("GUI_libext.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

     638                      .global _app_global_flash_read_char
     639              
     640              ;***************************************************************
     641              ;* TYPE INFORMATION                                            *
     642              ;***************************************************************
     643              DW$T$3  .dwtag  DW_TAG_pointer_type
     644                      .dwattr DW$T$3, DW_AT_address_class(0x16)
     645              
     646              DW$T$31 .dwtag  DW_TAG_subroutine_type
     647                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     648              DW$47   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
     649              DW$48   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
     650              DW$49   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
     651                      .dwendtag DW$T$31
     652              
     653              
     654              DW$T$34 .dwtag  DW_TAG_subroutine_type
     655                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     656              DW$50   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
     657              DW$51   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
     658              DW$52   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
     659                      .dwendtag DW$T$34
     660              
     661              
     662              DW$T$36 .dwtag  DW_TAG_subroutine_type
     663                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
     664              DW$53   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     665                      .dwendtag DW$T$36
     666              
     667              
     668              DW$T$39 .dwtag  DW_TAG_subroutine_type
     669                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     670              DW$54   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
     671              DW$55   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
     672                      .dwendtag DW$T$39
     673              
     674              
     675              DW$T$40 .dwtag  DW_TAG_subroutine_type
     676                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     677              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     678                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     679                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
     680              DW$T$41 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
     681                      .dwattr DW$T$41, DW_AT_address_class(0x16)
     682              DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$10)
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:29 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6522                            PAGE   14

     683                      .dwattr DW$T$33, DW_AT_address_class(0x16)
     684              
     685              DW$T$42 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     686                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     687              DW$56   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
     688              DW$57   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$41)
     689                      .dwendtag DW$T$42
     690              
     691              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     692                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     693                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     694              DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
     695                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     696              DW$T$12 .dwtag  DW_TAG_base_type, DW_AT_name("long")
     697                      .dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
     698                      .dwattr DW$T$12, DW_AT_byte_size(0x02)
     699              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
     700                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     701                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
     702              DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
     703                      .dwattr DW$T$29, DW_AT_address_class(0x16)
     704              DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
     705                      .dwattr DW$T$38, DW_AT_address_class(0x16)
     706              DW$58   .dwtag  DW_TAG_far_type
     707                      .dwattr DW$58, DW_AT_type(*DW$T$48)
     708              DW$T$49 .dwtag  DW_TAG_const_type
     709                      .dwattr DW$T$49, DW_AT_type(*DW$58)
     710              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     711                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     712                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     713              DW$T$19 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     714                      .dwattr DW$T$19, DW_AT_encoding(DW_ATE_signed_char)
     715                      .dwattr DW$T$19, DW_AT_byte_size(0x01)
     716              DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_front_t"), DW_AT_type(*DW$T$21)
     717                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
     718              DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT"), DW_AT_type(*DW$T$28)
     719                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
     720              
     721              DW$T$21 .dwtag  DW_TAG_structure_type
     722                      .dwattr DW$T$21, DW_AT_byte_size(0x104)
     723              DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     724                      .dwattr DW$59, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
     725                      .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     726                      .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     727              DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     728                      .dwattr DW$60, DW_AT_name("high"), DW_AT_symbol_name("_high")
     729                      .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     730                      .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     731              DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     732                      .dwattr DW$61, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
     733                      .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     734                      .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     735              DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     736                      .dwattr DW$62, DW_AT_name("nbyte"), DW_AT_symbol_name("_nbyte")
     737                      .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:29 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6522                            PAGE   15

     738                      .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     739              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     740                      .dwattr DW$63, DW_AT_name("Dbuf"), DW_AT_symbol_name("_Dbuf")
     741                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     742                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     743                      .dwendtag DW$T$21
     744              
     745              
     746              DW$T$28 .dwtag  DW_TAG_structure_type
     747                      .dwattr DW$T$28, DW_AT_name("GUI_FONT")
     748                      .dwattr DW$T$28, DW_AT_byte_size(0x0c)
     749              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     750                      .dwattr DW$64, DW_AT_name("start_asc"), DW_AT_symbol_name("_start_asc")
     751                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     752                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     753              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     754                      .dwattr DW$65, DW_AT_name("end_asc"), DW_AT_symbol_name("_end_asc")
     755                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     756                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     757              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
     758                      .dwattr DW$66, DW_AT_name("nbyte"), DW_AT_symbol_name("_nbyte")
     759                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     760                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     761              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     762                      .dwattr DW$67, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
     763                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     764                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     765              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     766                      .dwattr DW$68, DW_AT_name("high"), DW_AT_symbol_name("_high")
     767                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     768                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     769              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     770                      .dwattr DW$69, DW_AT_name("CHwide"), DW_AT_symbol_name("_CHwide")
     771                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     772                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     773              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     774                      .dwattr DW$70, DW_AT_name("pcode"), DW_AT_symbol_name("_pcode")
     775                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     776                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     777              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
     778                      .dwattr DW$71, DW_AT_name("pNext"), DW_AT_symbol_name("_pNext")
     779                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     780                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     781                      .dwendtag DW$T$28
     782              
     783              DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
     784                      .dwattr DW$T$27, DW_AT_address_class(0x16)
     785              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
     786                      .dwattr DW$T$25, DW_AT_address_class(0x16)
     787              
     788              DW$T$20 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
     789                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     790                      .dwattr DW$T$20, DW_AT_byte_size(0x100)
     791              DW$72   .dwtag  DW_TAG_subrange_type
     792                      .dwattr DW$72, DW_AT_upper_bound(0xff)
TMS320C2000 COFF Assembler PC v4.1.3 Mon Dec 03 13:50:29 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6522                            PAGE   16

     793                      .dwendtag DW$T$20
     794              
     795              DW$T$23 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
     796                      .dwattr DW$T$23, DW_AT_address_class(0x16)
     797              DW$73   .dwtag  DW_TAG_far_type
     798                      .dwattr DW$73, DW_AT_type(*DW$T$28)
     799              DW$T$26 .dwtag  DW_TAG_const_type
     800                      .dwattr DW$T$26, DW_AT_type(*DW$73)
     801              DW$74   .dwtag  DW_TAG_far_type
     802                      .dwattr DW$74, DW_AT_type(*DW$T$6)
     803              DW$T$24 .dwtag  DW_TAG_const_type
     804                      .dwattr DW$T$24, DW_AT_type(*DW$74)
     805              DW$75   .dwtag  DW_TAG_far_type
     806                      .dwattr DW$75, DW_AT_type(*DW$T$19)
     807              DW$T$22 .dwtag  DW_TAG_const_type
     808                      .dwattr DW$T$22, DW_AT_type(*DW$75)
     809              
     810                      .dwattr DW$41, DW_AT_external(0x01)
     811                      .dwattr DW$32, DW_AT_external(0x01)
     812                      .dwattr DW$11, DW_AT_external(0x01)
     813                      .dwattr DW$46, DW_AT_external(0x01)
     814                      .dwattr DW$20, DW_AT_external(0x01)
     815                      .dwattr DW$20, DW_AT_type(*DW$T$10)
     816                      .dwattr DW$14, DW_AT_external(0x01)
     817                      .dwattr DW$14, DW_AT_type(*DW$T$10)
     818                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     819              
     820              ;***************************************************************
     821              ;* DWARF CIE ENTRIES                                           *
     822              ;***************************************************************
     823              
     824              DW$CIE  .dwcie 1, 40
     825                      .dwcfa  0x0c, 20, 0
     826                      .dwcfa  0x07, 0
     827                      .dwcfa  0x07, 1
     828                      .dwcfa  0x07, 2
     829                      .dwcfa  0x07, 3
     830                      .dwcfa  0x07, 4
     831                      .dwcfa  0x07, 5
     832                      .dwcfa  0x08, 6
     833                      .dwcfa  0x08, 7
     834                      .dwcfa  0x08, 8
     835                      .dwcfa  0x08, 9
     836                      .dwcfa  0x08, 10
     837                      .dwcfa  0x08, 11
     838                      .dwcfa  0x07, 12
     839                      .dwcfa  0x07, 13
     840                      .dwcfa  0x07, 14
     841                      .dwcfa  0x07, 15
     842                      .dwcfa  0x07, 16
     843                      .dwcfa  0x07, 17
     844                      .dwcfa  0x07, 18
     845                      .dwcfa  0x07, 19
