TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 14:42:08 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Wed Oct 10 14:42:08 2012                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("GUIF8x8.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13                      .global _GUI_Font8_ASCII
      14 00000000               .sect   ".econst"
      15                      .align  2
      16 00000000       _GUI_Font8_ASCII:
      17 00000000 0008          .field          8,16                    ; _GUI_Font8_ASCII._wide @ 0

    1269 0000052b 0000          .field          0,16                    ; _acFont8ASCII[92][7] @ 11888
    1270 0000052c 0080          .field          128,16                  ; _acFont8ASCII[93][0] @ 11904
    1271 0000052d 0040          .field          64,16                   ; _acFont8ASCII[93][1] @ 11920
    1272 0000052e 0040          .field          64,16                   ; _acFont8ASCII[93][2] @ 11936
    1273 0000052f 0020          .field          32,16                   ; _acFont8ASCII[93][3] @ 11952
    1274 00000530 0040          .field          64,16                   ; _acFont8ASCII[93][4] @ 11968
    1275 00000531 0040          .field          64,16                   ; _acFont8ASCII[93][5] @ 11984
    1276 00000532 0080          .field          128,16                  ; _acFont8ASCII[93][6] @ 12000
    1277 00000533 0000          .field          0,16                    ; _acFont8ASCII[93][7] @ 12016
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 14:42:08 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE   26

    1278 00000534 0068          .field          104,16                  ; _acFont8ASCII[94][0] @ 12032
    1279 00000535 0090          .field          144,16                  ; _acFont8ASCII[94][1] @ 12048
    1280 00000536 0000          .field          0,16                    ; _acFont8ASCII[94][2] @ 12064
    1281 00000537 0000          .field          0,16                    ; _acFont8ASCII[94][3] @ 12080
    1282 00000538 0000          .field          0,16                    ; _acFont8ASCII[94][4] @ 12096
    1283 00000539 0000          .field          0,16                    ; _acFont8ASCII[94][5] @ 12112
    1284 0000053a 0000          .field          0,16                    ; _acFont8ASCII[94][6] @ 12128
    1285 0000053b 0000          .field          0,16                    ; _acFont8ASCII[94][7] @ 12144
    1286              
    1287              DW$4    .dwtag  DW_TAG_variable, DW_AT_name("acFont8ASCII"), DW_AT_symbol_name("_acFont8ASCII")
    1288                      .dwattr DW$4, DW_AT_location[DW_OP_addr _acFont8ASCII]
    1289                      .dwattr DW$4, DW_AT_type(*DW$T$30)
    1290                      .dwattr DW$4, DW_AT_external(0x01)
    1291              ;       C:\CCStudio_v3.3\C2000\cgtools\bin\ac2000.exe -@C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0684 
    1292              
    1293              ;***************************************************************
    1294              ;* TYPE INFORMATION                                            *
    1295              ;***************************************************************
    1296              
    1297              DW$T$30 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    1298                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    1299                      .dwattr DW$T$30, DW_AT_byte_size(0x2f8)
    1300              DW$5    .dwtag  DW_TAG_subrange_type
    1301                      .dwattr DW$5, DW_AT_upper_bound(0x5e)
    1302              DW$6    .dwtag  DW_TAG_subrange_type
    1303                      .dwattr DW$6, DW_AT_upper_bound(0x07)
    1304                      .dwendtag DW$T$30
    1305              
    1306              
    1307              DW$T$32 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
    1308                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    1309                      .dwattr DW$T$32, DW_AT_byte_size(0x23a)
    1310              DW$7    .dwtag  DW_TAG_subrange_type
    1311                      .dwattr DW$7, DW_AT_upper_bound(0x5e)
    1312                      .dwendtag DW$T$32
    1313              
    1314              DW$8    .dwtag  DW_TAG_far_type
    1315                      .dwattr DW$8, DW_AT_type(*DW$T$33)
    1316              DW$T$34 .dwtag  DW_TAG_const_type
    1317                      .dwattr DW$T$34, DW_AT_type(*DW$8)
    1318              DW$9    .dwtag  DW_TAG_far_type
    1319                      .dwattr DW$9, DW_AT_type(*DW$T$35)
    1320              DW$T$36 .dwtag  DW_TAG_const_type
    1321                      .dwattr DW$T$36, DW_AT_type(*DW$9)
    1322              DW$10   .dwtag  DW_TAG_far_type
    1323                      .dwattr DW$10, DW_AT_type(*DW$T$6)
    1324              DW$T$19 .dwtag  DW_TAG_const_type
    1325                      .dwattr DW$T$19, DW_AT_type(*DW$10)
    1326              DW$11   .dwtag  DW_TAG_far_type
    1327                      .dwattr DW$11, DW_AT_type(*DW$T$22)
    1328              DW$T$23 .dwtag  DW_TAG_const_type
    1329                      .dwattr DW$T$23, DW_AT_type(*DW$11)
    1330              DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT_PROP"), DW_AT_type(*DW$T$27)
    1331                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    1332              DW$T$35 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_FONT"), DW_AT_type(*DW$T$28)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 14:42:08 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE   27

    1333                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
    1334              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1335                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1336                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1337              DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("GUI_CHARINFO"), DW_AT_type(*DW$T$21)
    1338                      .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
    1339              
    1340              DW$T$27 .dwtag  DW_TAG_structure_type
    1341                      .dwattr DW$T$27, DW_AT_name("GUI_FONT_PROP")
    1342                      .dwattr DW$T$27, DW_AT_byte_size(0x06)
    1343              DW$12   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1344                      .dwattr DW$12, DW_AT_name("First"), DW_AT_symbol_name("_First")
    1345                      .dwattr DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346                      .dwattr DW$12, DW_AT_accessibility(DW_ACCESS_public)
    1347              DW$13   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1348                      .dwattr DW$13, DW_AT_name("Last"), DW_AT_symbol_name("_Last")
    1349                      .dwattr DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1350                      .dwattr DW$13, DW_AT_accessibility(DW_ACCESS_public)
    1351              DW$14   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1352                      .dwattr DW$14, DW_AT_name("paCharInfo"), DW_AT_symbol_name("_paCharInfo")
    1353                      .dwattr DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1354                      .dwattr DW$14, DW_AT_accessibility(DW_ACCESS_public)
    1355              DW$15   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1356                      .dwattr DW$15, DW_AT_name("pNext"), DW_AT_symbol_name("_pNext")
    1357                      .dwattr DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1358                      .dwattr DW$15, DW_AT_accessibility(DW_ACCESS_public)
    1359                      .dwendtag DW$T$27
    1360              
    1361              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    1362                      .dwattr DW$T$26, DW_AT_address_class(0x16)
    1363              
    1364              DW$T$28 .dwtag  DW_TAG_structure_type
    1365                      .dwattr DW$T$28, DW_AT_name("GUI_FONT")
    1366                      .dwattr DW$T$28, DW_AT_byte_size(0x04)
    1367              DW$16   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1368                      .dwattr DW$16, DW_AT_name("wide"), DW_AT_symbol_name("_wide")
    1369                      .dwattr DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                      .dwattr DW$16, DW_AT_accessibility(DW_ACCESS_public)
    1371              DW$17   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1372                      .dwattr DW$17, DW_AT_name("high"), DW_AT_symbol_name("_high")
    1373                      .dwattr DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1374                      .dwattr DW$17, DW_AT_accessibility(DW_ACCESS_public)
    1375              DW$18   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1376                      .dwattr DW$18, DW_AT_name("pCUR"), DW_AT_symbol_name("_pCUR")
    1377                      .dwattr DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1378                      .dwattr DW$18, DW_AT_accessibility(DW_ACCESS_public)
    1379                      .dwendtag DW$T$28
    1380              
    1381              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1382                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1383                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    1384              
    1385              DW$T$21 .dwtag  DW_TAG_structure_type
    1386                      .dwattr DW$T$21, DW_AT_byte_size(0x06)
    1387              DW$19   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 14:42:08 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE   28

    1388                      .dwattr DW$19, DW_AT_name("XSize"), DW_AT_symbol_name("_XSize")
    1389                      .dwattr DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1390                      .dwattr DW$19, DW_AT_accessibility(DW_ACCESS_public)
    1391              DW$20   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1392                      .dwattr DW$20, DW_AT_name("XDist"), DW_AT_symbol_name("_XDist")
    1393                      .dwattr DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1394                      .dwattr DW$20, DW_AT_accessibility(DW_ACCESS_public)
    1395              DW$21   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1396                      .dwattr DW$21, DW_AT_name("BytesPerLine"), DW_AT_symbol_name("_BytesPerLine")
    1397                      .dwattr DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1398                      .dwattr DW$21, DW_AT_accessibility(DW_ACCESS_public)
    1399              DW$22   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1400                      .dwattr DW$22, DW_AT_name("pData"), DW_AT_symbol_name("_pData")
    1401                      .dwattr DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1402                      .dwattr DW$22, DW_AT_accessibility(DW_ACCESS_public)
    1403                      .dwendtag DW$T$21
    1404              
    1405              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    1406                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    1407              DW$23   .dwtag  DW_TAG_far_type
    1408                      .dwattr DW$23, DW_AT_type(*DW$T$27)
    1409              DW$T$25 .dwtag  DW_TAG_const_type
    1410                      .dwattr DW$T$25, DW_AT_type(*DW$23)
    1411              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
    1412                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    1413              
    1414              
    1415              ;***************************************************************
    1416              ;* DWARF CIE ENTRIES                                           *
    1417              ;***************************************************************
    1418              
    1419              DW$CIE  .dwcie 1, 40
    1420                      .dwcfa  0x0c, 20, 0
    1421                      .dwcfa  0x07, 0
    1422                      .dwcfa  0x07, 1
    1423                      .dwcfa  0x07, 2
    1424                      .dwcfa  0x07, 3
    1425                      .dwcfa  0x07, 4
    1426                      .dwcfa  0x07, 5
    1427                      .dwcfa  0x07, 6
    1428                      .dwcfa  0x07, 7
    1429                      .dwcfa  0x07, 8
    1430                      .dwcfa  0x07, 9
    1431                      .dwcfa  0x07, 10
    1432                      .dwcfa  0x07, 11
    1433                      .dwcfa  0x07, 12
    1434                      .dwcfa  0x07, 13
    1435                      .dwcfa  0x07, 14
    1436                      .dwcfa  0x07, 15
    1437                      .dwcfa  0x07, 16
    1438                      .dwcfa  0x07, 17
    1439                      .dwcfa  0x07, 18
    1440                      .dwcfa  0x07, 19
    1441                      .dwcfa  0x07, 20
    1442                      .dwcfa  0x07, 21
TMS320C2000 COFF Assembler PC v4.1.3 Wed Oct 10 14:42:08 2012

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI0682                            PAGE   29

    1443                      .dwcfa  0x07, 22
    1444                      .dwcfa  0x07, 23
    1445                      .dwcfa  0x07, 24
    1446                      .dwcfa  0x07, 25
    1447                      .dwcfa  0x07, 26
    1448                      .dwcfa  0x07, 27
    1449                      .dwcfa  0x07, 28
    1450                      .dwcfa  0x07, 29
    1451                      .dwcfa  0x07, 30
    1452                      .dwcfa  0x07, 31
    1453                      .dwcfa  0x07, 32
    1454                      .dwcfa  0x07, 33
    1455                      .dwcfa  0x07, 34
    1456                      .dwcfa  0x07, 35
    1457                      .dwcfa  0x07, 36
    1458                      .dwcfa  0x07, 37
    1459                      .dwcfa  0x07, 38
    1460                      .dwcfa  0x07, 39
    1461                      .dwcfa  0x07, 40
    1462              
    1463              ;***************************************************************
    1464              ;* DWARF REGISTER MAP                                          *
    1465              ;***************************************************************
    1466              
    1467              DW$24   .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
    1468                      .dwattr DW$24, DW_AT_location[DW_OP_reg0]
    1469              DW$25   .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
    1470                      .dwattr DW$25, DW_AT_location[DW_OP_reg1]
    1471              DW$26   .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
