TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Wed Jan 12 08:34:31 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_ERRmod_fun.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    2649                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2650                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
    2651              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   56

    2652                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    2653              
    2654              DW$T$104        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
    2655                      .dwattr DW$T$104, DW_AT_language(DW_LANG_C)
    2656              DW$242  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$16)
    2657              DW$243  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$63)
    2658              DW$244  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    2659                      .dwendtag DW$T$104
    2660              
    2661              
    2662              DW$T$106        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
    2663                      .dwattr DW$T$106, DW_AT_language(DW_LANG_C)
    2664              DW$245  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$69)
    2665                      .dwendtag DW$T$106
    2666              
    2667              DW$T$51 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
    2668                      .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
    2669              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
    2670                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
    2671                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
    2672              
    2673              DW$T$108        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$16)
    2674                      .dwattr DW$T$108, DW_AT_language(DW_LANG_C)
    2675              DW$246  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$63)
    2676                      .dwendtag DW$T$108
    2677              
    2678              DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    2679                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
    2680                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    2681              
    2682              DW$T$113        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$30)
    2683                      .dwattr DW$T$113, DW_AT_language(DW_LANG_C)
    2684                      .dwattr DW$T$113, DW_AT_byte_size(0x10)
    2685              DW$247  .dwtag  DW_TAG_subrange_type
    2686                      .dwattr DW$247, DW_AT_upper_bound(0x01)
    2687              DW$248  .dwtag  DW_TAG_subrange_type
    2688                      .dwattr DW$248, DW_AT_upper_bound(0x03)
    2689                      .dwendtag DW$T$113
    2690              
    2691              DW$T$63 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    2692                      .dwattr DW$T$63, DW_AT_address_class(0x16)
    2693              
    2694              DW$T$110        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$25)
    2695                      .dwattr DW$T$110, DW_AT_language(DW_LANG_C)
    2696              DW$249  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    2697                      .dwendtag DW$T$110
    2698              
    2699              DW$T$69 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$68)
    2700                      .dwattr DW$T$69, DW_AT_address_class(0x16)
    2701              DW$T$116        .dwtag  DW_TAG_typedef, DW_AT_name("measure_param_t"), DW_AT_type(*DW$T$36)
    2702                      .dwattr DW$T$116, DW_AT_language(DW_LANG_C)
    2703              DW$T$118        .dwtag  DW_TAG_typedef, DW_AT_name("DL_correct_t"), DW_AT_type(*DW$T$37)
    2704                      .dwattr DW$T$118, DW_AT_language(DW_LANG_C)
    2705              DW$T$121        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$120)
    2706                      .dwattr DW$T$121, DW_AT_address_class(0x16)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   57

    2707              DW$T$123        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$122)
    2708                      .dwattr DW$T$123, DW_AT_address_class(0x16)
    2709              DW$T$124        .dwtag  DW_TAG_typedef, DW_AT_name("DL_correct_step_t"), DW_AT_type(*DW$T$41)
    2710                      .dwattr DW$T$124, DW_AT_language(DW_LANG_C)
    2711              DW$T$126        .dwtag  DW_TAG_typedef, DW_AT_name("UIDang_t"), DW_AT_type(*DW$T$45)
    2712                      .dwattr DW$T$126, DW_AT_language(DW_LANG_C)
    2713              DW$T$128        .dwtag  DW_TAG_typedef, DW_AT_name("DL_reflag_u"), DW_AT_type(*DW$T$48)
    2714                      .dwattr DW$T$128, DW_AT_language(DW_LANG_C)
    2715              DW$250  .dwtag  DW_TAG_far_type
    2716                      .dwattr DW$250, DW_AT_type(*DW$T$98)
    2717              DW$T$99 .dwtag  DW_TAG_const_type
    2718                      .dwattr DW$T$99, DW_AT_type(*DW$250)
    2719              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    2720                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    2721              DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$32)
    2722                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    2723              
    2724              DW$T$36 .dwtag  DW_TAG_structure_type
    2725                      .dwattr DW$T$36, DW_AT_name("_measure_param_t")
    2726                      .dwattr DW$T$36, DW_AT_byte_size(0x40)
    2727              DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    2728                      .dwattr DW$251, DW_AT_name("phase_a"), DW_AT_symbol_name("_phase_a")
    2729                      .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2730                      .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2731              DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    2732                      .dwattr DW$252, DW_AT_name("phase_b"), DW_AT_symbol_name("_phase_b")
    2733                      .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2734                      .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2735              DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    2736                      .dwattr DW$253, DW_AT_name("phase_c"), DW_AT_symbol_name("_phase_c")
    2737                      .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2738                      .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2739              DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2740                      .dwattr DW$254, DW_AT_name("f_Uab"), DW_AT_symbol_name("_f_Uab")
    2741                      .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2742                      .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2743              DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2744                      .dwattr DW$255, DW_AT_name("f_Ubc"), DW_AT_symbol_name("_f_Ubc")
    2745                      .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2746                      .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2747              DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2748                      .dwattr DW$256, DW_AT_name("f_Uac"), DW_AT_symbol_name("_f_Uac")
    2749                      .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2750                      .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2751              DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2752                      .dwattr DW$257, DW_AT_name("f_Iac"), DW_AT_symbol_name("_f_Iac")
    2753                      .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2754                      .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2755              DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2756                      .dwattr DW$258, DW_AT_name("f_Ibc"), DW_AT_symbol_name("_f_Ibc")
    2757                      .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2758                      .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2759              DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2760                      .dwattr DW$259, DW_AT_name("f_Iab"), DW_AT_symbol_name("_f_Iab")
    2761                      .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   58

    2762                      .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2763              DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2764                      .dwattr DW$260, DW_AT_name("f_JUac"), DW_AT_symbol_name("_f_JUac")
    2765                      .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2766                      .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2767              DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2768                      .dwattr DW$261, DW_AT_name("f_JUbc"), DW_AT_symbol_name("_f_JUbc")
    2769                      .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2770                      .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2771              DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2772                      .dwattr DW$262, DW_AT_name("f_JUab"), DW_AT_symbol_name("_f_JUab")
    2773                      .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2774                      .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2775              DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2776                      .dwattr DW$263, DW_AT_name("f_Cos"), DW_AT_symbol_name("_f_Cos")
    2777                      .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2778                      .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2779              DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2780                      .dwattr DW$264, DW_AT_name("f_Pabc"), DW_AT_symbol_name("_f_Pabc")
    2781                      .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2782                      .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2783              DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2784                      .dwattr DW$265, DW_AT_name("f_Qabc"), DW_AT_symbol_name("_f_Qabc")
    2785                      .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2786                      .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2787              DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    2788                      .dwattr DW$266, DW_AT_name("f_err"), DW_AT_symbol_name("_f_err")
    2789                      .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2790                      .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2791              DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2792                      .dwattr DW$267, DW_AT_name("f_Feq"), DW_AT_symbol_name("_f_Feq")
    2793                      .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2794                      .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2795                      .dwendtag DW$T$36
    2796              
    2797              
    2798              DW$T$37 .dwtag  DW_TAG_structure_type
    2799                      .dwattr DW$T$37, DW_AT_byte_size(0x20)
    2800              DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2801                      .dwattr DW$268, DW_AT_name("err_Ua"), DW_AT_symbol_name("_err_Ua")
    2802                      .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2803                      .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2804              DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2805                      .dwattr DW$269, DW_AT_name("err_Ub"), DW_AT_symbol_name("_err_Ub")
    2806                      .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2807                      .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2808              DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2809                      .dwattr DW$270, DW_AT_name("err_Uc"), DW_AT_symbol_name("_err_Uc")
    2810                      .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2811                      .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2812              DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2813                      .dwattr DW$271, DW_AT_name("offset"), DW_AT_symbol_name("_offset")
    2814                      .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2815                      .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2816              DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   59

    2817                      .dwattr DW$272, DW_AT_name("err_Ia"), DW_AT_symbol_name("_err_Ia")
    2818                      .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2819                      .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2820              DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2821                      .dwattr DW$273, DW_AT_name("err_Ib"), DW_AT_symbol_name("_err_Ib")
    2822                      .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2823                      .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2824              DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2825                      .dwattr DW$274, DW_AT_name("err_Ic"), DW_AT_symbol_name("_err_Ic")
    2826                      .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2827                      .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2828              DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2829                      .dwattr DW$275, DW_AT_name("err_Pa"), DW_AT_symbol_name("_err_Pa")
    2830                      .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2831                      .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2832              DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2833                      .dwattr DW$276, DW_AT_name("err_Pb"), DW_AT_symbol_name("_err_Pb")
    2834                      .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2835                      .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2836              DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2837                      .dwattr DW$277, DW_AT_name("err_Pc"), DW_AT_symbol_name("_err_Pc")
    2838                      .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2839                      .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2840              DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2841                      .dwattr DW$278, DW_AT_name("err_Qa"), DW_AT_symbol_name("_err_Qa")
    2842                      .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2843                      .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2844              DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2845                      .dwattr DW$279, DW_AT_name("err_Qb"), DW_AT_symbol_name("_err_Qb")
    2846                      .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2847                      .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2848              DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2849                      .dwattr DW$280, DW_AT_name("err_Qc"), DW_AT_symbol_name("_err_Qc")
    2850                      .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2851                      .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2852              DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2853                      .dwattr DW$281, DW_AT_name("err_Ja"), DW_AT_symbol_name("_err_Ja")
    2854                      .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2855                      .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2856              DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2857                      .dwattr DW$282, DW_AT_name("err_Jb"), DW_AT_symbol_name("_err_Jb")
    2858                      .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2859                      .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2860              DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2861                      .dwattr DW$283, DW_AT_name("err_Jc"), DW_AT_symbol_name("_err_Jc")
    2862                      .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2863                      .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2864                      .dwendtag DW$T$37
    2865              
    2866              DW$T$120        .dwtag  DW_TAG_typedef, DW_AT_name("correct_Udata_save_t"), DW_AT_type(*DW$T$39)
    2867                      .dwattr DW$T$120, DW_AT_language(DW_LANG_C)
    2868              DW$T$122        .dwtag  DW_TAG_typedef, DW_AT_name("correct_Idata_save_t"), DW_AT_type(*DW$T$40)
    2869                      .dwattr DW$T$122, DW_AT_language(DW_LANG_C)
    2870              
    2871              DW$T$41 .dwtag  DW_TAG_structure_type
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   60

    2872                      .dwattr DW$T$41, DW_AT_byte_size(0x08)
    2873              DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2874                      .dwattr DW$284, DW_AT_name("main_step"), DW_AT_symbol_name("_main_step")
    2875                      .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2876                      .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2877              DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2878                      .dwattr DW$285, DW_AT_name("sub_step"), DW_AT_symbol_name("_sub_step")
    2879                      .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2880                      .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2881              DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2882                      .dwattr DW$286, DW_AT_name("Ext_arg"), DW_AT_symbol_name("_Ext_arg")
    2883                      .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2884                      .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2885              DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2886                      .dwattr DW$287, DW_AT_name("base_U"), DW_AT_symbol_name("_base_U")
    2887                      .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2888                      .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2889              DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    2890                      .dwattr DW$288, DW_AT_name("base_I"), DW_AT_symbol_name("_base_I")
    2891                      .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2892                      .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2893                      .dwendtag DW$T$41
    2894              
    2895              
    2896              DW$T$45 .dwtag  DW_TAG_structure_type
    2897                      .dwattr DW$T$45, DW_AT_name("UIDang")
    2898                      .dwattr DW$T$45, DW_AT_byte_size(0x03)
    2899              DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
    2900                      .dwattr DW$289, DW_AT_name("UIDangN"), DW_AT_symbol_name("_UIDangN")
    2901                      .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2902                      .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2903              DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2904                      .dwattr DW$290, DW_AT_name("all"), DW_AT_symbol_name("_all")
    2905                      .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2906                      .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2907                      .dwendtag DW$T$45
    2908              
    2909              
    2910              DW$T$48 .dwtag  DW_TAG_union_type
    2911                      .dwattr DW$T$48, DW_AT_byte_size(0x01)
    2912              DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2913                      .dwattr DW$291, DW_AT_name("reflag"), DW_AT_symbol_name("_reflag")
    2914                      .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2915                      .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2916              DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2917                      .dwattr DW$292, DW_AT_name("reflag_bits"), DW_AT_symbol_name("_reflag_bits")
    2918                      .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2919                      .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2920                      .dwendtag DW$T$48
    2921              
    2922              DW$T$98 .dwtag  DW_TAG_typedef, DW_AT_name("correct_handle_t"), DW_AT_type(*DW$T$97)
    2923                      .dwattr DW$T$98, DW_AT_language(DW_LANG_C)
    2924              
    2925              DW$T$35 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$16)
    2926                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   61

    2927                      .dwattr DW$T$35, DW_AT_byte_size(0x08)
    2928              DW$293  .dwtag  DW_TAG_subrange_type
    2929                      .dwattr DW$293, DW_AT_upper_bound(0x03)
    2930                      .dwendtag DW$T$35
    2931              
    2932              DW$294  .dwtag  DW_TAG_far_type
    2933                      .dwattr DW$294, DW_AT_type(*DW$T$25)
    2934              DW$T$29 .dwtag  DW_TAG_const_type
    2935                      .dwattr DW$T$29, DW_AT_type(*DW$294)
    2936              
    2937              DW$T$32 .dwtag  DW_TAG_structure_type
    2938                      .dwattr DW$T$32, DW_AT_name("hwin")
    2939                      .dwattr DW$T$32, DW_AT_byte_size(0x42)
    2940              DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2941                      .dwattr DW$295, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    2942                      .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2943                      .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2944              DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2945                      .dwattr DW$296, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    2946                      .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2947                      .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2948              DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2949                      .dwattr DW$297, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    2950                      .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2951                      .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2952              DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2953                      .dwattr DW$298, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    2954                      .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2955                      .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2956              DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2957                      .dwattr DW$299, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    2958                      .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2959                      .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2960              DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2961                      .dwattr DW$300, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    2962                      .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2963                      .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2964              DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2965                      .dwattr DW$301, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    2966                      .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2967                      .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2968              DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2969                      .dwattr DW$302, DW_AT_name("type"), DW_AT_symbol_name("_type")
    2970                      .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2971                      .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2972              DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2973                      .dwattr DW$303, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    2974                      .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2975                      .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2976              DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2977                      .dwattr DW$304, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    2978                      .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2979                      .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2980              DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2981                      .dwattr DW$305, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   62

    2982                      .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2983                      .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2984              DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2985                      .dwattr DW$306, DW_AT_name("nline"), DW_AT_symbol_name("_nline")
    2986                      .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2987                      .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2988              DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2989                      .dwattr DW$307, DW_AT_name("nrow"), DW_AT_symbol_name("_nrow")
    2990                      .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2991                      .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2992              DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2993                      .dwattr DW$308, DW_AT_name("grid_wide"), DW_AT_symbol_name("_grid_wide")
    2994                      .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2995                      .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2996              DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2997                      .dwattr DW$309, DW_AT_name("grid_high"), DW_AT_symbol_name("_grid_high")
    2998                      .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2999                      .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3000              DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    3001                      .dwattr DW$310, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    3002                      .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3003                      .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3004              DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    3005                      .dwattr DW$311, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    3006                      .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3007                      .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3008              DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    3009                      .dwattr DW$312, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    3010                      .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3011                      .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3012              DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    3013                      .dwattr DW$313, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
    3014                      .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3015                      .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3016              DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3017                      .dwattr DW$314, DW_AT_name("button_flags"), DW_AT_symbol_name("_button_flags")
    3018                      .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3019                      .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3020              DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3021                      .dwattr DW$315, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
    3022                      .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    3023                      .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3024              DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3025                      .dwattr DW$316, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
    3026                      .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3027                      .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3028              DW$317  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    3029                      .dwattr DW$317, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
    3030                      .dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3031                      .dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3032              DW$318  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    3033                      .dwattr DW$318, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    3034                      .dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3035                      .dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3036              DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   63

    3037                      .dwattr DW$319, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
    3038                      .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3039                      .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3040              DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    3041                      .dwattr DW$320, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    3042                      .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    3043                      .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3044              DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3045                      .dwattr DW$321, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
    3046                      .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3047                      .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3048                      .dwendtag DW$T$32
    3049              
    3050              DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    3051                      .dwattr DW$T$22, DW_AT_address_class(0x16)
    3052              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("phase_param_t"), DW_AT_type(*DW$T$33)
    3053                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    3054              
    3055              DW$T$39 .dwtag  DW_TAG_structure_type
    3056                      .dwattr DW$T$39, DW_AT_byte_size(0x38)
    3057              DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3058                      .dwattr DW$322, DW_AT_name("c_baseU"), DW_AT_symbol_name("_c_baseU")
    3059                      .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3060                      .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3061              DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3062                      .dwattr DW$323, DW_AT_name("c_Ua"), DW_AT_symbol_name("_c_Ua")
    3063                      .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3064                      .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3065              DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3066                      .dwattr DW$324, DW_AT_name("c_Ub"), DW_AT_symbol_name("_c_Ub")
    3067                      .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3068                      .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3069              DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3070                      .dwattr DW$325, DW_AT_name("c_Uc"), DW_AT_symbol_name("_c_Uc")
    3071                      .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3072                      .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3073              DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3074                      .dwattr DW$326, DW_AT_name("c_EUa"), DW_AT_symbol_name("_c_EUa")
    3075                      .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3076                      .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3077              DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3078                      .dwattr DW$327, DW_AT_name("c_EUb"), DW_AT_symbol_name("_c_EUb")
    3079                      .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3080                      .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3081              DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3082                      .dwattr DW$328, DW_AT_name("c_EUc"), DW_AT_symbol_name("_c_EUc")
    3083                      .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3084                      .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3085                      .dwendtag DW$T$39
    3086              
    3087              
    3088              DW$T$40 .dwtag  DW_TAG_structure_type
    3089                      .dwattr DW$T$40, DW_AT_byte_size(0x39)
    3090              DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    3091                      .dwattr DW$329, DW_AT_name("offset"), DW_AT_symbol_name("_offset")
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   64

    3092                      .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3093                      .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3094              DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3095                      .dwattr DW$330, DW_AT_name("c_baseI"), DW_AT_symbol_name("_c_baseI")
    3096                      .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3097                      .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3098              DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3099                      .dwattr DW$331, DW_AT_name("c_Ia"), DW_AT_symbol_name("_c_Ia")
    3100                      .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3101                      .dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3102              DW$332  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3103                      .dwattr DW$332, DW_AT_name("c_Ib"), DW_AT_symbol_name("_c_Ib")
    3104                      .dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3105                      .dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3106              DW$333  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3107                      .dwattr DW$333, DW_AT_name("c_Ic"), DW_AT_symbol_name("_c_Ic")
    3108                      .dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    3109                      .dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3110              DW$334  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3111                      .dwattr DW$334, DW_AT_name("c_EIa"), DW_AT_symbol_name("_c_EIa")
    3112                      .dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3113                      .dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3114              DW$335  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3115                      .dwattr DW$335, DW_AT_name("c_EIb"), DW_AT_symbol_name("_c_EIb")
    3116                      .dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    3117                      .dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3118              DW$336  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    3119                      .dwattr DW$336, DW_AT_name("c_EIc"), DW_AT_symbol_name("_c_EIc")
    3120                      .dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    3121                      .dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3122                      .dwendtag DW$T$40
    3123              
    3124              
    3125              DW$T$44 .dwtag  DW_TAG_union_type
    3126                      .dwattr DW$T$44, DW_AT_name("UIDangUnion")
    3127                      .dwattr DW$T$44, DW_AT_byte_size(0x02)
    3128              DW$337  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3129                      .dwattr DW$337, DW_AT_name("all"), DW_AT_symbol_name("_all")
    3130                      .dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3131                      .dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3132              DW$338  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3133                      .dwattr DW$338, DW_AT_name("bit2"), DW_AT_symbol_name("_bit2")
    3134                      .dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3135                      .dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3136              DW$339  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
    3137                      .dwattr DW$339, DW_AT_name("bit1"), DW_AT_symbol_name("_bit1")
    3138                      .dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3139                      .dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3140                      .dwendtag DW$T$44
    3141              
    3142              DW$T$47 .dwtag  DW_TAG_typedef, DW_AT_name("reflag_bits_t"), DW_AT_type(*DW$T$46)
    3143                      .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
    3144              DW$T$97 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$96)
    3145                      .dwattr DW$T$97, DW_AT_address_class(0x16)
    3146              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   65

    3147                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    3148              
    3149              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    3150                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    3151                      .dwattr DW$T$26, DW_AT_byte_size(0x1e)
    3152              DW$340  .dwtag  DW_TAG_subrange_type
    3153                      .dwattr DW$340, DW_AT_upper_bound(0x1d)
    3154                      .dwendtag DW$T$26
    3155              
    3156              DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
    3157                      .dwattr DW$T$31, DW_AT_address_class(0x16)
    3158              
    3159              DW$T$38 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    3160                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    3161                      .dwattr DW$T$38, DW_AT_byte_size(0x08)
    3162              DW$341  .dwtag  DW_TAG_subrange_type
    3163                      .dwattr DW$341, DW_AT_upper_bound(0x07)
    3164                      .dwendtag DW$T$38
    3165              
    3166              
    3167              DW$T$33 .dwtag  DW_TAG_structure_type
    3168                      .dwattr DW$T$33, DW_AT_name("_phase_param_t")
    3169                      .dwattr DW$T$33, DW_AT_byte_size(0x0a)
    3170              DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3171                      .dwattr DW$342, DW_AT_name("f_U"), DW_AT_symbol_name("_f_U")
    3172                      .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3173                      .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3174              DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3175                      .dwattr DW$343, DW_AT_name("f_I"), DW_AT_symbol_name("_f_I")
    3176                      .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3177                      .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3178              DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3179                      .dwattr DW$344, DW_AT_name("f_J"), DW_AT_symbol_name("_f_J")
    3180                      .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3181                      .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3182              DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3183                      .dwattr DW$345, DW_AT_name("f_P"), DW_AT_symbol_name("_f_P")
    3184                      .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3185                      .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3186              DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3187                      .dwattr DW$346, DW_AT_name("f_Q"), DW_AT_symbol_name("_f_Q")
    3188                      .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3189                      .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3190                      .dwendtag DW$T$33
    3191              
    3192              
    3193              DW$T$42 .dwtag  DW_TAG_structure_type
    3194                      .dwattr DW$T$42, DW_AT_name("UIDangBit2")
    3195                      .dwattr DW$T$42, DW_AT_byte_size(0x02)
    3196              DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3197                      .dwattr DW$347, DW_AT_name("rsvd1"), DW_AT_symbol_name("_rsvd1")
    3198                      .dwattr DW$347, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
    3199                      .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3200                      .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3201              DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   66

    3202                      .dwattr DW$348, DW_AT_name("UIa"), DW_AT_symbol_name("_UIa")
    3203                      .dwattr DW$348, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x02)
    3204                      .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3205                      .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3206              DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3207                      .dwattr DW$349, DW_AT_name("UIb"), DW_AT_symbol_name("_UIb")
    3208                      .dwattr DW$349, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x02)
    3209                      .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3210                      .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3211              DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3212                      .dwattr DW$350, DW_AT_name("UIc"), DW_AT_symbol_name("_UIc")
    3213                      .dwattr DW$350, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x02)
    3214                      .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3215                      .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3216              DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3217                      .dwattr DW$351, DW_AT_name("rsvd2"), DW_AT_symbol_name("_rsvd2")
    3218                      .dwattr DW$351, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    3219                      .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3220                      .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3221                      .dwendtag DW$T$42
    3222              
    3223              
    3224              DW$T$43 .dwtag  DW_TAG_structure_type
    3225                      .dwattr DW$T$43, DW_AT_name("UIDangBit1")
    3226                      .dwattr DW$T$43, DW_AT_byte_size(0x01)
    3227              DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3228                      .dwattr DW$352, DW_AT_name("UDangFlag"), DW_AT_symbol_name("_UDangFlag")
    3229                      .dwattr DW$352, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    3230                      .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3231                      .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3232              DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3233                      .dwattr DW$353, DW_AT_name("IDangFlag"), DW_AT_symbol_name("_IDangFlag")
    3234                      .dwattr DW$353, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x04)
    3235                      .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3236                      .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3237              DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3238                      .dwattr DW$354, DW_AT_name("Ia"), DW_AT_symbol_name("_Ia")
    3239                      .dwattr DW$354, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3240                      .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3241                      .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3242              DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3243                      .dwattr DW$355, DW_AT_name("Ua"), DW_AT_symbol_name("_Ua")
    3244                      .dwattr DW$355, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3245                      .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3246                      .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3247              DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3248                      .dwattr DW$356, DW_AT_name("Ib"), DW_AT_symbol_name("_Ib")
    3249                      .dwattr DW$356, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3250                      .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3251                      .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3252              DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3253                      .dwattr DW$357, DW_AT_name("Ub"), DW_AT_symbol_name("_Ub")
    3254                      .dwattr DW$357, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3255                      .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3256                      .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   67

    3257              DW$358  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3258                      .dwattr DW$358, DW_AT_name("Ic"), DW_AT_symbol_name("_Ic")
    3259                      .dwattr DW$358, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3260                      .dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3261                      .dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3262              DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3263                      .dwattr DW$359, DW_AT_name("Uc"), DW_AT_symbol_name("_Uc")
    3264                      .dwattr DW$359, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3265                      .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3266                      .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3267              DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3268                      .dwattr DW$360, DW_AT_name("Flag3or4Phase"), DW_AT_symbol_name("_Flag3or4Phase")
    3269                      .dwattr DW$360, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3270                      .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3271                      .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3272              DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3273                      .dwattr DW$361, DW_AT_name("SiglePhaseDL"), DW_AT_symbol_name("_SiglePhaseDL")
    3274                      .dwattr DW$361, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    3275                      .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3276                      .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3277                      .dwendtag DW$T$43
    3278              
    3279              
    3280              DW$T$46 .dwtag  DW_TAG_structure_type
    3281                      .dwattr DW$T$46, DW_AT_byte_size(0x01)
    3282              DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3283                      .dwattr DW$362, DW_AT_name("Mdata_reflag"), DW_AT_symbol_name("_Mdata_reflag")
    3284                      .dwattr DW$362, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3285                      .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3286                      .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3287              DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3288                      .dwattr DW$363, DW_AT_name("Edata_Ureflag"), DW_AT_symbol_name("_Edata_Ureflag")
    3289                      .dwattr DW$363, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3290                      .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3291                      .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3292              DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3293                      .dwattr DW$364, DW_AT_name("Edata_Ireflag"), DW_AT_symbol_name("_Edata_Ireflag")
    3294                      .dwattr DW$364, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3295                      .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3296                      .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3297              DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3298                      .dwattr DW$365, DW_AT_name("Edata_Preflag"), DW_AT_symbol_name("_Edata_Preflag")
    3299                      .dwattr DW$365, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3300                      .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3301                      .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3302              DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3303                      .dwattr DW$366, DW_AT_name("Edata_Qreflag"), DW_AT_symbol_name("_Edata_Qreflag")
    3304                      .dwattr DW$366, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3305                      .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3306                      .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3307              DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3308                      .dwattr DW$367, DW_AT_name("Edata_Jreflag"), DW_AT_symbol_name("_Edata_Jreflag")
    3309                      .dwattr DW$367, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3310                      .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3311                      .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   68

    3312              DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3313                      .dwattr DW$368, DW_AT_name("reserve"), DW_AT_symbol_name("_reserve")
    3314                      .dwattr DW$368, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    3315                      .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3316                      .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3317                      .dwendtag DW$T$46
    3318              
    3319              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$21)
    3320                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    3321              
    3322              DW$T$21 .dwtag  DW_TAG_structure_type
    3323                      .dwattr DW$T$21, DW_AT_name("edit_mem")
    3324                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    3325              DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3326                      .dwattr DW$369, DW_AT_name("x"), DW_AT_symbol_name("_x")
    3327                      .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3328                      .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3329              DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3330                      .dwattr DW$370, DW_AT_name("y"), DW_AT_symbol_name("_y")
    3331                      .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3332                      .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3333              DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3334                      .dwattr DW$371, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    3335                      .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3336                      .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3337              DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3338                      .dwattr DW$372, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    3339                      .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3340                      .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3341              DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3342                      .dwattr DW$373, DW_AT_name("id"), DW_AT_symbol_name("_id")
    3343                      .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3344                      .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3345              DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    3346                      .dwattr DW$374, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    3347                      .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3348                      .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3349                      .dwendtag DW$T$21
    3350              
    3351              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
    3352                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    3353              
    3354                      .dwattr DW$174, DW_AT_external(0x01)
    3355                      .dwattr DW$138, DW_AT_external(0x01)
    3356                      .dwattr DW$138, DW_AT_type(*DW$T$6)
    3357                      .dwattr DW$170, DW_AT_external(0x01)
    3358                      .dwattr DW$170, DW_AT_type(*DW$T$6)
    3359                      .dwattr DW$166, DW_AT_external(0x01)
    3360                      .dwattr DW$166, DW_AT_type(*DW$T$6)
    3361                      .dwattr DW$112, DW_AT_external(0x01)
    3362                      .dwattr DW$112, DW_AT_type(*DW$T$6)
    3363                      .dwattr DW$90, DW_AT_external(0x01)
    3364                      .dwattr DW$102, DW_AT_external(0x01)
    3365                      .dwattr DW$102, DW_AT_type(*DW$T$91)
    3366                      .dwattr DW$96, DW_AT_external(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:34:31 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI1043                            PAGE   69

    3367                      .dwattr DW$205, DW_AT_external(0x01)
    3368                      .dwattr DW$206, DW_AT_external(0x01)
    3369                      .dwattr DW$187, DW_AT_external(0x01)
    3370                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    3371              
    3372              ;***************************************************************
    3373              ;* DWARF CIE ENTRIES                                           *
    3374              ;***************************************************************
    3375              
    3376              DW$CIE  .dwcie 1, 40
    3377                      .dwcfa  0x0c, 20, 0
    3378                      .dwcfa  0x07, 0
    3379                      .dwcfa  0x07, 1
    3380                      .dwcfa  0x07, 2
    3381                      .dwcfa  0x07, 3
    3382                      .dwcfa  0x07, 4
    3383                      .dwcfa  0x07, 5
    3384                      .dwcfa  0x08, 6
    3385                      .dwcfa  0x08, 7
    3386                      .dwcfa  0x08, 8
    3387                      .dwcfa  0x08, 9
    3388                      .dwcfa  0x08, 10
    3389                      .dwcfa  0x08, 11
    3390                      .dwcfa  0x07, 12
    3391                      .dwcfa  0x07, 13
    3392                      .dwcfa  0x07, 14
    3393                      .dwcfa  0x07, 15
    3394                      .dwcfa  0x07, 16
    3395                      .dwcfa  0x07, 17
    3396                      .dwcfa  0x07, 18
    3397                      .dwcfa  0x07, 19
    3398                      .dwcfa  0x07, 20
    3399                      .dwcfa  0x07, 21
    3400                      .dwcfa  0x07, 22
    3401                      .dwcfa  0x07, 23
    3402                      .dwcfa  0x07, 24
    3403                      .dwcfa  0x07, 25
    3404                      .dwcfa  0x07, 26
    3405                      .dwcfa  0x08, 27
    3406                      .dwcfa  0x07, 28
    3407                      .dwcfa  0x07, 29
    3408                      .dwcfa  0x07, 30
    3409                      .dwcfa  0x07, 31
    3410                      .dwcfa  0x07, 32
    3411                      .dwcfa  0x07, 33
    3412                      .dwcfa  0x07, 34
    3413                      .dwcfa  0x07, 35
    3414                      .dwcfa  0x07, 36
    3415                      .dwcfa  0x07, 37
    3416                      .dwcfa  0x07, 38
    3417                      .dwcfa  0x07, 39
