TMS320C2000 COFF Assembler PC v4.1.3 Thu Dec 02 08:34:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7922                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Thu Dec 02 08:34:11 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_PCmod_connect.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("app_PCmod_fun_exit"), DW_AT_symbol_name("_app_PCmod_fun_exit")
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)
      17              

     255                      .dwattr DW$17, DW_AT_end_file("app_PCmod_connect.c")
     256                      .dwattr DW$17, DW_AT_end_line(0x48)
     257                      .dwattr DW$17, DW_AT_end_column(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Thu Dec 02 08:34:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7922                            PAGE    6

     258                      .dwendentry
     259                      .dwendtag DW$17
     260              
     261              ;***************************************************************
     262              ;* FAR STRINGS                                                 *
     263              ;***************************************************************
     264 00000000               .sect   ".econst"
     265                      .align  2
     266 00000000 0050  FSL1:   .string "PCmod....",10,0
         00000001 0043 
         00000002 006D 
         00000003 006F 
         00000004 0064 
         00000005 002E 
         00000006 002E 
         00000007 002E 
         00000008 002E 
         00000009 000A 
         0000000a 0000 
     267                      .align  2
     268 0000000c 0050  FSL2:   .string "PCmod=>",0
         0000000d 0043 
         0000000e 006D 
         0000000f 006F 
         00000010 0064 
         00000011 003D 
         00000012 003E 
         00000013 0000 
     269              ;***************************************************************
     270              ;* UNDEFINED EXTERNAL REFERENCES                               *
     271              ;***************************************************************
     272                      .global _app_PCmod_fun_exit
     273                      .global _app_PCmod_fun_entry
     274                      .global _app_global_resouce_req
     275                      .global _log_printf
     276                      .global _app_global_resouce_release
     277                      .global _m_null_pram
     278                      .global _app_module_add
     279                      .global _m_log_pram
     280              
     281              ;***************************************************************
     282              ;* TYPE INFORMATION                                            *
     283              ;***************************************************************
     284              DW$T$3  .dwtag  DW_TAG_pointer_type
     285                      .dwattr DW$T$3, DW_AT_address_class(0x16)
     286              
     287              DW$T$21 .dwtag  DW_TAG_subroutine_type
     288                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
     289              
     290              DW$T$33 .dwtag  DW_TAG_subroutine_type
     291                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
     292              DW$20   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
     293              DW$21   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
     294                      .dwendtag DW$T$33
     295              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Dec 02 08:34:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7922                            PAGE    7

     296              
     297              DW$T$35 .dwtag  DW_TAG_subroutine_type
     298                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
     299              DW$22   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     300                      .dwendtag DW$T$35
     301              
     302              DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t"), DW_AT_type(*DW$T$6)
     303                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     304              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$19)
     305                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     306              
     307              DW$T$40 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$20)
     308                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     309              DW$23   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$39)
     310                      .dwendtag DW$T$40
     311              
     312              
     313              DW$T$42 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$20)
     314                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     315              DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("app_mod_inlet_t"), DW_AT_type(*DW$T$25)
     316                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     317              DW$T$39 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
     318                      .dwattr DW$T$39, DW_AT_address_class(0x16)
     319              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
     320                      .dwattr DW$T$30, DW_AT_address_class(0x16)
     321              DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("log_param"), DW_AT_type(*DW$T$29)
     322                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     323              DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
     324                      .dwattr DW$T$32, DW_AT_address_class(0x16)
     325              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     326                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     327                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
     328              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t"), DW_AT_type(*DW$T$11)
     329                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     330              
     331              DW$T$25 .dwtag  DW_TAG_structure_type
     332                      .dwattr DW$T$25, DW_AT_byte_size(0x06)
     333              DW$24   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     334                      .dwattr DW$24, DW_AT_name("mod_id"), DW_AT_symbol_name("_mod_id")
     335                      .dwattr DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     336                      .dwattr DW$24, DW_AT_accessibility(DW_ACCESS_public)
     337              DW$25   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     338                      .dwattr DW$25, DW_AT_name("insmod_fun"), DW_AT_symbol_name("_insmod_fun")
     339                      .dwattr DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     340                      .dwattr DW$25, DW_AT_accessibility(DW_ACCESS_public)
     341              DW$26   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     342                      .dwattr DW$26, DW_AT_name("exitmod_fun"), DW_AT_symbol_name("_exitmod_fun")
     343                      .dwattr DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     344                      .dwattr DW$26, DW_AT_accessibility(DW_ACCESS_public)
     345                      .dwendtag DW$T$25
     346              
     347              DW$T$26 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     348                      .dwattr DW$T$26, DW_AT_encoding(DW_ATE_signed_char)
     349                      .dwattr DW$T$26, DW_AT_byte_size(0x01)
     350              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Dec 02 08:34:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7922                            PAGE    8

     351              DW$T$29 .dwtag  DW_TAG_structure_type
     352                      .dwattr DW$T$29, DW_AT_byte_size(0x28)
     353              DW$27   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
     354                      .dwattr DW$27, DW_AT_name("pram_buf"), DW_AT_symbol_name("_pram_buf")
     355                      .dwattr DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     356                      .dwattr DW$27, DW_AT_accessibility(DW_ACCESS_public)
     357              DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     358                      .dwattr DW$28, DW_AT_name("cur_off"), DW_AT_symbol_name("_cur_off")
     359                      .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     360                      .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     361              DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     362                      .dwattr DW$29, DW_AT_name("parm_0"), DW_AT_symbol_name("_parm_0")
     363                      .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     364                      .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     365              DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     366                      .dwattr DW$30, DW_AT_name("parm_1"), DW_AT_symbol_name("_parm_1")
     367                      .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     368                      .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     369              DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     370                      .dwattr DW$31, DW_AT_name("parm_2"), DW_AT_symbol_name("_parm_2")
     371                      .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     372                      .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     373              DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     374                      .dwattr DW$32, DW_AT_name("parm_3"), DW_AT_symbol_name("_parm_3")
     375                      .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     376                      .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     377              DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     378                      .dwattr DW$33, DW_AT_name("parm_4"), DW_AT_symbol_name("_parm_4")
     379                      .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     380                      .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     381              DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     382                      .dwattr DW$34, DW_AT_name("parm_5"), DW_AT_symbol_name("_parm_5")
     383                      .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     384                      .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     385              DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     386                      .dwattr DW$35, DW_AT_name("end_pram"), DW_AT_symbol_name("_end_pram")
     387                      .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     388                      .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     389                      .dwendtag DW$T$29
     390              
     391              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("app_insmod_t"), DW_AT_type(*DW$T$22)
     392                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     393              DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("app_exitmod_t"), DW_AT_type(*DW$T$22)
     394                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
     395              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     396                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     397                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     398              
     399              DW$T$27 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$26)
     400                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     401                      .dwattr DW$T$27, DW_AT_byte_size(0x18)
     402              DW$36   .dwtag  DW_TAG_subrange_type
     403                      .dwattr DW$36, DW_AT_upper_bound(0x17)
     404                      .dwendtag DW$T$27
     405              
TMS320C2000 COFF Assembler PC v4.1.3 Thu Dec 02 08:34:11 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7922                            PAGE    9

     406              DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
     407                      .dwattr DW$T$22, DW_AT_address_class(0x16)
     408              
     409                      .dwattr DW$17, DW_AT_external(0x01)
     410                      .dwattr DW$17, DW_AT_type(*DW$T$20)
     411                      .dwattr DW$16, DW_AT_external(0x01)
     412                      .dwattr DW$15, DW_AT_external(0x01)
     413                      .dwattr DW$14, DW_AT_external(0x01)
     414                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     415              
     416              ;***************************************************************
     417              ;* DWARF CIE ENTRIES                                           *
     418              ;***************************************************************
     419              
     420              DW$CIE  .dwcie 1, 40
     421                      .dwcfa  0x0c, 20, 0
     422                      .dwcfa  0x07, 0
     423                      .dwcfa  0x07, 1
     424                      .dwcfa  0x07, 2
     425                      .dwcfa  0x07, 3
     426                      .dwcfa  0x07, 4
     427                      .dwcfa  0x07, 5
     428                      .dwcfa  0x08, 6
     429                      .dwcfa  0x08, 7
     430                      .dwcfa  0x08, 8
     431                      .dwcfa  0x08, 9
     432                      .dwcfa  0x08, 10
     433                      .dwcfa  0x08, 11
     434                      .dwcfa  0x07, 12
     435                      .dwcfa  0x07, 13
     436                      .dwcfa  0x07, 14
     437                      .dwcfa  0x07, 15
     438                      .dwcfa  0x07, 16
     439                      .dwcfa  0x07, 17
     440                      .dwcfa  0x07, 18
     441                      .dwcfa  0x07, 19
     442                      .dwcfa  0x07, 20
     443                      .dwcfa  0x07, 21
     444                      .dwcfa  0x07, 22
     445                      .dwcfa  0x07, 23
     446                      .dwcfa  0x07, 24
     447                      .dwcfa  0x07, 25
     448                      .dwcfa  0x07, 26
     449                      .dwcfa  0x08, 27
     450                      .dwcfa  0x07, 28
     451                      .dwcfa  0x07, 29
     452                      .dwcfa  0x07, 30
     453                      .dwcfa  0x07, 31
     454                      .dwcfa  0x07, 32
