TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:12:08 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3242                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Wed Jan 12 08:12:07 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_ERRmod_interface.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    2143                      .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
    2144                      .dwattr DW$T$25, DW_AT_byte_size(0x01)
    2145              DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
    2146                      .dwattr DW$T$31, DW_AT_address_class(0x16)
    2147              
    2148              DW$T$70 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$30)
    2149                      .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    2150                      .dwattr DW$T$70, DW_AT_byte_size(0x04)
    2151              DW$162  .dwtag  DW_TAG_subrange_type
    2152                      .dwattr DW$162, DW_AT_upper_bound(0x01)
    2153                      .dwendtag DW$T$70
    2154              
    2155              
    2156              DW$T$71 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$30)
    2157                      .dwattr DW$T$71, DW_AT_language(DW_LANG_C)
    2158                      .dwattr DW$T$71, DW_AT_byte_size(0x14)
    2159              DW$163  .dwtag  DW_TAG_subrange_type
    2160                      .dwattr DW$163, DW_AT_upper_bound(0x04)
    2161              DW$164  .dwtag  DW_TAG_subrange_type
    2162                      .dwattr DW$164, DW_AT_upper_bound(0x01)
    2163                      .dwendtag DW$T$71
    2164              
    2165              
    2166              DW$T$74 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$30)
    2167                      .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    2168                      .dwattr DW$T$74, DW_AT_byte_size(0x10)
    2169              DW$165  .dwtag  DW_TAG_subrange_type
    2170                      .dwattr DW$165, DW_AT_upper_bound(0x01)
    2171              DW$166  .dwtag  DW_TAG_subrange_type
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:12:08 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3242                            PAGE   51

    2172                      .dwattr DW$166, DW_AT_upper_bound(0x03)
    2173                      .dwendtag DW$T$74
    2174              
    2175              DW$T$43 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    2176                      .dwattr DW$T$43, DW_AT_address_class(0x16)
    2177              DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
    2178                      .dwattr DW$T$38, DW_AT_address_class(0x16)
    2179              
    2180              DW$T$96 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$38)
    2181                      .dwattr DW$T$96, DW_AT_language(DW_LANG_C)
    2182              
    2183              DW$T$98 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$38)
    2184                      .dwattr DW$T$98, DW_AT_language(DW_LANG_C)
    2185              DW$167  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2186              DW$168  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2187              DW$169  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    2188              DW$170  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    2189              DW$171  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    2190              DW$172  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
    2191                      .dwendtag DW$T$98
    2192              
    2193              
    2194              DW$T$100        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$38)
    2195                      .dwattr DW$T$100, DW_AT_language(DW_LANG_C)
    2196              DW$173  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2197              DW$174  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2198              DW$175  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    2199              DW$176  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    2200              DW$177  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$43)
    2201              DW$178  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    2202              DW$179  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
    2203                      .dwendtag DW$T$100
    2204              
    2205              
    2206              DW$T$102        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$38)
    2207                      .dwattr DW$T$102, DW_AT_language(DW_LANG_C)
    2208              DW$180  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2209              DW$181  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    2210              DW$182  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
    2211              DW$183  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    2212              DW$184  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
    2213                      .dwendtag DW$T$102
    2214              
    2215              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    2216                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    2217              DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$32)
    2218                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    2219              DW$185  .dwtag  DW_TAG_far_type
    2220                      .dwattr DW$185, DW_AT_type(*DW$T$25)
    2221              DW$T$29 .dwtag  DW_TAG_const_type
    2222                      .dwattr DW$T$29, DW_AT_type(*DW$185)
    2223              
    2224              DW$T$32 .dwtag  DW_TAG_structure_type
    2225                      .dwattr DW$T$32, DW_AT_name("hwin")
    2226                      .dwattr DW$T$32, DW_AT_byte_size(0x42)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:12:08 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3242                            PAGE   52

    2227              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2228                      .dwattr DW$186, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    2229                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2230                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2231              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2232                      .dwattr DW$187, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
    2233                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2234                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2235              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2236                      .dwattr DW$188, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
    2237                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2238                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2239              DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2240                      .dwattr DW$189, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
    2241                      .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2242                      .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2243              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2244                      .dwattr DW$190, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
    2245                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2246                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2247              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2248                      .dwattr DW$191, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
    2249                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2250                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2251              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2252                      .dwattr DW$192, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
    2253                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2254                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2255              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2256                      .dwattr DW$193, DW_AT_name("type"), DW_AT_symbol_name("_type")
    2257                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2258                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2259              DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2260                      .dwattr DW$194, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
    2261                      .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2262                      .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2263              DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2264                      .dwattr DW$195, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
    2265                      .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2266                      .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2267              DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2268                      .dwattr DW$196, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
    2269                      .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2270                      .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2271              DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2272                      .dwattr DW$197, DW_AT_name("nline"), DW_AT_symbol_name("_nline")
    2273                      .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2274                      .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2275              DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2276                      .dwattr DW$198, DW_AT_name("nrow"), DW_AT_symbol_name("_nrow")
    2277                      .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2278                      .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2279              DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2280                      .dwattr DW$199, DW_AT_name("grid_wide"), DW_AT_symbol_name("_grid_wide")
    2281                      .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:12:08 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3242                            PAGE   53

    2282                      .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2283              DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2284                      .dwattr DW$200, DW_AT_name("grid_high"), DW_AT_symbol_name("_grid_high")
    2285                      .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2286                      .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2287              DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    2288                      .dwattr DW$201, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
    2289                      .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2290                      .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2291              DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    2292                      .dwattr DW$202, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
    2293                      .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2294                      .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2295              DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    2296                      .dwattr DW$203, DW_AT_name("m_cur_pedit"), DW_AT_symbol_name("_m_cur_pedit")
    2297                      .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2298                      .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2299              DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    2300                      .dwattr DW$204, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
    2301                      .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2302                      .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2303              DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2304                      .dwattr DW$205, DW_AT_name("button_flags"), DW_AT_symbol_name("_button_flags")
    2305                      .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2306                      .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2307              DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2308                      .dwattr DW$206, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
    2309                      .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
    2310                      .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2311              DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2312                      .dwattr DW$207, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
    2313                      .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2314                      .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2315              DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    2316                      .dwattr DW$208, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
    2317                      .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2318                      .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2319              DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    2320                      .dwattr DW$209, DW_AT_name("drop_memeber"), DW_AT_symbol_name("_drop_memeber")
    2321                      .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2322                      .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2323              DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2324                      .dwattr DW$210, DW_AT_name("drop_cur_member"), DW_AT_symbol_name("_drop_cur_member")
    2325                      .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2326                      .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2327              DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    2328                      .dwattr DW$211, DW_AT_name("drop_member_size"), DW_AT_symbol_name("_drop_member_size")
    2329                      .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f]
    2330                      .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2331              DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2332                      .dwattr DW$212, DW_AT_name("win_cnt"), DW_AT_symbol_name("_win_cnt")
    2333                      .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2334                      .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2335                      .dwendtag DW$T$32
    2336              
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:12:08 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3242                            PAGE   54

    2337              DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    2338                      .dwattr DW$T$22, DW_AT_address_class(0x16)
    2339              DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
    2340                      .dwattr DW$T$28, DW_AT_address_class(0x16)
    2341              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    2342                      .dwattr DW$T$24, DW_AT_address_class(0x16)
    2343              
    2344              DW$T$26 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
    2345                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    2346                      .dwattr DW$T$26, DW_AT_byte_size(0x1e)
    2347              DW$213  .dwtag  DW_TAG_subrange_type
    2348                      .dwattr DW$213, DW_AT_upper_bound(0x1d)
    2349                      .dwendtag DW$T$26
    2350              
    2351              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$21)
    2352                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    2353              
    2354              DW$T$21 .dwtag  DW_TAG_structure_type
    2355                      .dwattr DW$T$21, DW_AT_name("edit_mem")
    2356                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    2357              DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2358                      .dwattr DW$214, DW_AT_name("x"), DW_AT_symbol_name("_x")
    2359                      .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2360                      .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2361              DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2362                      .dwattr DW$215, DW_AT_name("y"), DW_AT_symbol_name("_y")
    2363                      .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2364                      .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2365              DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2366                      .dwattr DW$216, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
    2367                      .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2368                      .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2369              DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2370                      .dwattr DW$217, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
    2371                      .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2372                      .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2373              DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2374                      .dwattr DW$218, DW_AT_name("id"), DW_AT_symbol_name("_id")
    2375                      .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2376                      .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2377              DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    2378                      .dwattr DW$219, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
    2379                      .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2380                      .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2381                      .dwendtag DW$T$21
    2382              
    2383              DW$T$20 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
    2384                      .dwattr DW$T$20, DW_AT_address_class(0x16)
    2385              
    2386                      .dwattr DW$103, DW_AT_external(0x01)
    2387                      .dwattr DW$107, DW_AT_external(0x01)
    2388                      .dwattr DW$108, DW_AT_external(0x01)
    2389                      .dwattr DW$115, DW_AT_external(0x01)
    2390                      .dwattr DW$98, DW_AT_external(0x01)
    2391                      .dwattr DW$102, DW_AT_external(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:12:08 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3242                            PAGE   55

    2392                      .dwattr DW$116, DW_AT_external(0x01)
    2393                      .dwattr DW$119, DW_AT_external(0x01)
    2394                      .dwattr DW$90, DW_AT_external(0x01)
    2395                      .dwattr DW$122, DW_AT_external(0x01)
    2396                      .dwattr DW$128, DW_AT_external(0x01)
    2397                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    2398              
    2399              ;***************************************************************
    2400              ;* DWARF CIE ENTRIES                                           *
    2401              ;***************************************************************
    2402              
    2403              DW$CIE  .dwcie 1, 40
    2404                      .dwcfa  0x0c, 20, 0
    2405                      .dwcfa  0x07, 0
    2406                      .dwcfa  0x07, 1
    2407                      .dwcfa  0x07, 2
    2408                      .dwcfa  0x07, 3
    2409                      .dwcfa  0x07, 4
    2410                      .dwcfa  0x07, 5
    2411                      .dwcfa  0x08, 6
    2412                      .dwcfa  0x08, 7
    2413                      .dwcfa  0x08, 8
    2414                      .dwcfa  0x08, 9
    2415                      .dwcfa  0x08, 10
    2416                      .dwcfa  0x08, 11
    2417                      .dwcfa  0x07, 12
    2418                      .dwcfa  0x07, 13
    2419                      .dwcfa  0x07, 14
    2420                      .dwcfa  0x07, 15
    2421                      .dwcfa  0x07, 16
    2422                      .dwcfa  0x07, 17
    2423                      .dwcfa  0x07, 18
    2424                      .dwcfa  0x07, 19
    2425                      .dwcfa  0x07, 20
    2426                      .dwcfa  0x07, 21
    2427                      .dwcfa  0x07, 22
    2428                      .dwcfa  0x07, 23
    2429                      .dwcfa  0x07, 24
    2430                      .dwcfa  0x07, 25
    2431                      .dwcfa  0x07, 26
    2432                      .dwcfa  0x08, 27
    2433                      .dwcfa  0x07, 28
    2434                      .dwcfa  0x07, 29
    2435                      .dwcfa  0x07, 30
    2436                      .dwcfa  0x07, 31
    2437                      .dwcfa  0x07, 32
    2438                      .dwcfa  0x07, 33
    2439                      .dwcfa  0x07, 34
    2440                      .dwcfa  0x07, 35
    2441                      .dwcfa  0x07, 36
    2442                      .dwcfa  0x07, 37
    2443                      .dwcfa  0x07, 38
    2444                      .dwcfa  0x07, 39
    2445                      .dwcfa  0x07, 40
    2446              
TMS320C2000 COFF Assembler PC v4.1.3 Wed Jan 12 08:12:08 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3242                            PAGE   56

