TMS320C2000 COFF Assembler PC v4.1.3 Tue Nov 30 14:11:45 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8762                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Tue Nov 30 14:11:45 2010                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("app_PCmod_interface.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              
      14              DW$1    .dwtag  DW_TAG_subprogram, DW_AT_name("GUI_window_hwin_release"), DW_AT_symbol_name("_GUI_window_hwin
      15                      .dwattr DW$1, DW_AT_declaration(0x01)
      16                      .dwattr DW$1, DW_AT_external(0x01)

     161              ;*                                                             *
     162              ;* FUNCTION ENVIRONMENT                                        *
     163              ;*                                                             *
     164              ;* FUNCTION PROPERTIES                                         *
     165              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     166              ;***************************************************************
     167              
     168              _app_PCmod_window_destroy:
     169                      .dwcfa  0x1d, -2
     170                      .dwcfa  0x1c, 26, 0
     171                      .dwcfa  0x09, 40, 26
     172                      .dwpsn  "app_PCmod_interface.c",34,2
     173 00000021 761F-         MOVW      DP,#_m_pc_win
         00000022 0000 
     174 00000023 8A00-         MOVL      XAR4,@_m_pc_win       ; |34| 
     175 00000024 7640!         LCR       #_GUI_window_destory  ; |34| 
         00000025 0000 
     176                      ; call occurs [#_GUI_window_destory] ; |34| 
     177                      .dwpsn  "app_PCmod_interface.c",35,2
     178                      .dwpsn  "app_PCmod_interface.c",36,1
     179 00000026 0006          LRETR
     180                      ; return occurs
     181                      .dwattr DW$20, DW_AT_end_file("app_PCmod_interface.c")
     182                      .dwattr DW$20, DW_AT_end_line(0x24)
     183                      .dwattr DW$20, DW_AT_end_column(0x01)
     184                      .dwendentry
     185                      .dwendtag DW$20
     186              
     187              ;***************************************************************
     188              ;* UNDEFINED EXTERNAL REFERENCES                               *
     189              ;***************************************************************
     190                      .global _GUI_window_hwin_release
     191                      .global _GUI_window_hwin_req
     192                      .global _GUI_set_Fgcolor
     193                      .global _GUI_window_destory
     194                      .global _GUI_set_Bgcolor
     195                      .global _GUI_clean_screen
     196                      .global _GUI_window_creat
     197              
     198              ;***************************************************************
     199              ;* TYPE INFORMATION                                            *
     200              ;***************************************************************
     201              
     202              DW$T$31 .dwtag  DW_TAG_subroutine_type
     203                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     204              DW$21   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     205                      .dwendtag DW$T$31
     206              
     207              
     208              DW$T$35 .dwtag  DW_TAG_subroutine_type
TMS320C2000 COFF Assembler PC v4.1.3 Tue Nov 30 14:11:45 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8762                            PAGE    5

     209                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
     210              DW$22   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
     211                      .dwendtag DW$T$35
     212              
     213              
     214              DW$T$37 .dwtag  DW_TAG_subroutine_type
     215                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
     216              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     217                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     218                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     219              
     220              DW$T$38 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     221                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     222              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t"), DW_AT_type(*DW$T$11)
     223                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     224              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$19)
     225                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     226              DW$T$34 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
     227                      .dwattr DW$T$34, DW_AT_address_class(0x16)
     228              
     229              DW$T$40 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$34)
     230                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     231              DW$23   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     232              DW$24   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     233              DW$25   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
     234              DW$26   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
     235              DW$27   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$20)
     236                      .dwendtag DW$T$40
     237              
     238              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     239                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     240                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     241              DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("hwin_t"), DW_AT_type(*DW$T$30)
     242                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
     243              
     244              DW$T$30 .dwtag  DW_TAG_structure_type
     245                      .dwattr DW$T$30, DW_AT_name("hwin")
     246                      .dwattr DW$T$30, DW_AT_byte_size(0x3a)
     247              DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     248                      .dwattr DW$28, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
     249                      .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     250                      .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     251              DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     252                      .dwattr DW$29, DW_AT_name("win_x"), DW_AT_symbol_name("_win_x")
     253                      .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     254                      .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     255              DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     256                      .dwattr DW$30, DW_AT_name("win_y"), DW_AT_symbol_name("_win_y")
     257                      .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     258                      .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     259              DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     260                      .dwattr DW$31, DW_AT_name("win_wide"), DW_AT_symbol_name("_win_wide")
     261                      .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     262                      .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     263              DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Nov 30 14:11:45 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8762                            PAGE    6

     264                      .dwattr DW$32, DW_AT_name("win_high"), DW_AT_symbol_name("_win_high")
     265                      .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     266                      .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     267              DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     268                      .dwattr DW$33, DW_AT_name("csr_x_pos"), DW_AT_symbol_name("_csr_x_pos")
     269                      .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     270                      .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     271              DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     272                      .dwattr DW$34, DW_AT_name("csr_y_pos"), DW_AT_symbol_name("_csr_y_pos")
     273                      .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     274                      .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     275              DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     276                      .dwattr DW$35, DW_AT_name("type"), DW_AT_symbol_name("_type")
     277                      .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     278                      .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     279              DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     280                      .dwattr DW$36, DW_AT_name("father_hwin"), DW_AT_symbol_name("_father_hwin")
     281                      .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     282                      .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     283              DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     284                      .dwattr DW$37, DW_AT_name("next_hwin"), DW_AT_symbol_name("_next_hwin")
     285                      .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     286                      .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     287              DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     288                      .dwattr DW$38, DW_AT_name("last_hwin"), DW_AT_symbol_name("_last_hwin")
     289                      .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     290                      .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     291              DW$39   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     292                      .dwattr DW$39, DW_AT_name("nline"), DW_AT_symbol_name("_nline")
     293                      .dwattr DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     294                      .dwattr DW$39, DW_AT_accessibility(DW_ACCESS_public)
     295              DW$40   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     296                      .dwattr DW$40, DW_AT_name("nrow"), DW_AT_symbol_name("_nrow")
     297                      .dwattr DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     298                      .dwattr DW$40, DW_AT_accessibility(DW_ACCESS_public)
     299              DW$41   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     300                      .dwattr DW$41, DW_AT_name("grid_wide"), DW_AT_symbol_name("_grid_wide")
     301                      .dwattr DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     302                      .dwattr DW$41, DW_AT_accessibility(DW_ACCESS_public)
     303              DW$42   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     304                      .dwattr DW$42, DW_AT_name("grid_high"), DW_AT_symbol_name("_grid_high")
     305                      .dwattr DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
     306                      .dwattr DW$42, DW_AT_accessibility(DW_ACCESS_public)
     307              DW$43   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     308                      .dwattr DW$43, DW_AT_name("cur_edit_pos"), DW_AT_symbol_name("_cur_edit_pos")
     309                      .dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     310                      .dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
     311              DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     312                      .dwattr DW$44, DW_AT_name("edit_phead"), DW_AT_symbol_name("_edit_phead")
     313                      .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     314                      .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
     315              DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
     316                      .dwattr DW$45, DW_AT_name("button_title"), DW_AT_symbol_name("_button_title")
     317                      .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     318                      .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Tue Nov 30 14:11:45 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8762                            PAGE    7

     319              DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     320                      .dwattr DW$46, DW_AT_name("button_flags"), DW_AT_symbol_name("_button_flags")
     321                      .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     322                      .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
     323              DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     324                      .dwattr DW$47, DW_AT_name("button_bg_color"), DW_AT_symbol_name("_button_bg_color")
     325                      .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
     326                      .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     327              DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     328                      .dwattr DW$48, DW_AT_name("button_txt_color"), DW_AT_symbol_name("_button_txt_color")
     329                      .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     330                      .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     331              DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     332                      .dwattr DW$49, DW_AT_name("buttoncallback"), DW_AT_symbol_name("_buttoncallback")
     333                      .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     334                      .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     335                      .dwendtag DW$T$30
     336              
     337              DW$T$23 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
     338                      .dwattr DW$T$23, DW_AT_address_class(0x16)
     339              DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
     340                      .dwattr DW$T$29, DW_AT_address_class(0x16)
     341              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
     342                      .dwattr DW$T$25, DW_AT_address_class(0x16)
     343              
     344              DW$T$27 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$26)
     345                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     346                      .dwattr DW$T$27, DW_AT_byte_size(0x1e)
     347              DW$50   .dwtag  DW_TAG_subrange_type
     348                      .dwattr DW$50, DW_AT_upper_bound(0x1d)
     349                      .dwendtag DW$T$27
     350              
     351              
     352              DW$T$28 .dwtag  DW_TAG_subroutine_type
     353                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     354              DW$51   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     355                      .dwendtag DW$T$28
     356              
     357              DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("edit_mem_t"), DW_AT_type(*DW$T$22)
     358                      .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
     359              DW$T$26 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     360                      .dwattr DW$T$26, DW_AT_encoding(DW_ATE_signed_char)
     361                      .dwattr DW$T$26, DW_AT_byte_size(0x01)
     362              DW$T$3  .dwtag  DW_TAG_pointer_type
     363                      .dwattr DW$T$3, DW_AT_address_class(0x16)
     364              
     365              DW$T$22 .dwtag  DW_TAG_structure_type
     366                      .dwattr DW$T$22, DW_AT_name("edit_mem")
     367                      .dwattr DW$T$22, DW_AT_byte_size(0x08)
     368              DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     369                      .dwattr DW$52, DW_AT_name("x"), DW_AT_symbol_name("_x")
     370                      .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     371                      .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     372              DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     373                      .dwattr DW$53, DW_AT_name("y"), DW_AT_symbol_name("_y")
TMS320C2000 COFF Assembler PC v4.1.3 Tue Nov 30 14:11:45 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8762                            PAGE    8

     374                      .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     375                      .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
     376              DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     377                      .dwattr DW$54, DW_AT_name("eidt_lenth"), DW_AT_symbol_name("_eidt_lenth")
     378                      .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     379                      .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     380              DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     381                      .dwattr DW$55, DW_AT_name("surplus_lenth"), DW_AT_symbol_name("_surplus_lenth")
     382                      .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     383                      .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     384              DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     385                      .dwattr DW$56, DW_AT_name("id"), DW_AT_symbol_name("_id")
     386                      .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     387                      .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     388              DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     389                      .dwattr DW$57, DW_AT_name("next_edit"), DW_AT_symbol_name("_next_edit")
     390                      .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     391                      .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     392                      .dwendtag DW$T$22
     393              
     394              DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
     395                      .dwattr DW$T$21, DW_AT_address_class(0x16)
     396              
     397                      .dwattr DW$19, DW_AT_external(0x01)
     398                      .dwattr DW$20, DW_AT_external(0x01)
     399                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     400              
     401              ;***************************************************************
     402              ;* DWARF CIE ENTRIES                                           *
     403              ;***************************************************************
     404              
     405              DW$CIE  .dwcie 1, 40
     406                      .dwcfa  0x0c, 20, 0
     407                      .dwcfa  0x07, 0
     408                      .dwcfa  0x07, 1
     409                      .dwcfa  0x07, 2
     410                      .dwcfa  0x07, 3
     411                      .dwcfa  0x07, 4
     412                      .dwcfa  0x07, 5
     413                      .dwcfa  0x08, 6
     414                      .dwcfa  0x08, 7
     415                      .dwcfa  0x08, 8
     416                      .dwcfa  0x08, 9
     417                      .dwcfa  0x08, 10
     418                      .dwcfa  0x08, 11
     419                      .dwcfa  0x07, 12
     420                      .dwcfa  0x07, 13
     421                      .dwcfa  0x07, 14
     422                      .dwcfa  0x07, 15
     423                      .dwcfa  0x07, 16
     424                      .dwcfa  0x07, 17
     425                      .dwcfa  0x07, 18
     426                      .dwcfa  0x07, 19
     427                      .dwcfa  0x07, 20
     428                      .dwcfa  0x07, 21
TMS320C2000 COFF Assembler PC v4.1.3 Tue Nov 30 14:11:45 2010

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI8762                            PAGE    9

     429                      .dwcfa  0x07, 22
     430                      .dwcfa  0x07, 23
     431                      .dwcfa  0x07, 24
     432                      .dwcfa  0x07, 25
     433                      .dwcfa  0x07, 26
     434                      .dwcfa  0x08, 27
     435                      .dwcfa  0x07, 28
     436                      .dwcfa  0x07, 29
     437                      .dwcfa  0x07, 30
     438                      .dwcfa  0x07, 31
     439                      .dwcfa  0x07, 32
     440                      .dwcfa  0x07, 33
     441                      .dwcfa  0x07, 34
     442                      .dwcfa  0x07, 35
     443                      .dwcfa  0x07, 36
     444                      .dwcfa  0x07, 37
     445                      .dwcfa  0x07, 38
     446                      .dwcfa  0x07, 39
     447                      .dwcfa  0x07, 40
     448              
     449              ;***************************************************************
     450              ;* DWARF REGISTER MAP                                          *
     451              ;***************************************************************
     452              
     453              DW$58   .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
     454                      .dwattr DW$58, DW_AT_location[DW_OP_reg0]
     455              DW$59   .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
     456                      .dwattr DW$59, DW_AT_location[DW_OP_reg1]
     457              DW$60   .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
     458                      .dwattr DW$60, DW_AT_location[DW_OP_reg2]
     459              DW$61   .dwtag  DW_TAG_assign_register, DW_AT_name("PH")
