TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:49:23 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9682                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sat Oct 08 14:49:23 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("fft_R1024.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

     639              
     640              DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     641                      .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     642                      .dwattr DW$T$10, DW_AT_byte_size(0x01)
     643              DW$54   .dwtag  DW_TAG_far_type
     644                      .dwattr DW$54, DW_AT_type(*DW$T$10)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:49:23 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9682                            PAGE   14

     645              DW$T$32 .dwtag  DW_TAG_volatile_type
     646                      .dwattr DW$T$32, DW_AT_type(*DW$54)
     647              DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$11)
     648                      .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     649              DW$T$12 .dwtag  DW_TAG_base_type, DW_AT_name("long")
     650                      .dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
     651                      .dwattr DW$T$12, DW_AT_byte_size(0x02)
     652              DW$T$19 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$12)
     653                      .dwattr DW$T$19, DW_AT_address_class(0x16)
     654              DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
     655                      .dwattr DW$T$27, DW_AT_address_class(0x16)
     656              
     657              DW$T$33 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$12)
     658                      .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
     659              DW$55   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
     660                      .dwendtag DW$T$33
     661              
     662              
     663              DW$T$36 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$35)
     664                      .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
     665                      .dwattr DW$T$36, DW_AT_byte_size(0x802)
     666              DW$56   .dwtag  DW_TAG_subrange_type
     667                      .dwattr DW$56, DW_AT_upper_bound(0x400)
     668                      .dwendtag DW$T$36
     669              
     670              
     671              DW$T$38 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
     672                      .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     673                      .dwattr DW$T$38, DW_AT_byte_size(0x804)
     674              DW$57   .dwtag  DW_TAG_subrange_type
     675                      .dwattr DW$57, DW_AT_upper_bound(0x401)
     676                      .dwendtag DW$T$38
     677              
     678              
     679              DW$T$39 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$12)
     680                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     681                      .dwattr DW$T$39, DW_AT_byte_size(0x402)
     682              DW$58   .dwtag  DW_TAG_subrange_type
     683                      .dwattr DW$58, DW_AT_upper_bound(0x200)
     684                      .dwendtag DW$T$39
     685              
     686              DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("_iq30"), DW_AT_type(*DW$T$12)
     687                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     688              DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
     689                      .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
     690                      .dwattr DW$T$16, DW_AT_byte_size(0x02)
     691              
     692              DW$T$41 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$16)
     693                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
     694              DW$59   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$12)
     695                      .dwendtag DW$T$41
     696              
     697              
     698              DW$T$44 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$16)
     699                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:49:23 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9682                            PAGE   15

     700                      .dwattr DW$T$44, DW_AT_byte_size(0x270)
     701              DW$60   .dwtag  DW_TAG_subrange_type
     702                      .dwattr DW$60, DW_AT_upper_bound(0x05)
     703              DW$61   .dwtag  DW_TAG_subrange_type
     704                      .dwattr DW$61, DW_AT_upper_bound(0x33)
     705                      .dwendtag DW$T$44
     706              
     707              
     708              DW$T$46 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$16)
     709                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
     710                      .dwattr DW$T$46, DW_AT_byte_size(0x0c)
     711              DW$62   .dwtag  DW_TAG_subrange_type
     712                      .dwattr DW$62, DW_AT_upper_bound(0x05)
     713                      .dwendtag DW$T$46
     714              
     715              DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("RFFT32"), DW_AT_type(*DW$T$22)
     716                      .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
     717              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     718                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     719                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     720              DW$T$26 .dwtag  DW_TAG_far_type
     721                      .dwattr DW$T$26, DW_AT_type(*DW$T$25)
     722              DW$T$35 .dwtag  DW_TAG_far_type
     723                      .dwattr DW$T$35, DW_AT_type(*DW$T$12)
     724              
     725              DW$T$22 .dwtag  DW_TAG_structure_type
     726                      .dwattr DW$T$22, DW_AT_byte_size(0x18)
     727              DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     728                      .dwattr DW$63, DW_AT_name("ipcbptr"), DW_AT_symbol_name("_ipcbptr")
     729                      .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730                      .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     731              DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     732                      .dwattr DW$64, DW_AT_name("tfptr"), DW_AT_symbol_name("_tfptr")
     733                      .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     734                      .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     735              DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     736                      .dwattr DW$65, DW_AT_name("size"), DW_AT_symbol_name("_size")
     737                      .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     738                      .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     739              DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     740                      .dwattr DW$66, DW_AT_name("nrstage"), DW_AT_symbol_name("_nrstage")
     741                      .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     742                      .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     743              DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     744                      .dwattr DW$67, DW_AT_name("magptr"), DW_AT_symbol_name("_magptr")
     745                      .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     746                      .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     747              DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     748                      .dwattr DW$68, DW_AT_name("winptr"), DW_AT_symbol_name("_winptr")
     749                      .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     750                      .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     751              DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$12)
     752                      .dwattr DW$69, DW_AT_name("peakmag"), DW_AT_symbol_name("_peakmag")
     753                      .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     754                      .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:49:23 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9682                            PAGE   16

     755              DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     756                      .dwattr DW$70, DW_AT_name("peakfrq"), DW_AT_symbol_name("_peakfrq")
     757                      .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     758                      .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     759              DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     760                      .dwattr DW$71, DW_AT_name("ratio"), DW_AT_symbol_name("_ratio")
     761                      .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     762                      .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     763              DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     764                      .dwattr DW$72, DW_AT_name("init"), DW_AT_symbol_name("_init")
     765                      .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     766                      .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     767              DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     768                      .dwattr DW$73, DW_AT_name("calc"), DW_AT_symbol_name("_calc")
     769                      .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     770                      .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     771              DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     772                      .dwattr DW$74, DW_AT_name("split"), DW_AT_symbol_name("_split")
     773                      .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     774                      .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     775              DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     776                      .dwattr DW$75, DW_AT_name("mag"), DW_AT_symbol_name("_mag")
     777                      .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     778                      .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     779              DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     780                      .dwattr DW$76, DW_AT_name("win"), DW_AT_symbol_name("_win")
     781                      .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     782                      .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     783                      .dwendtag DW$T$22
     784              
     785              DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
     786                      .dwattr DW$T$21, DW_AT_address_class(0x16)
     787              DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("int32"), DW_AT_type(*DW$T$12)
     788                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
     789              
     790                      .dwattr DW$36, DW_AT_external(0x01)
     791                      .dwattr DW$31, DW_AT_external(0x01)
     792                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     793              
     794              ;***************************************************************
     795              ;* DWARF CIE ENTRIES                                           *
     796              ;***************************************************************
     797              
     798              DW$CIE  .dwcie 1, 40
     799                      .dwcfa  0x0c, 20, 0
     800                      .dwcfa  0x07, 0
     801                      .dwcfa  0x07, 1
     802                      .dwcfa  0x07, 2
     803                      .dwcfa  0x07, 3
     804                      .dwcfa  0x07, 4
     805                      .dwcfa  0x07, 5
     806                      .dwcfa  0x08, 6
     807                      .dwcfa  0x08, 7
     808                      .dwcfa  0x08, 8
     809                      .dwcfa  0x08, 9
TMS320C2000 COFF Assembler PC v4.1.3 Sat Oct 08 14:49:23 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI9682                            PAGE   17

     810                      .dwcfa  0x08, 10
     811                      .dwcfa  0x08, 11
     812                      .dwcfa  0x07, 12
     813                      .dwcfa  0x07, 13
     814                      .dwcfa  0x07, 14
     815                      .dwcfa  0x07, 15
     816                      .dwcfa  0x07, 16
     817                      .dwcfa  0x07, 17
     818                      .dwcfa  0x07, 18
     819                      .dwcfa  0x07, 19
     820                      .dwcfa  0x07, 20
     821                      .dwcfa  0x07, 21
     822                      .dwcfa  0x07, 22
     823                      .dwcfa  0x07, 23
     824                      .dwcfa  0x07, 24
     825                      .dwcfa  0x07, 25
     826                      .dwcfa  0x07, 26
     827                      .dwcfa  0x08, 27
     828                      .dwcfa  0x07, 28
     829                      .dwcfa  0x07, 29
     830                      .dwcfa  0x07, 30
     831                      .dwcfa  0x07, 31
     832                      .dwcfa  0x07, 32
     833                      .dwcfa  0x07, 33
     834                      .dwcfa  0x07, 34
     835                      .dwcfa  0x07, 35
     836                      .dwcfa  0x07, 36
     837                      .dwcfa  0x07, 37
     838                      .dwcfa  0x07, 38
     839                      .dwcfa  0x07, 39
     840                      .dwcfa  0x07, 40
     841              
     842              ;***************************************************************
     843              ;* DWARF REGISTER MAP                                          *
     844              ;***************************************************************
     845              
     846              DW$77   .dwtag  DW_TAG_assign_register, DW_AT_name("AL")
     847                      .dwattr DW$77, DW_AT_location[DW_OP_reg0]
     848              DW$78   .dwtag  DW_TAG_assign_register, DW_AT_name("AH")
     849                      .dwattr DW$78, DW_AT_location[DW_OP_reg1]
     850              DW$79   .dwtag  DW_TAG_assign_register, DW_AT_name("PL")
