TMS320C2000 COFF Assembler PC v4.1.3 Sat Sep 24 16:15:22 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6122                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sat Sep 24 16:15:22 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("os_driver_maneger.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6122                            PAGE   18

     853              DW$T$49 .dwtag  DW_TAG_subroutine_type
     854                      .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
     855              DW$62   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     856              DW$63   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     857              DW$64   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
     858                      .dwendtag DW$T$49
     859              
     860              
     861              DW$T$51 .dwtag  DW_TAG_subroutine_type
     862                      .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
     863              DW$65   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     864              DW$66   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     865              DW$67   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
     866                      .dwendtag DW$T$51
     867              
     868              
     869              DW$T$53 .dwtag  DW_TAG_subroutine_type
     870                      .dwattr DW$T$53, DW_AT_language(DW_LANG_C)
     871              DW$68   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
     872                      .dwendtag DW$T$53
     873              
     874              
     875              DW$T$55 .dwtag  DW_TAG_subroutine_type
     876                      .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
     877              DW$69   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
     878              DW$70   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
     879              DW$71   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     880                      .dwendtag DW$T$55
     881              
     882              DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     883                      .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     884                      .dwattr DW$T$6, DW_AT_byte_size(0x01)
     885              DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
     886                      .dwattr DW$T$24, DW_AT_address_class(0x16)
     887              DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("dev_id_t"), DW_AT_type(*DW$T$6)
     888                      .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
     889              
     890              DW$T$62 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$37)
     891                      .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
     892              DW$72   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$60)
     893              DW$73   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$61)
     894                      .dwendtag DW$T$62
     895              
     896              
     897              DW$T$57 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$6)
     898                      .dwattr DW$T$57, DW_AT_language(DW_LANG_C)
     899              DW$74   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
     900                      .dwendtag DW$T$57
     901              
     902              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
     903                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     904              
     905              DW$T$63 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
     906                      .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
     907              DW$75   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Sep 24 16:15:22 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6122                            PAGE   19

     908              DW$76   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
     909              DW$77   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
     910              DW$78   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     911                      .dwendtag DW$T$63
     912              
     913              DW$T$46 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$45)
     914                      .dwattr DW$T$46, DW_AT_address_class(0x16)
     915              DW$T$56 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$46)
     916                      .dwattr DW$T$56, DW_AT_address_class(0x16)
     917              DW$T$60 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$59)
     918                      .dwattr DW$T$60, DW_AT_address_class(0x16)
     919              DW$T$61 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
     920                      .dwattr DW$T$61, DW_AT_address_class(0x16)
     921              DW$T$67 .dwtag  DW_TAG_typedef, DW_AT_name("os_dirver_maneger_t"), DW_AT_type(*DW$T$43)
     922                      .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
     923              DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     924                      .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     925                      .dwattr DW$T$11, DW_AT_byte_size(0x01)
     926              DW$T$45 .dwtag  DW_TAG_typedef, DW_AT_name("a_lock_t"), DW_AT_type(*DW$T$44)
     927                      .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
     928              DW$T$59 .dwtag  DW_TAG_typedef, DW_AT_name("os_dirver_operate_t"), DW_AT_type(*DW$T$36)
     929                      .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
     930              DW$T$38 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     931                      .dwattr DW$T$38, DW_AT_encoding(DW_ATE_signed_char)
     932                      .dwattr DW$T$38, DW_AT_byte_size(0x01)
     933              
     934              DW$T$43 .dwtag  DW_TAG_structure_type
     935                      .dwattr DW$T$43, DW_AT_byte_size(0x2be)
     936              DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     937                      .dwattr DW$79, DW_AT_name("real_size"), DW_AT_symbol_name("_real_size")
     938                      .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939                      .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     940              DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
     941                      .dwattr DW$80, DW_AT_name("os_driver_member"), DW_AT_symbol_name("_os_driver_member")
     942                      .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     943                      .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
     944                      .dwendtag DW$T$43
     945              
     946              DW$T$44 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
     947                      .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
     948              
     949              DW$T$36 .dwtag  DW_TAG_structure_type
     950                      .dwattr DW$T$36, DW_AT_byte_size(0x0a)
     951              DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
     952                      .dwattr DW$81, DW_AT_name("os_driver_read"), DW_AT_symbol_name("_os_driver_read")
     953                      .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
     955              DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     956                      .dwattr DW$82, DW_AT_name("os_driver_write"), DW_AT_symbol_name("_os_driver_write")
     957                      .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     958                      .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
     959              DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
     960                      .dwattr DW$83, DW_AT_name("os_driver_ioctl"), DW_AT_symbol_name("_os_driver_ioctl")
     961                      .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     962                      .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Sep 24 16:15:22 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6122                            PAGE   20

     963              DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     964                      .dwattr DW$84, DW_AT_name("os_driver_init"), DW_AT_symbol_name("_os_driver_init")
     965                      .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     966                      .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
     967              DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
     968                      .dwattr DW$85, DW_AT_name("os_driver_uninstall"), DW_AT_symbol_name("_os_driver_uninstall")
     969                      .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     970                      .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
     971                      .dwendtag DW$T$36
     972              
     973              
     974              DW$T$42 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$41)
     975                      .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     976                      .dwattr DW$T$42, DW_AT_byte_size(0x2bc)
     977              DW$86   .dwtag  DW_TAG_subrange_type
     978                      .dwattr DW$86, DW_AT_upper_bound(0x18)
     979                      .dwendtag DW$T$42
     980              
     981              DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_ioctl_t"), DW_AT_type(*DW$T$30)
     982                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     983              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_init_t"), DW_AT_type(*DW$T$33)
     984                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     985              DW$T$35 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_uninstall_t"), DW_AT_type(*DW$T$33)
     986                      .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
     987              DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_read_t"), DW_AT_type(*DW$T$26)
     988                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     989              DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("os_driver_write_t"), DW_AT_type(*DW$T$26)
     990                      .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     991              
     992              DW$T$22 .dwtag  DW_TAG_structure_type
     993                      .dwattr DW$T$22, DW_AT_name("os_event")
     994                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
     995              DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     996                      .dwattr DW$87, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
     997                      .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     998                      .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
     999              DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1000                      .dwattr DW$88, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    1001                      .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1002                      .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1003              DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1004                      .dwattr DW$89, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    1005                      .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1006                      .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1007              DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1008                      .dwattr DW$90, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    1009                      .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1010                      .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1011              DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1012                      .dwattr DW$91, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    1013                      .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1014                      .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1015                      .dwendtag DW$T$22
    1016              
    1017              DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("os_dirver_member_t"), DW_AT_type(*DW$T$40)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Sep 24 16:15:22 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6122                            PAGE   21

    1018                      .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    1019              DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
    1020                      .dwattr DW$T$30, DW_AT_address_class(0x16)
    1021              DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
    1022                      .dwattr DW$T$33, DW_AT_address_class(0x16)
    1023              DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("INT8U"), DW_AT_type(*DW$T$6)
    1024                      .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    1025              
    1026              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    1027                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    1028                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    1029              DW$92   .dwtag  DW_TAG_subrange_type
    1030                      .dwattr DW$92, DW_AT_upper_bound(0x07)
    1031                      .dwendtag DW$T$21
    1032              
    1033              DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("INT16U"), DW_AT_type(*DW$T$11)
    1034                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    1035              DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    1036                      .dwattr DW$T$26, DW_AT_address_class(0x16)
    1037              
    1038              DW$T$40 .dwtag  DW_TAG_structure_type
    1039                      .dwattr DW$T$40, DW_AT_byte_size(0x1c)
    1040              DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    1041                      .dwattr DW$93, DW_AT_name("id"), DW_AT_symbol_name("_id")
    1042                      .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1043                      .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1044              DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1045                      .dwattr DW$94, DW_AT_name("os_driver_read"), DW_AT_symbol_name("_os_driver_read")
    1046                      .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1047                      .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1048              DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1049                      .dwattr DW$95, DW_AT_name("os_driver_write"), DW_AT_symbol_name("_os_driver_write")
    1050                      .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1051                      .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1052              DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    1053                      .dwattr DW$96, DW_AT_name("os_driver_ioctl"), DW_AT_symbol_name("_os_driver_ioctl")
    1054                      .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1055                      .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1056              DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
    1057                      .dwattr DW$97, DW_AT_name("os_driver_init"), DW_AT_symbol_name("_os_driver_init")
    1058                      .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1059                      .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1060              DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    1061                      .dwattr DW$98, DW_AT_name("os_driver_uninstall"), DW_AT_symbol_name("_os_driver_uninstall")
    1062                      .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1063                      .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1064              DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    1065                      .dwattr DW$99, DW_AT_name("os_driver_name"), DW_AT_symbol_name("_os_driver_name")
    1066                      .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1067                      .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1068                      .dwendtag DW$T$40
    1069              
    1070              
    1071              DW$T$29 .dwtag  DW_TAG_subroutine_type
    1072                      .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Sep 24 16:15:22 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6122                            PAGE   22

    1073              DW$100  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
    1074              DW$101  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1075                      .dwendtag DW$T$29
    1076              
    1077              
    1078              DW$T$25 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
    1079                      .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    1080              DW$102  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
    1081              DW$103  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
    1082              DW$104  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1083                      .dwendtag DW$T$25
    1084              
    1085              
    1086              DW$T$39 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$38)
    1087                      .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    1088                      .dwattr DW$T$39, DW_AT_byte_size(0x0f)
    1089              DW$105  .dwtag  DW_TAG_subrange_type
    1090                      .dwattr DW$105, DW_AT_upper_bound(0x0e)
    1091                      .dwendtag DW$T$39
    1092              
    1093              
    1094                      .dwattr DW$17, DW_AT_external(0x01)
    1095                      .dwattr DW$17, DW_AT_type(*DW$T$37)
    1096                      .dwattr DW$26, DW_AT_external(0x01)
    1097                      .dwattr DW$32, DW_AT_external(0x01)
    1098                      .dwattr DW$53, DW_AT_external(0x01)
    1099                      .dwattr DW$60, DW_AT_external(0x01)
    1100                      .dwattr DW$35, DW_AT_external(0x01)
    1101                      .dwattr DW$35, DW_AT_type(*DW$T$23)
    1102                      .dwattr DW$29, DW_AT_external(0x01)
    1103                      .dwattr DW$44, DW_AT_external(0x01)
    1104                      .dwattr DW$44, DW_AT_type(*DW$T$23)
    1105                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1106              
    1107              ;***************************************************************
    1108              ;* DWARF CIE ENTRIES                                           *
    1109              ;***************************************************************
    1110              
    1111              DW$CIE  .dwcie 1, 40
    1112                      .dwcfa  0x0c, 20, 0
    1113                      .dwcfa  0x07, 0
    1114                      .dwcfa  0x07, 1
    1115                      .dwcfa  0x07, 2
    1116                      .dwcfa  0x07, 3
    1117                      .dwcfa  0x07, 4
    1118                      .dwcfa  0x07, 5
    1119                      .dwcfa  0x08, 6
    1120                      .dwcfa  0x08, 7
    1121                      .dwcfa  0x08, 8
    1122                      .dwcfa  0x08, 9
    1123                      .dwcfa  0x08, 10
    1124                      .dwcfa  0x08, 11
    1125                      .dwcfa  0x07, 12
    1126                      .dwcfa  0x07, 13
    1127                      .dwcfa  0x07, 14
TMS320C2000 COFF Assembler PC v4.1.3 Sat Sep 24 16:15:22 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6122                            PAGE   23

    1128                      .dwcfa  0x07, 15
    1129                      .dwcfa  0x07, 16
