TMS320C2000 COFF Assembler PC v4.1.3 Sat Sep 24 16:15:23 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3202                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v4.1.3 *
       3              ;* Date/Time created: Sat Sep 24 16:15:23 2011                 *
       4              ;***************************************************************
       5                      .compiler_opts --mem_model:code=flat --mem_model:data=large --silicon_version=28 
       6        0002  FP      .set    XAR2
       7              
       8              DW$CU   .dwtag  DW_TAG_compile_unit
       9                      .dwattr DW$CU, DW_AT_name("os_mod_maneger.c")
      10                      .dwattr DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v4.1.3 Copyright (c) 1996-2006 Texas Inst
      11                      .dwattr DW$CU, DW_AT_stmt_list(0x00)
      12                      .dwattr DW$CU, DW_AT_TI_VERSION(0x01)
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************
      16 00000000               .sect   ".cinit"
      17                      .align  1

    1855                      .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    1856              DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("Bsize_t"), DW_AT_type(*DW$T$11)
    1857                      .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
    1858              
    1859              DW$T$76 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
    1860                      .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
    1861              DW$159  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$62)
    1862                      .dwendtag DW$T$76
    1863              
    1864              
    1865              DW$T$79 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
    1866                      .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
    1867              DW$160  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$78)
    1868                      .dwendtag DW$T$79
    1869              
    1870              
    1871              DW$T$80 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
    1872                      .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    1873              DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$13)
    1874                      .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
    1875              DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
    1876                      .dwattr DW$T$35, DW_AT_address_class(0x16)
    1877              DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$46)
    1878                      .dwattr DW$T$47, DW_AT_address_class(0x16)
    1879              DW$T$48 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$47)
    1880                      .dwattr DW$T$48, DW_AT_address_class(0x16)
    1881              DW$T$69 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$68)
    1882                      .dwattr DW$T$69, DW_AT_address_class(0x16)
    1883              DW$T$70 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$69)
    1884                      .dwattr DW$T$70, DW_AT_address_class(0x16)
    1885              DW$T$78 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
    1886                      .dwattr DW$T$78, DW_AT_address_class(0x16)
    1887              DW$T$87 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$86)
    1888                      .dwattr DW$T$87, DW_AT_address_class(0x16)
    1889              
    1890              DW$T$88 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$87)
    1891                      .dwattr DW$T$88, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Sep 24 16:15:23 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3202                            PAGE   37

    1892              
    1893              DW$T$90 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$86)
    1894                      .dwattr DW$T$90, DW_AT_language(DW_LANG_C)
    1895                      .dwattr DW$T$90, DW_AT_byte_size(0x0c)
    1896              DW$161  .dwtag  DW_TAG_subrange_type
    1897                      .dwattr DW$161, DW_AT_upper_bound(0x02)
    1898                      .dwendtag DW$T$90
    1899              
    1900              DW$T$92 .dwtag  DW_TAG_typedef, DW_AT_name("module_id_t"), DW_AT_type(*DW$T$30)
    1901                      .dwattr DW$T$92, DW_AT_language(DW_LANG_C)
    1902              DW$T$93 .dwtag  DW_TAG_typedef, DW_AT_name("app_mod_maneger_t"), DW_AT_type(*DW$T$33)
    1903                      .dwattr DW$T$93, DW_AT_language(DW_LANG_C)
    1904              DW$T$62 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$61)
    1905                      .dwattr DW$T$62, DW_AT_address_class(0x16)
    1906              
    1907              DW$T$81 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$62)
    1908                      .dwattr DW$T$81, DW_AT_language(DW_LANG_C)
    1909              DW$162  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$62)
    1910              DW$163  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$62)
    1911                      .dwendtag DW$T$81
    1912              
    1913              
    1914              DW$T$83 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$61)
    1915                      .dwattr DW$T$83, DW_AT_language(DW_LANG_C)
    1916                      .dwattr DW$T$83, DW_AT_byte_size(0x14)
    1917              DW$164  .dwtag  DW_TAG_subrange_type
    1918                      .dwattr DW$164, DW_AT_upper_bound(0x13)
    1919                      .dwendtag DW$T$83
    1920              
    1921              DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    1922                      .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1923                      .dwattr DW$T$13, DW_AT_byte_size(0x02)
    1924              DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("OS_EVENT"), DW_AT_type(*DW$T$22)
    1925                      .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    1926              DW$T$46 .dwtag  DW_TAG_typedef, DW_AT_name("a_q_t"), DW_AT_type(*DW$T$34)
    1927                      .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
    1928              DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("a_sem_t"), DW_AT_type(*DW$T$34)
    1929                      .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    1930              DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("app_mod_inlet_t"), DW_AT_type(*DW$T$28)
    1931                      .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    1932              DW$T$86 .dwtag  DW_TAG_typedef, DW_AT_name("app_mod_handle_msg_t"), DW_AT_type(*DW$T$29)
    1933                      .dwattr DW$T$86, DW_AT_language(DW_LANG_C)
    1934              
    1935              DW$T$30 .dwtag  DW_TAG_structure_type
    1936                      .dwattr DW$T$30, DW_AT_byte_size(0x0e)
    1937              DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1938                      .dwattr DW$165, DW_AT_name("DL_measure_mod_id"), DW_AT_symbol_name("_DL_measure_mod_id")
    1939                      .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1940                      .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1941              DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1942                      .dwattr DW$166, DW_AT_name("Sys_setup_mod_id"), DW_AT_symbol_name("_Sys_setup_mod_id")
    1943                      .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1944                      .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1945              DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1946                      .dwattr DW$167, DW_AT_name("USB_mod_id"), DW_AT_symbol_name("_USB_mod_id")
TMS320C2000 COFF Assembler PC v4.1.3 Sat Sep 24 16:15:23 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3202                            PAGE   38

    1947                      .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1948                      .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1949              DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1950                      .dwattr DW$168, DW_AT_name("RM_mod_id"), DW_AT_symbol_name("_RM_mod_id")
    1951                      .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1952                      .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1953              DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1954                      .dwattr DW$169, DW_AT_name("PC_mod_id"), DW_AT_symbol_name("_PC_mod_id")
    1955                      .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1956                      .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1957              DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1958                      .dwattr DW$170, DW_AT_name("Help_mod_id"), DW_AT_symbol_name("_Help_mod_id")
    1959                      .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1960                      .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1961              DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1962                      .dwattr DW$171, DW_AT_name("HZ_input_mod_id"), DW_AT_symbol_name("_HZ_input_mod_id")
    1963                      .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1964                      .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1965              DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1966                      .dwattr DW$172, DW_AT_name("Err_correct_mod_id"), DW_AT_symbol_name("_Err_correct_mod_id")
    1967                      .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1968                      .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1969              DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1970                      .dwattr DW$173, DW_AT_name("Wave_mod_id"), DW_AT_symbol_name("_Wave_mod_id")
    1971                      .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1972                      .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1973              DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1974                      .dwattr DW$174, DW_AT_name("USER_mod_id"), DW_AT_symbol_name("_USER_mod_id")
    1975                      .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1976                      .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1977              DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1978                      .dwattr DW$175, DW_AT_name("COMR_mod_id"), DW_AT_symbol_name("_COMR_mod_id")
    1979                      .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1980                      .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1981              DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1982                      .dwattr DW$176, DW_AT_name("WIR_mod_id"), DW_AT_symbol_name("_WIR_mod_id")
    1983                      .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1984                      .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1985              DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1986                      .dwattr DW$177, DW_AT_name("Save_mod_id"), DW_AT_symbol_name("_Save_mod_id")
    1987                      .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1988                      .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1989              DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1990                      .dwattr DW$178, DW_AT_name("Iout_mod_id"), DW_AT_symbol_name("_Iout_mod_id")
    1991                      .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1992                      .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1993                      .dwendtag DW$T$30
    1994              
    1995              
    1996              DW$T$33 .dwtag  DW_TAG_structure_type
    1997                      .dwattr DW$T$33, DW_AT_byte_size(0x5c)
    1998              DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1999                      .dwattr DW$179, DW_AT_name("real_mod_num"), DW_AT_symbol_name("_real_mod_num")
    2000                      .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                      .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Sep 24 16:15:23 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3202                            PAGE   39

    2002              DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    2003                      .dwattr DW$180, DW_AT_name("mod_inlet_list"), DW_AT_symbol_name("_mod_inlet_list")
    2004                      .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2005                      .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2006                      .dwendtag DW$T$33
    2007              
    2008              DW$T$61 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    2009                      .dwattr DW$T$61, DW_AT_encoding(DW_ATE_signed_char)
    2010                      .dwattr DW$T$61, DW_AT_byte_size(0x01)
    2011              
    2012              DW$T$22 .dwtag  DW_TAG_structure_type
    2013                      .dwattr DW$T$22, DW_AT_name("os_event")
    2014                      .dwattr DW$T$22, DW_AT_byte_size(0x0e)
    2015              DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2016                      .dwattr DW$181, DW_AT_name("OSEventType"), DW_AT_symbol_name("_OSEventType")
    2017                      .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2018                      .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2019              DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2020                      .dwattr DW$182, DW_AT_name("OSEventPtr"), DW_AT_symbol_name("_OSEventPtr")
    2021                      .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2022                      .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2023              DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    2024                      .dwattr DW$183, DW_AT_name("OSEventCnt"), DW_AT_symbol_name("_OSEventCnt")
    2025                      .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2026                      .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2027              DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2028                      .dwattr DW$184, DW_AT_name("OSEventGrp"), DW_AT_symbol_name("_OSEventGrp")
    2029                      .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2030                      .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2031              DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2032                      .dwattr DW$185, DW_AT_name("OSEventTbl"), DW_AT_symbol_name("_OSEventTbl")
    2033                      .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2034                      .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2035                      .dwendtag DW$T$22
    2036              
    2037              
    2038              DW$T$28 .dwtag  DW_TAG_structure_type
    2039                      .dwattr DW$T$28, DW_AT_byte_size(0x06)
    2040              DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2041                      .dwattr DW$186, DW_AT_name("mod_id"), DW_AT_symbol_name("_mod_id")
    2042                      .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2043                      .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2044              DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    2045                      .dwattr DW$187, DW_AT_name("insmod_fun"), DW_AT_symbol_name("_insmod_fun")
    2046                      .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2047                      .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2048              DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    2049                      .dwattr DW$188, DW_AT_name("exitmod_fun"), DW_AT_symbol_name("_exitmod_fun")
    2050                      .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2051                      .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2052                      .dwendtag DW$T$28
    2053              
    2054              
    2055              DW$T$32 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$31)
    2056                      .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Sep 24 16:15:23 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3202                            PAGE   40

    2057                      .dwattr DW$T$32, DW_AT_byte_size(0x5a)
    2058              DW$189  .dwtag  DW_TAG_subrange_type
    2059                      .dwattr DW$189, DW_AT_upper_bound(0x0e)
    2060                      .dwendtag DW$T$32
    2061              
    2062              
    2063              DW$T$29 .dwtag  DW_TAG_structure_type
    2064                      .dwattr DW$T$29, DW_AT_byte_size(0x04)
    2065              DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2066                      .dwattr DW$190, DW_AT_name("occupy_flag"), DW_AT_symbol_name("_occupy_flag")
    2067                      .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2068                      .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2069              DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2070                      .dwattr DW$191, DW_AT_name("msg_type"), DW_AT_symbol_name("_msg_type")
    2071                      .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2072                      .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2073              DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2074                      .dwattr DW$192, DW_AT_name("start_mod_id"), DW_AT_symbol_name("_start_mod_id")
    2075                      .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2076                      .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2077              DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    2078                      .dwattr DW$193, DW_AT_name("stop_mod_id"), DW_AT_symbol_name("_stop_mod_id")
    2079                      .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2080                      .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2081                      .dwendtag DW$T$29
    2082              
    2083              DW$T$26 .dwtag  DW_TAG_typedef, DW_AT_name("app_insmod_t"), DW_AT_type(*DW$T$25)
    2084                      .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    2085              DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("app_exitmod_t"), DW_AT_type(*DW$T$25)
    2086                      .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    2087              
    2088              DW$T$21 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    2089                      .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    2090                      .dwattr DW$T$21, DW_AT_byte_size(0x08)
    2091              DW$194  .dwtag  DW_TAG_subrange_type
    2092                      .dwattr DW$194, DW_AT_upper_bound(0x07)
    2093                      .dwendtag DW$T$21
    2094              
    2095              DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    2096                      .dwattr DW$T$25, DW_AT_address_class(0x16)
    2097              
    2098                      .dwattr DW$66, DW_AT_external(0x01)
    2099                      .dwattr DW$66, DW_AT_type(*DW$T$23)
    2100                      .dwattr DW$97, DW_AT_external(0x01)
    2101                      .dwattr DW$75, DW_AT_external(0x01)
    2102                      .dwattr DW$56, DW_AT_external(0x01)
    2103                      .dwattr DW$127, DW_AT_external(0x01)
    2104                      .dwattr DW$127, DW_AT_type(*DW$T$23)
    2105                      .dwattr DW$128, DW_AT_external(0x01)
    2106                      .dwattr DW$128, DW_AT_type(*DW$T$23)
    2107                      .dwattr DW$79, DW_AT_external(0x01)
    2108                      .dwattr DW$79, DW_AT_type(*DW$T$87)
    2109                      .dwattr DW$129, DW_AT_external(0x01)
    2110                      .dwattr DW$129, DW_AT_type(*DW$T$23)
    2111                      .dwattr DW$100, DW_AT_external(0x01)
TMS320C2000 COFF Assembler PC v4.1.3 Sat Sep 24 16:15:23 2011

Tools Copyright (c) 1996-2006 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3202                            PAGE   41

    2112                      .dwattr DW$126, DW_AT_external(0x01)
    2113                      .dwattr DW$123, DW_AT_external(0x01)
    2114                      .dwattr DW$123, DW_AT_type(*DW$T$23)
    2115                      .dwattr DW$120, DW_AT_external(0x01)
    2116                      .dwattr DW$84, DW_AT_external(0x01)
    2117                      .dwattr DW$52, DW_AT_external(0x01)
    2118                      .dwattr DW$46, DW_AT_external(0x01)
    2119                      .dwattr DW$103, DW_AT_external(0x01)
    2120                      .dwattr DW$49, DW_AT_external(0x01)
    2121                      .dwattr DW$60, DW_AT_external(0x01)
    2122                      .dwattr DW$96, DW_AT_external(0x01)
    2123                      .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    2124              
    2125              ;***************************************************************
    2126              ;* DWARF CIE ENTRIES                                           *
    2127              ;***************************************************************
    2128              
    2129              DW$CIE  .dwcie 1, 40
    2130                      .dwcfa  0x0c, 20, 0
    2131                      .dwcfa  0x07, 0
    2132                      .dwcfa  0x07, 1
    2133                      .dwcfa  0x07, 2
    2134                      .dwcfa  0x07, 3
    2135                      .dwcfa  0x07, 4
    2136                      .dwcfa  0x07, 5
    2137                      .dwcfa  0x08, 6
    2138                      .dwcfa  0x08, 7
    2139                      .dwcfa  0x08, 8
    2140                      .dwcfa  0x08, 9
